
google.charts.load('current', {'packages':['bar', 'line', 'corechart']});
    function drawBAR3Chart0() {
        var data = google.visualization.arrayToDataTable([
                ['Účel', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Auto-moto (237 z 4229)',
                    0, 0.0236, 0.0473, 0.3783, 0, 0.5675, 0.0236, 0.8986, 1.3951, 1.4897, 0.7803
                    ], 
                   ['Cestování (15 z 395)',
                    0, 0, 0, 0.2532, 0, 0.2532, 0, 1.0127, 1.519, 0.2532, 0.5063
                    ], 
                   ['Domácnost (387 z 5149)',
                    0, 0.0194, 0.0971, 0.505, 0.0194, 0.9905, 0, 1.6702, 1.5149, 1.4372, 1.2624
                    ], 
                   ['Elektronika (20 z 479)',
                    0, 0, 0.4175, 0.2088, 0, 0.4175, 0, 1.0438, 0.2088, 1.0438, 0.8351
                    ], 
                   ['Jiné (262 z 3972)',
                    0, 0.0504, 0.1007, 0.4783, 0.0504, 0.9315, 0, 1.5609, 1.2336, 1.2085, 0.9819
                    ], 
                   ['Refinancování půjček (357 z 5819)',
                    0, 0.0516, 0.1547, 0.4468, 0.0172, 0.9624, 0.0172, 1.1342, 1.0827, 1.117, 1.1514
                    ], 
                   ['Vlastní projekt (87 z 1107)',
                    0, 0.0903, 0.271, 0.3613, 0.1807, 0.813, 0, 1.897, 1.7164, 1.8067, 0.7227
                    ], 
                   ['Vzdělání (13 z 306)',
                    0, 0, 0, 0.3268, 0, 0.9804, 0, 0.6536, 0.3268, 1.9608, 0
                    ], 
                   ['Zdraví (19 z 353)',
                    0, 0, 0.2833, 0.2833, 0, 0.8499, 0, 0.5666, 1.4164, 0.5666, 1.4164
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle účelu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-0-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart0);
    function drawBAR3Chart1() {
        var data = google.visualization.arrayToDataTable([
                ['Kraj', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Hlavní město Praha (137 z 2914)',
                    0, 0, 0.1716, 0.4118, 0.0343, 0.5834, 0.0343, 1.0638, 0.9952, 0.9952, 0.4118
                    ], 
                   ['Jihomoravský kraj (113 z 2220)',
                    0, 0.045, 0.3153, 0.3153, 0.0901, 0.7658, 0, 0.991, 0.6757, 1.1261, 0.7658
                    ], 
                   ['Jihočeský kraj (80 z 1011)',
                    0, 0, 0.3956, 0.3956, 0, 1.088, 0.0989, 2.0772, 1.2859, 1.2859, 1.2859
                    ], 
                   ['Karlovarský kraj (47 z 605)',
                    0, 0, 0, 0, 0, 0.8264, 0, 2.1488, 1.8182, 1.9835, 0.9917
                    ], 
                   ['Kraj Vysočina (46 z 810)',
                    0, 0, 0, 0.4938, 0, 0.7407, 0, 0.8642, 1.6049, 0.6173, 1.358
                    ], 
                   ['Královéhradecký kraj (64 z 1023)',
                    0, 0, 0, 0.2933, 0, 0.8798, 0, 1.7595, 0.9775, 1.2708, 1.0753
                    ], 
                   ['Liberecký kraj (79 z 1063)',
                    0, 0.0941, 0, 0.0941, 0, 1.317, 0, 1.4111, 1.8815, 1.5052, 1.1289
                    ], 
                   ['Moravskoslezský kraj (204 z 2885)',
                    0, 0.0347, 0.1386, 0.4506, 0, 1.1092, 0, 1.4558, 1.3518, 1.2478, 1.2825
                    ], 
                   ['Olomoucký kraj (77 z 1251)',
                    0, 0, 0, 0.5596, 0, 0.4796, 0, 0.7994, 1.279, 1.8385, 1.199
                    ], 
                   ['Pardubický kraj (64 z 935)',
                    0, 0.107, 0, 0.7487, 0, 0.6417, 0, 1.8182, 1.1765, 1.3904, 0.9626
                    ], 
                   ['Plzeňský kraj (86 z 1077)',
                    0, 0.1857, 0, 0.4643, 0, 0.8357, 0, 1.4856, 2.3213, 1.7642, 0.9285
                    ], 
                   ['Středočeský kraj (187 z 3079)',
                    0, 0.0325, 0.065, 0.4222, 0.0325, 0.682, 0, 1.3966, 1.2017, 1.0393, 1.2017
                    ], 
                   ['Zlínský kraj (58 z 1015)',
                    0, 0.0985, 0.2956, 0.6897, 0, 0.8867, 0, 0.6897, 1.1823, 0.8867, 0.9852
                    ], 
                   ['Ústecký kraj (155 z 1921)',
                    0, 0, 0.0521, 0.6247, 0.1041, 1.2493, 0, 1.2493, 1.5617, 2.0302, 1.1973
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle kraje žadatele',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-1-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart1);
    function drawBAR3Chart2() {
        var data = google.visualization.arrayToDataTable([
                ['Zdroj příjmu', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Důchod (110 z 1051)',
                    0, 0.1903, 0.3806, 0.7612, 0.1903, 1.7127, 0, 2.0932, 1.2369, 2.3787, 1.5224
                    ], 
                   ['Jiné (12 z 160)',
                    0, 0, 0, 0.625, 0, 0, 0, 1.875, 1.25, 1.25, 2.5
                    ], 
                   ['OSVČ (131 z 2219)',
                    0, 0, 0.1803, 0.4957, 0.0901, 0.6309, 0.0451, 1.7575, 1.1717, 1.0816, 0.4507
                    ], 
                   ['Podnikatel (18 z 328)',
                    0, 0, 0, 0.9146, 0, 0.3049, 0, 0.9146, 1.2195, 2.1341, 0
                    ], 
                   ['Rodičovská dovolená (50 z 534)',
                    0, 0, 0, 0.3745, 0, 0.9363, 0, 0.9363, 2.4345, 1.6854, 2.9963
                    ], 
                   ['Student (7 z 84)',
                    0, 0, 0, 0, 0, 0, 0, 1.1905, 1.1905, 3.5714, 2.381
                    ], 
                   ['Svobodné povolání (9 z 71)',
                    0, 0, 0, 0, 0, 0, 0, 2.8169, 5.6338, 1.4085, 2.8169
                    ], 
                   ['Zaměstnanec (1058 z 17357)',
                    0, 0.0346, 0.1037, 0.4033, 0.0115, 0.8527, 0.0058, 1.2156, 1.2502, 1.2272, 0.991
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle zdroje příjmu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-2-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart2);
    function drawBAR3Chart3() {
        var data = google.visualization.arrayToDataTable([
                ['Výše úvěru [tis. Kč]', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['do 50 (494 z 8163)',
                    0, 0, 0.0613, 0.1593, 0, 0.539, 0.0123, 0.9678, 1.0658, 1.6048, 1.6416
                    ], 
                   ['od 50 do 100 (399 z 5107)',
                    0, 0.0196, 0.0979, 0.2937, 0.0587, 0.9595, 0, 1.684, 1.8406, 1.5665, 1.2923
                    ], 
                   ['od 100 do 150 (202 z 2743)',
                    0, 0.1094, 0.0365, 0.7291, 0.0365, 0.875, 0, 1.8228, 1.8228, 1.4218, 0.5104
                    ], 
                   ['od 150 do 200 (136 z 2238)',
                    0, 0, 0.0894, 0.5809, 0.0447, 1.2958, 0, 1.5192, 1.0277, 1.1618, 0.3575
                    ], 
                   ['od 200 do 250 (52 z 1112)',
                    0, 0.0899, 0.4496, 0.7194, 0.0899, 1.259, 0, 1.0791, 0.8094, 0.1799, 0
                    ], 
                   ['od 250 do 300 (56 z 1070)',
                    0, 0.0935, 0.1869, 1.4019, 0, 0.8411, 0, 1.3084, 0.9346, 0.3738, 0.0935
                    ], 
                   ['od 300 do 350 (20 z 443)',
                    0, 0.2257, 0.2257, 0.4515, 0, 1.3544, 0.2257, 0.6772, 1.1287, 0.2257, 0
                    ], 
                   ['od 350 do 400 (15 z 364)',
                    0, 0.2747, 0.5495, 0.5495, 0, 1.0989, 0, 0.8242, 0.5495, 0.2747, 0
                    ], 
                   ['od 400 do 450 (8 z 174)',
                    0, 0, 1.1494, 0.5747, 0, 2.2989, 0, 0.5747, 0, 0, 0
                    ], 
                   ['od 450 do 500 (14 z 321)',
                    0, 0, 0.3115, 1.8692, 0, 0.6231, 0, 1.2461, 0.3115, 0, 0
                    ], 
                   ['od 500 do 550 (0 z 19)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['od 550 do 600 (0 z 21)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['od 600 do 650 (1 z 14)',
                    0, 0, 0, 0, 0, 7.1429, 0, 0, 0, 0, 0
                    ], 
                   ['od 650 do 700 (0 z 11)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['od 700 (0 z 9)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle výše úvěru',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-3-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart3);
    function drawBAR3Chart4() {
        var data = google.visualization.arrayToDataTable([
                ['Délka úvěru [měs.]', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['do 6 (4 z 309)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0.6472, 0.3236, 0.3236
                    ], 
                   ['od 6 do 12 (49 z 1316)',
                    0, 0, 0, 0, 0, 0.152, 0, 0.228, 0.4559, 0.9119, 1.9757
                    ], 
                   ['od 12 do 18 (42 z 1441)',
                    0, 0, 0.0694, 0.0694, 0, 0.2776, 0, 0.4164, 0.5552, 0.694, 0.8328
                    ], 
                   ['od 18 do 24 (110 z 2072)',
                    0, 0, 0, 0.1448, 0, 0.3861, 0, 1.1583, 1.2548, 1.8822, 0.4826
                    ], 
                   ['od 24 do 30 (84 z 1372)',
                    0, 0, 0, 0.1458, 0, 0.4373, 0, 1.0933, 0.8746, 1.2391, 2.3324
                    ], 
                   ['od 30 do 36 (87 z 1287)',
                    0, 0, 0, 0.4662, 0, 0.3108, 0, 1.7094, 0.9324, 1.554, 1.7871
                    ], 
                   ['od 36 do 42 (82 z 1148)',
                    0, 0, 0, 0.5226, 0, 1.0453, 0.0871, 1.3066, 1.8293, 1.3937, 0.9582
                    ], 
                   ['od 42 do 48 (117 z 1981)',
                    0, 0, 0.101, 0.3534, 0.101, 1.0601, 0, 1.2115, 1.4639, 1.3125, 0.3029
                    ], 
                   ['od 48 do 54 (84 z 992)',
                    0, 0, 0.2016, 0.2016, 0.1008, 0.2016, 0.1008, 1.7137, 2.0161, 1.9153, 2.0161
                    ], 
                   ['od 54 do 60 (76 z 1168)',
                    0, 0.1712, 0.3425, 0.8562, 0, 0.7705, 0, 1.0274, 1.0274, 1.7979, 0.5137
                    ], 
                   ['od 60 do 66 (67 z 910)',
                    0, 0.1099, 0.2198, 0.6593, 0.1099, 1.3187, 0, 0.8791, 0.7692, 1.2088, 2.0879
                    ], 
                   ['od 66 do 72 (70 z 1001)',
                    0, 0, 0.1998, 0.999, 0, 0.7992, 0, 1.7982, 1.4985, 0.5994, 1.0989
                    ], 
                   ['od 72 do 78 (67 z 756)',
                    0, 0, 0.1323, 0.1323, 0, 1.3228, 0, 1.1905, 3.0423, 1.5873, 1.455
                    ], 
                   ['od 78 (458 z 6056)',
                    0, 0.0826, 0.1982, 0.677, 0.033, 1.4531, 0, 1.8659, 1.4531, 1.2219, 0.5779
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle délky úvěru',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-4-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart4);
    function drawBAR3Chart5() {
        var data = google.visualization.arrayToDataTable([
                ['Má příběh?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (135 z 2869)',
                    0, 0, 0.1394, 0.2091, 0.1046, 0.5228, 0.0349, 1.0108, 1.0805, 0.732, 0.8714
                    ], 
                   ['Ano (1262 z 18940)',
                    0, 0.0422, 0.1162, 0.4699, 0.0158, 0.9029, 0.0053, 1.3569, 1.32, 1.3886, 1.0454
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle příběhu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-5-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart5);
    function drawBAR3Chart6() {
        var data = google.visualization.arrayToDataTable([
                ['Má pojištění?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (224 z 6980)',
                    0, 0, 0.1433, 0.2292, 0.043, 0.4155, 0, 0.6877, 0.5014, 0.5731, 0.616
                    ], 
                   ['Ano (184 z 3241)',
                    0, 0, 0.0309, 0.432, 0.0926, 0.432, 0.0617, 1.1725, 1.3576, 1.0799, 1.0182
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle pojištění, od jeho zavedení',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-6-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart6);
    function drawBAR3Chart7() {
        var data = google.visualization.arrayToDataTable([
                ['Byl při originaci investorem?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (1386 z 20746)',
                    0, 0.0386, 0.1253, 0.4579, 0.0289, 0.8917, 0.0096, 1.3497, 1.3497, 1.3593, 1.0701
                    ], 
                   ['Ano (11 z 1063)',
                    0, 0, 0, 0, 0, 0.0941, 0, 0.5644, 0.0941, 0.1881, 0.0941
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle statusu investora',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-7-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart7);
    function drawBAR3Chart8() {
        var data = google.visualization.arrayToDataTable([
                ['Počet předchozích půjček', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['0 (1257 z 17333)',
                    0, 0.0462, 0.1212, 0.4385, 0.0288, 0.9346, 0.0115, 1.4596, 1.4481, 1.5231, 1.2404
                    ], 
                   ['1 (124 z 3386)',
                    0, 0, 0.0886, 0.5021, 0.0295, 0.6793, 0, 0.7974, 0.7974, 0.5316, 0.2363
                    ], 
                   ['2 (16 z 778)',
                    0, 0, 0.2571, 0.2571, 0, 0.1285, 0, 0.7712, 0.3856, 0.2571, 0
                    ], 
                   ['3 (0 z 215)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['4 (0 z 62)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['5 (0 z 16)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['6 (0 z 10)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['7 (0 z 5)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['8 (0 z 2)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['9 (0 z 1)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['10 (0 z 1)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle počtu předchozích půjček',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-8-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart8);
    function drawLINE3Chart9() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 1.0417, 0, 1.5625, 0, 2.7027, 0, 7.5472, 0
                    ], 
                   ['2016-03',
                    0, 0, 0, 0, 0, 2.381, 0, 1.7241, 4.1667, 14.8148, 36.3636
                    ], 
                   ['2016-04',
                    0, 0, 0, 4.1667, 0, 0, 0, 4.5455, 11.1111, 33.3333, 36.3636
                    ], 
                   ['2016-05',
                    0, 0, 0, 3.0303, 0, 2.5641, 0, 9.6774, 2.8571, 7.4074, 16.6667
                    ], 
                   ['2016-06',
                    0, 0, 5.8824, 0, 0, 3.2258, 0, 11.1111, 4.3478, 7.1429, 13.3333
                    ], 
                   ['2016-07',
                    0, 0, 4, 0, 0, 8.3333, 0, 10.7143, 11.7647, 7.1429, 29.4118
                    ], 
                   ['2016-08',
                    0, 0, 0, 2.439, 0, 0, 0, 6.6667, 11.5385, 22.2222, 14.2857
                    ], 
                   ['2016-09',
                    0, 0, 0, 0, 0, 3.0303, 0, 12.5, 0, 9.0909, 30
                    ], 
                   ['2016-10',
                    0, 0, 0, 0, 0, 3.5714, 0, 7.6923, 7.4074, 15.7895, 10.5263
                    ], 
                   ['2016-11',
                    0, 0, 0, 1.4286, 0, 1.9231, 0, 12.1951, 5.4054, 21.6216, 24
                    ], 
                   ['2016-12',
                    0, 0, 0, 0, 0, 8.8889, 0, 17.5, 15.3846, 25.4902, 29.1667
                    ], 
                   ['2017-01',
                    0, 0, 0, 1.9608, 0, 2.2222, 0, 4, 10.3448, 18.9189, 13.6364
                    ], 
                   ['2017-02',
                    0, 0, 0, 0, 0, 0, 0, 5.4054, 8.6957, 15, 26.3158
                    ], 
                   ['2017-03',
                    0, 0, 0, 1.5873, 0, 6.6667, 0, 3.2258, 2.7778, 12.1212, 31.8182
                    ], 
                   ['2017-04',
                    0, 0, 0, 1.9608, 0, 2.2727, 0, 20.4545, 47.8261, 11.7647, 25
                    ], 
                   ['2017-05',
                    0, 0, 1.8868, 7.0796, 0, 10.2273, 0, 6.8966, 13.2075, 15.9091, 26.6667
                    ], 
                   ['2017-06',
                    0, 3.2258, 1.6129, 2.6316, 0, 5.8252, 0, 12.7451, 25.3731, 25.641, 29.6296
                    ], 
                   ['2017-07',
                    0, 3.2258, 0, 4.3478, 0, 11.7117, 0, 15.3846, 18.1818, 25, 12
                    ], 
                   ['2017-08',
                    0, 0, 2.7397, 4.0462, 0, 10.7143, 0, 11.5789, 14.6667, 37.2093, 20.8333
                    ], 
                   ['2017-09',
                    0, 3.2258, 1.3514, 2.7473, 0, 6.9565, 0, 12.7451, 13.6986, 20, 28.125
                    ], 
                   ['2017-10',
                    0, 0, 2.2727, 0.6098, 0, 7.4534, 0, 14.3885, 16.6667, 25, 28
                    ], 
                   ['2017-11',
                    0, 3.3898, 0, 1.4634, 0, 8.5526, 0, 7.0968, 12.6214, 20.5128, 25
                    ], 
                   ['2017-12',
                    0, 2.7027, 1.5873, 2.0134, 0, 8.8889, 0, 12.7273, 20, 21.6667, 18.1818
                    ], 
                   ['2018-01',
                    0, 4.1667, 1.3699, 2.5641, 0, 4.8387, 0, 10.7438, 16.0494, 18.6047, 22.5806
                    ], 
                   ['2018-02',
                    0, 0, 1.2987, 1.8987, 0, 8, 0, 9.6491, 15.8537, 13.7931, 25.8065
                    ], 
                   ['2018-03',
                    0, 2.7778, 2.5, 3.352, 0, 9.2486, 0, 11.194, 16.1017, 20.5128, 20.8333
                    ], 
                   ['2018-04',
                    0, 0, 1.4493, 3.4965, 0, 6.5217, 0, 11.7188, 18.75, 23.5294, 21.7391
                    ], 
                   ['2018-05',
                    0, 0, 2.2727, 2.381, 0, 7.4074, 0, 11.3821, 16, 20.3125, 23.5294
                    ], 
                   ['2018-06',
                    0, 0, 1.0417, 1.6854, 0, 5.6738, 0, 11.2782, 12.7907, 16.3934, 22.2222
                    ], 
                   ['2018-07',
                    0, 0, 0, 4.7619, 0, 4.2735, 0, 10.5769, 7.4627, 9.6154, 13.1579
                    ], 
                   ['2018-08',
                    0, 0, 1.2195, 1.9608, 0, 2.3622, 0, 3.8835, 9.4595, 11.1111, 7.2727
                    ], 
                   ['2018-09',
                    0, 0, 1.2821, 1.5267, 0, 1.0309, 0, 5, 7.0175, 15.9091, 29.2683
                    ], 
                   ['2018-10',
                    0, 0, 1.9417, 2.2346, 0, 2.1127, 0, 6.6667, 4.6154, 10.6061, 20
                    ], 
                   ['2018-11',
                    0, 0, 1.9417, 0.5747, 0, 0.4975, 0, 4.8485, 7.0707, 7.3529, 16.129
                    ], 
                   ['2018-12',
                    0, 0, 1.8519, 2.7027, 0, 0.7353, 0, 4.6512, 4.3478, 9.8039, 7.6923
                    ], 
                   ['2019-01',
                    0, 0, 0, 0, 0, 3.4722, 0, 3.125, 11.2676, 5.8824, 19.0476
                    ], 
                   ['2019-02',
                    0, 0, 0, 0, 0, 0, 0, 2.1898, 10.8434, 6.383, 15
                    ], 
                   ['2019-03',
                    0, 0, 0, 0, 0, 2.1429, 0, 1.7094, 4.6875, 9.434, 4.7619
                    ], 
                   ['2019-04',
                    0, 0, 0, 0, 3.75, 0, 2.7027, 2.6316, 2.381, 2.9412, 4
                    ], 
                   ['2019-05',
                    0, 0, 0, 0, 2.8169, 0, 0, 0, 2.5641, 9.375, 5.5556
                    ], 
                   ['2019-06',
                    0, 0, 0, 0, 0, 0, 0, 1.6667, 0, 0, 0
                    ], 
                   ['2019-07',
                    0, 0, 2.1739, 0, 0, 0, 0, 0, 3.7037, 0, 0
                    ], 
                   ['2019-08',
                    0, 0, 0, 1.9231, 0, 1.6667, 0, 7.6923, 0, 5.5556, 0
                    ], 
                   ['2019-09',
                    0, 0, 0, 5.2632, 3.8462, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2019-10',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2019-11',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2019-12',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění podle data originace a ratingu [%]',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-9-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart9);
    function drawLINE3Chart10() {
        var data = google.visualization.arrayToDataTable([
                ['Počet měsíců života půjčky', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['0',
                    0, 0.2, 0.25, 0.67, 0.17, 1.6, 0.07, 2.94, 4.81, 7.18, 9.34
                    ], 
                   ['1',
                    0, 0.2, 0.26, 0.68, 0.17, 1.62, 0.07, 2.97, 4.86, 7.26, 9.41
                    ], 
                   ['2',
                    0, 0.21, 0.27, 0.72, 0.19, 1.74, 0.08, 3.17, 5.16, 7.65, 9.99
                    ], 
                   ['3',
                    0, 0.21, 0.3, 0.76, 0.23, 1.87, 0.09, 3.43, 5.49, 8.12, 10.73
                    ], 
                   ['4',
                    0, 0.22, 0.32, 0.8, 0.24, 2.01, 0.11, 3.71, 5.91, 8.74, 11.54
                    ], 
                   ['5',
                    0, 0.23, 0.35, 0.84, 0.3, 2.16, 0.14, 4, 6.38, 9.37, 12.49
                    ], 
                   ['6',
                    0, 0.25, 0.36, 0.89, 0.4, 2.34, 0.2, 4.38, 6.87, 10.07, 13.53
                    ], 
                   ['7',
                    0, 0.27, 0.39, 0.96, 0.58, 2.57, 0.28, 4.77, 7.54, 10.87, 14.73
                    ], 
                   ['8',
                    0, 0.28, 0.42, 1.02, 0.53, 2.78, 0.44, 5.19, 8.13, 11.64, 15.55
                    ], 
                   ['9',
                    0, 0.31, 0.46, 1.09, 0, 2.99, 0, 5.65, 8.75, 12.52, 16.96
                    ], 
                   ['10',
                    0, 0.33, 0.5, 1.17, 0, 3.18, 0, 6.13, 9.41, 13.36, 18.11
                    ], 
                   ['11',
                    0, 0.31, 0.54, 1.26, 0, 3.49, 0, 6.72, 10.08, 14.55, 19.73
                    ], 
                   ['12',
                    0, 0.32, 0.58, 1.32, 0, 3.79, 0, 7.35, 10.78, 15.82, 21.65
                    ], 
                   ['13',
                    0, 0.34, 0.61, 1.38, 0, 4.13, 0, 7.95, 11.55, 17.13, 23.85
                    ], 
                   ['14',
                    0, 0.36, 0.59, 1.46, 0, 4.54, 0, 8.62, 12.35, 18, 24.38
                    ], 
                   ['15',
                    0, 0.39, 0.61, 1.56, 0, 5.01, 0, 9.39, 13.55, 19.01, 26.23
                    ], 
                   ['16',
                    0, 0.44, 0.65, 1.66, 0, 5.45, 0, 10.18, 14.53, 20.05, 27.32
                    ], 
                   ['17',
                    0, 0.49, 0.64, 1.74, 0, 5.83, 0, 10.88, 15.16, 21.4, 29.96
                    ], 
                   ['18',
                    0, 0.55, 0.73, 1.72, 0, 6.18, 0, 11.42, 16.27, 23.27, 32.14
                    ], 
                   ['19',
                    0, 0.67, 0.81, 1.81, 0, 6.55, 0, 11.79, 17.03, 24.32, 33.57
                    ], 
                   ['20',
                    0, 0.76, 0.82, 1.87, 0, 6.75, 0, 12.37, 18.04, 25.61, 35.13
                    ], 
                   ['21',
                    0, 0.73, 0.86, 1.95, 0, 7.02, 0, 12.76, 18.49, 26.13, 36.89
                    ], 
                   ['22',
                    0, 0.85, 0.83, 2, 0, 6.89, 0, 13.05, 19.21, 26.86, 38.64
                    ], 
                   ['23',
                    0, 1.03, 0.86, 2.16, 0, 7.41, 0, 13.72, 19.94, 28.45, 40.88
                    ], 
                   ['24',
                    0, 0.95, 0.88, 2.21, 0, 7.94, 0, 14.33, 21.26, 30.33, 42.06
                    ], 
                   ['25',
                    0, 0.89, 0.89, 2.35, 0, 8.1, 0, 15.2, 21.88, 30.84, 44.44
                    ], 
                   ['26',
                    0, 0.53, 1.02, 2.57, 0, 7.9, 0, 16.04, 22.72, 30.33, 45.69
                    ], 
                   ['27',
                    0, 0.67, 0.97, 3, 0, 8.13, 0, 15.4, 23.68, 29.91, 46.59
                    ], 
                   ['28',
                    0, 0.42, 1, 3.23, 0, 8.67, 0, 15.62, 24.53, 30.59, 46.3
                    ], 
                   ['29',
                    0, 0.5, 0.83, 3.1, 0, 8.17, 0, 15.76, 24.82, 31.01, 48.63
                    ], 
                   ['30',
                    0, 0, 0.75, 2.99, 0, 6.68, 0, 16.26, 25.85, 32.16, 49.28
                    ], 
                   ['31',
                    0, 0, 0.62, 2.99, 0, 6.23, 0, 15.69, 22.39, 31.28, 49.15
                    ], 
                   ['32',
                    0, 0, 0.38, 2.07, 0, 4.93, 0, 16.88, 22.73, 32.74, 51.4
                    ], 
                   ['33',
                    0, 0, 0.47, 2.05, 0, 5.31, 0, 17.3, 19.05, 35.29, 51
                    ], 
                   ['34',
                    0, 0, 0.54, 2.12, 0, 5.26, 0, 18.67, 21.77, 35.66, 52.27
                    ], 
                   ['35',
                    0, 0, 0.6, 2.49, 0, 5.95, 0, 19.44, 23.01, 37.5, 55.26
                    ], 
                   ['36',
                    0, 0, 0.69, 2.45, 0, 6, 0, 20.16, 22.77, 37.27, 57.14
                    ], 
                   ['37',
                    0, 0, 0.88, 2.84, 0, 6.35, 0, 18.63, 18.75, 34.09, 56.9
                    ], 
                   ['38',
                    0, 0, 1.04, 2.45, 0, 7.07, 0, 16.67, 20, 31.58, 52.94
                    ], 
                   ['39',
                    0, 0, 1.27, 3.03, 0, 8.11, 0, 16.44, 21.43, 33.87, 56.82
                    ], 
                   ['40',
                    0, 0, 1.69, 3.57, 0, 8.06, 0, 17.54, 26.09, 38.46, 57.89
                    ], 
                   ['41',
                    0, 0, 2, 3.45, 0, 5.88, 0, 19.05, 23.53, 37.21, 63.33
                    ], 
                   ['42',
                    0, 0, 0, 4.17, 0, 6.98, 0, 19.44, 21.43, 42.86, 66.67
                    ], 
                   ['43',
                    0, 0, 0, 3.45, 0, 5.56, 0, 17.24, 26.32, 42.42, 64.71
                    ], 
                   ['44',
                    0, 0, 0, 0, 0, 7.14, 0, 15.79, 38.46, 42.86, 66.67
                    ], 
                   ['45',
                    0, 0, 0, 0, 0, 15.38, 0, 16.67, 14.29, 38.89, 66.67
                    ], 
                   ['46',
                    0, 0, 0, 0, 0, 8.33, 0, 12.5, 0, 33.33, 0
                    ], 
                   ['47',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění v průběhu života půjčky, podle ratingu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z doživších se [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-10-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart10);
    function drawLINE3Chart11() {
        var data = google.visualization.arrayToDataTable([
                ['Počet měsíců života půjčky', '2016', '2017', '2018', '2019'],
                   ['0',
                    5.02, 4.95, 2.59, 0.29
                    ], 
                   ['1',
                    5.1, 4.97, 2.61, 0.29
                    ], 
                   ['2',
                    5.21, 5.13, 2.69, 0.33
                    ], 
                   ['3',
                    5.32, 5.25, 2.77, 0.38
                    ], 
                   ['4',
                    5.46, 5.4, 2.86, 0.43
                    ], 
                   ['5',
                    5.58, 5.55, 2.96, 0.47
                    ], 
                   ['6',
                    5.76, 5.69, 3.07, 0.57
                    ], 
                   ['7',
                    5.95, 5.85, 3.19, 0.7
                    ], 
                   ['8',
                    6.1, 6, 3.31, 0.81
                    ], 
                   ['9',
                    6.3, 6.18, 3.44, 0.95
                    ], 
                   ['10',
                    6.49, 6.34, 3.56, 1.1
                    ], 
                   ['11',
                    6.73, 6.49, 3.69, 1.05
                    ], 
                   ['12',
                    6.98, 6.67, 3.85, 0
                    ], 
                   ['13',
                    7.23, 6.9, 3.91, 0
                    ], 
                   ['14',
                    7.55, 7.09, 4.12, 0
                    ], 
                   ['15',
                    7.86, 7.26, 4.55, 0
                    ], 
                   ['16',
                    8.05, 7.45, 5.03, 0
                    ], 
                   ['17',
                    8.36, 7.68, 5.45, 0
                    ], 
                   ['18',
                    8.67, 7.98, 5.9, 0
                    ], 
                   ['19',
                    8.93, 8.19, 6.34, 0
                    ], 
                   ['20',
                    9.22, 8.47, 6.52, 0
                    ], 
                   ['21',
                    9.42, 8.75, 6.33, 0
                    ], 
                   ['22',
                    9.85, 9.04, 5.26, 0
                    ], 
                   ['23',
                    10.23, 9.43, 4.56, 0
                    ], 
                   ['24',
                    10.6, 9.89, 0, 0
                    ], 
                   ['25',
                    10.99, 9.38, 0, 0
                    ], 
                   ['26',
                    11.25, 9.53, 0, 0
                    ], 
                   ['27',
                    11.42, 10, 0, 0
                    ], 
                   ['28',
                    11.72, 10.58, 0, 0
                    ], 
                   ['29',
                    12.42, 10.55, 0, 0
                    ], 
                   ['30',
                    12.86, 10.69, 0, 0
                    ], 
                   ['31',
                    13.33, 9.27, 0, 0
                    ], 
                   ['32',
                    13.75, 9.04, 0, 0
                    ], 
                   ['33',
                    14.27, 8.46, 0, 0
                    ], 
                   ['34',
                    15.02, 8.28, 0, 0
                    ], 
                   ['35',
                    15.59, 8.77, 0, 0
                    ], 
                   ['36',
                    16.17, 0, 0, 0
                    ], 
                   ['37',
                    13.98, 0, 0, 0
                    ], 
                   ['38',
                    13.81, 0, 0, 0
                    ], 
                   ['39',
                    15.08, 0, 0, 0
                    ], 
                   ['40',
                    16.74, 0, 0, 0
                    ], 
                   ['41',
                    16.57, 0, 0, 0
                    ], 
                   ['42',
                    17.14, 0, 0, 0
                    ], 
                   ['43',
                    17.33, 0, 0, 0
                    ], 
                   ['44',
                    18.29, 0, 0, 0
                    ], 
                   ['45',
                    17.02, 0, 0, 0
                    ], 
                   ['46',
                    8.51, 0, 0, 0
                    ], 
                   ['47',
                    0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění v průběhu života půjčky, podle roku originace',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z doživších se [%]'}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-11-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart11);
    function drawLINE3Chart12() {
        var data = google.visualization.arrayToDataTable([
                ['Měsíc', 'Objemem vážený průměrný úrok [% p.a.]', 'Počtem vážený průměrný úrok [% p.a.]', 'Ztraceno [% objemu]', 'S pojištěním [% všech půjček]', 'Bez příběhu [% všech půjček]'],
                   ['2016-02',
                    9.48158258028822, 9.915233644859812, 0, 0, 0.9299999999999999
                    ], 
                   ['2016-03',
                    9.507338250083809, 10.034270833333334, 0.13, 0, 0.52
                    ], 
                   ['2016-04',
                    9.397446355112478, 9.949309494451295, 0.23, 0, 0.49
                    ], 
                   ['2016-05',
                    9.31118460232555, 9.977387387387388, 0.17, 0, 0.63
                    ], 
                   ['2016-06',
                    9.207182025562384, 9.972300884955752, 0.14, 0, 0.66
                    ], 
                   ['2016-07',
                    9.127489940673367, 9.910331421287443, 0.12, 0, 0.7000000000000001
                    ], 
                   ['2016-08',
                    9.110183915529062, 9.954835164835165, 0.1, 0, 1.04
                    ], 
                   ['2016-09',
                    9.032353283960816, 9.866494023904382, 0.09, 0, 1.0999999999999999
                    ], 
                   ['2016-10',
                    9.019944356462485, 9.880848214285713, 0.08, 0, 1.16
                    ], 
                   ['2016-11',
                    9.011734147670893, 9.925717002662608, 0.07, 0, 1.1400000000000001
                    ], 
                   ['2016-12',
                    9.009857794498451, 9.986398166339228, 0.06, 0, 1.08
                    ], 
                   ['2017-01',
                    8.927109445982492, 9.953991769547324, 0.05, 0, 1
                    ], 
                   ['2017-02',
                    8.807850683572859, 9.8537339055794, 0.06, 0, 0.97
                    ], 
                   ['2017-03',
                    8.772715891923353, 9.841824457593688, 0.06, 0, 1.01
                    ], 
                   ['2017-04',
                    8.659677213284112, 9.738507119889757, 0.06, 0, 1.01
                    ], 
                   ['2017-05',
                    8.433559196771801, 9.553833992094862, 0.05, 0, 1.05
                    ], 
                   ['2017-06',
                    8.266391498913281, 9.391465386558869, 0.07, 0, 1.04
                    ], 
                   ['2017-07',
                    8.129859930687351, 9.247765346680406, 0.08, 0, 1.1199999999999999
                    ], 
                   ['2017-08',
                    8.031712420530425, 9.125138587303615, 0.09, 0, 1.34
                    ], 
                   ['2017-09',
                    7.927677087770594, 9.045549314760729, 0.09, 0, 1.46
                    ], 
                   ['2017-10',
                    7.865682451548923, 8.982567964013299, 0.08, 0, 1.6
                    ], 
                   ['2017-11',
                    7.766697189031557, 8.89723444001019, 0.1, 0, 1.73
                    ], 
                   ['2017-12',
                    7.730692240551537, 8.871466521671586, 0.1, 0, 1.83
                    ], 
                   ['2018-01',
                    7.7297335420218465, 8.850983981693364, 0.09, 0, 1.96
                    ], 
                   ['2018-02',
                    7.727861656676985, 8.835431706994578, 0.08, 0, 2.03
                    ], 
                   ['2018-03',
                    7.74065798435242, 8.846852062503741, 0.07, 0, 2.1399999999999997
                    ], 
                   ['2018-04',
                    7.7260361404793745, 8.8419092418373, 0.08, 1.6400000000000001, 2.2399999999999998
                    ], 
                   ['2018-05',
                    7.722359235000748, 8.831647034722934, 0.07, 4.24, 2.45
                    ], 
                   ['2018-06',
                    7.692501598828086, 8.802888382904037, 0.07, 6.29, 2.73
                    ], 
                   ['2018-07',
                    7.6056631510720125, 8.71870781527531, 0.06, 8.25, 2.94
                    ], 
                   ['2018-08',
                    7.57225061664269, 8.708000583892897, 0.06, 9.77, 3.19
                    ], 
                   ['2018-09',
                    7.532511387533076, 8.687392032539778, 0.06, 10.92, 3.5999999999999996
                    ], 
                   ['2018-10',
                    7.480300610473837, 8.65316829468347, 0.05, 12.25, 5.16
                    ], 
                   ['2018-11',
                    7.469617036269997, 8.662756842797329, 0.05, 13.919999999999998, 7.88
                    ], 
                   ['2018-12',
                    7.4725531788960415, 8.678989689341188, 0.05, 14.92, 9.55
                    ], 
                   ['2019-01',
                    7.483066654953751, 8.704221910291585, 0.05, 16.07, 11.32
                    ], 
                   ['2019-02',
                    7.508923692985673, 8.740593824228029, 0.04, 17.34, 12.93
                    ], 
                   ['2019-03',
                    7.527800831451616, 8.774402340807695, 0.04, 18.77, 14.649999999999999
                    ], 
                   ['2019-04',
                    7.488827475399956, 8.72187510298237, 0.04, 20.02, 16.38
                    ], 
                   ['2019-05',
                    7.456122043199563, 8.680631921824103, 0.04, 21.62, 18.04
                    ], 
                   ['2019-06',
                    7.429856604678536, 8.64104872296653, 0.04, 22.61, 19.259999999999998
                    ], 
                   ['2019-07',
                    7.403376785244365, 8.598541264507519, 0.03, 23.580000000000002, 20.51
                    ], 
                   ['2019-08',
                    7.3786178460965886, 8.56654559945349, 0.03, 24.51, 21.57
                    ], 
                   ['2019-09',
                    7.368042483669791, 8.551435616438356, 0.03, 25.05, 22.439999999999998
                    ], 
                   ['2019-10',
                    7.353831857249642, 8.524780307040762, 0.03, 25.53, 23.22
                    ], 
                   ['2019-11',
                    7.296185808881532, 8.467691333823408, 0.03, 26.090000000000003, 24.09
                    ], 
                   ['2019-12',
                    7.2659457866732895, 8.439602710442463, 0.03, 26.39, 24.81
                    ]
        ]);
        var options = {
            chart: {
                title: 'Souhrnné statistiky platformy',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            axes: {
                y: {
                  0: {label: ''}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-12-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart12);
    function drawLINE3Chart13() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Objemem vážený průměrný úrok [% p.a.]', 'Počtem vážený průměrný úrok [% p.a.]', 'Ztraceno [% objemu]', 'Zesplatněno [% ukončených půjček]', 'S pojištěním [% všech půjček]', 'Bez příběhu [% všech půjček]'],
                   ['2016-02',
                    9.48158258028822, 9.915233644859812, 0, 2.41, 0, 0.9299999999999999
                    ], 
                   ['2016-03',
                    9.585444120100084, 10.137368421052631, 0.26, 4.7, 0, 0
                    ], 
                   ['2016-04',
                    9.163282829789138, 9.780794979079499, 0.45, 8.290000000000001, 0, 0.42
                    ], 
                   ['2016-05',
                    9.082614146116729, 10.0662987012987, 0, 5.2, 0, 0.97
                    ], 
                   ['2016-06',
                    8.966992604765817, 10.079694656488549, 0, 5.1499999999999995, 0, 0.76
                    ], 
                   ['2016-07',
                    8.71180547954026, 9.599865470852018, 0, 8.38, 0, 0.8999999999999999
                    ], 
                   ['2016-08',
                    8.984324748836796, 10.136067415730336, 0, 6.950000000000001, 0, 3
                    ], 
                   ['2016-09',
                    8.465082508250827, 9.323333333333332, 0, 5.42, 0, 1.28
                    ], 
                   ['2016-10',
                    8.949773202873141, 10.004760147601477, 0, 5.26, 0, 1.8499999999999999
                    ], 
                   ['2016-11',
                    8.955806209612794, 10.109385342789597, 0, 7.9, 0, 0.95
                    ], 
                   ['2016-12',
                    9.057868008424995, 10.376813186813187, 0, 12.959999999999999, 0, 0.66
                    ], 
                   ['2017-01',
                    8.495928138293058, 9.881414141414142, 0, 6.3, 0, 0.51
                    ], 
                   ['2017-02',
                    7.8471228266965785, 9.053157894736842, 0.14, 4.88, 0, 0.79
                    ], 
                   ['2017-03',
                    8.433172810146651, 9.7639898989899, 0.04, 6.2, 0, 1.52
                    ], 
                   ['2017-04',
                    7.745830772012294, 8.914744897959183, 0, 11.379999999999999, 0, 1.02
                    ], 
                   ['2017-05',
                    7.417096114519428, 8.667722152690864, 0, 8.870000000000001, 0, 1.25
                    ], 
                   ['2017-06',
                    7.545334066538356, 8.64524193548387, 0.15, 10.290000000000001, 0, 1.11
                    ], 
                   ['2017-07',
                    7.359513154132113, 8.423678756476683, 0.17, 10.09, 0, 1.4500000000000002
                    ], 
                   ['2017-08',
                    7.555856039762137, 8.548210251954822, 0.12, 10.209999999999999, 0, 2.69
                    ], 
                   ['2017-09',
                    7.41962586580376, 8.682682926829267, 0.06, 8.73, 0, 2.1999999999999997
                    ], 
                   ['2017-10',
                    7.5813903381431595, 8.70256868131868, 0.06, 9.54, 0, 2.6100000000000003
                    ], 
                   ['2017-11',
                    7.358334806304316, 8.565084364454442, 0.15, 7.6499999999999995, 0, 2.42
                    ], 
                   ['2017-12',
                    7.549312861817267, 8.765260029717682, 0.09, 9.969999999999999, 0, 2.6
                    ], 
                   ['2018-01',
                    7.827964382592286, 8.753197026022304, 0, 8.12, 0, 3.2
                    ], 
                   ['2018-02',
                    7.804064544265155, 8.804121037463977, 0, 7.920000000000001, 0, 2.74
                    ], 
                   ['2018-03',
                    7.946755418832431, 9.061930773391023, 0.02, 10.05, 0, 3.19
                    ], 
                   ['2018-04',
                    7.750774111184185, 8.91350203606748, 0.08, 10.209999999999999, 17.22, 3.32
                    ], 
                   ['2018-05',
                    7.7679907826962555, 8.875035499726925, 0, 8.780000000000001, 29.160000000000004, 4.53
                    ], 
                   ['2018-06',
                    7.556124475794424, 8.690652938221998, 0, 7.24, 25.259999999999998, 5.42
                    ], 
                   ['2018-07',
                    6.855983288827634, 8.022366649404454, 0.01, 5.66, 28.07, 5.33
                    ], 
                   ['2018-08',
                    7.263500630472232, 8.683336831059812, 0, 4.18, 26.229999999999997, 6.09
                    ], 
                   ['2018-09',
                    7.109913487698421, 8.50935874168179, 0, 5.52, 26.19, 9.01
                    ], 
                   ['2018-10',
                    7.05173854601613, 8.41142230026339, 0.01, 4.81, 25.990000000000002, 22.21
                    ], 
                   ['2018-11',
                    7.523809724320709, 8.942129531854981, 0, 3.7699999999999996, 28.58, 32.73
                    ], 
                   ['2018-12',
                    7.860266636791396, 9.22445671121441, 0, 3.56, 31.14, 37.01
                    ], 
                   ['2019-01',
                    7.842695897037852, 9.272981853849926, 0, 4.65, 32.37, 36
                    ], 
                   ['2019-02',
                    8.071726483309671, 9.411714818266542, 0, 3.64, 35.410000000000004, 35.410000000000004
                    ], 
                   ['2019-03',
                    7.990097559615894, 9.383808777429467, 0, 2.45, 36.13, 35.97
                    ], 
                   ['2019-04',
                    7.1895177961853385, 8.315542878174456, 0, 1.76, 35.22, 37.14
                    ], 
                   ['2019-05',
                    7.157471910748028, 8.287827610371409, 0, 1.32, 40.71, 38.26
                    ], 
                   ['2019-06',
                    7.247352543290043, 8.320078125, 0, 0.25, 36.76, 36.17
                    ], 
                   ['2019-07',
                    7.345318743626808, 8.389325626204238, 0, 0.52, 35.160000000000004, 35.839999999999996
                    ], 
                   ['2019-08',
                    7.245446437408584, 8.395562742561449, 0, 1.83, 35.61, 35.410000000000004
                    ], 
                   ['2019-09',
                    7.445739826069648, 8.61291888062345, 0, 0.9299999999999999, 33.050000000000004, 35.67
                    ], 
                   ['2019-10',
                    7.3117831160957865, 8.416928520877565, 0, 0, 33.26, 36.02
                    ], 
                   ['2019-11',
                    6.610016995870875, 7.891058901389808, 0, 0, 34.02, 37.29
                    ], 
                   ['2019-12',
                    6.9217811761701045, 8.176187587494168, 0, 0, 33.64, 41.06
                    ]
        ]);
        var options = {
            chart: {
                title: 'Souhrnné statistiky podle data originace',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            axes: {
                y: {
                  0: {label: ''}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-13-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart13);
    function drawCOLUMN3Chart14() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 33.96, 0, 21.18, 0, 13.71, 12.46, 18.69, 0
                    ], 
                   ['2016-03',
                    0, 1.05, 6.32, 23.86, 0, 18.6, 0, 22.46, 10.53, 12.28, 4.91
                    ], 
                   ['2016-04',
                    0, 0.42, 13.81, 25.94, 0, 15.9, 0, 12.13, 17.57, 8.37, 5.86
                    ], 
                   ['2016-05',
                    0, 0.97, 11.36, 26.62, 0, 16.88, 0, 12.66, 12.34, 10.06, 9.09
                    ], 
                   ['2016-06',
                    0, 4.58, 9.92, 21.37, 0, 16.41, 0, 14.89, 13.36, 13.36, 6.11
                    ], 
                   ['2016-07',
                    0, 3.14, 15.7, 25.11, 0, 14.8, 0, 14.8, 9.87, 7.62, 8.97
                    ], 
                   ['2016-08',
                    0, 4.12, 12.36, 21.35, 0, 15.36, 0, 14.61, 13.86, 8.24, 10.11
                    ], 
                   ['2016-09',
                    0, 3.85, 12.82, 24.36, 0, 17.52, 0, 18.8, 11.11, 6.41, 5.13
                    ], 
                   ['2016-10',
                    0, 2.21, 15.5, 22.88, 0, 14.76, 0, 11.81, 14.02, 9.59, 9.23
                    ], 
                   ['2016-11',
                    0, 1.89, 9.69, 24.11, 0, 18.68, 0, 13.48, 13, 12.06, 7.09
                    ], 
                   ['2016-12',
                    0, 1.54, 9.45, 21.54, 0, 18.68, 0, 13.41, 15.16, 13.19, 7.03
                    ], 
                   ['2017-01',
                    0, 2.02, 14.65, 21.46, 0, 16.67, 0, 16.16, 10.61, 11.62, 6.82
                    ], 
                   ['2017-02',
                    0, 3.42, 13.95, 29.21, 0, 17.89, 0, 13.68, 9.21, 7.11, 5.53
                    ], 
                   ['2017-03',
                    0, 3.54, 14.39, 25.76, 0, 13.38, 0, 11.62, 12.12, 11.62, 7.58
                    ], 
                   ['2017-04',
                    0, 5.87, 15.82, 21.94, 0, 21.68, 0, 15.05, 8.93, 5.87, 4.85
                    ], 
                   ['2017-05',
                    0, 7.26, 14.02, 28.16, 0, 17.02, 0, 13.02, 9.64, 8.01, 2.88
                    ], 
                   ['2017-06',
                    0, 7.76, 12.8, 28.12, 0, 17.54, 0, 15.22, 8.87, 6.25, 3.43
                    ], 
                   ['2017-07',
                    0, 6.74, 15.44, 28.91, 0, 18.03, 0, 14.51, 7.67, 5.49, 3.21
                    ], 
                   ['2017-08',
                    0, 6.34, 13.99, 29.28, 0, 17.2, 0, 15.2, 9.56, 5.82, 2.61
                    ], 
                   ['2017-09',
                    0, 5.53, 14.15, 28.86, 0, 18.29, 0, 13.5, 9.59, 7.07, 3.01
                    ], 
                   ['2017-10',
                    0, 6.66, 12.98, 26.03, 0, 20.26, 0, 14.84, 9.62, 7.55, 2.06
                    ], 
                   ['2017-11',
                    0, 7.99, 14.9, 26.66, 0, 17.72, 0, 14.06, 9.39, 5.91, 3.37
                    ], 
                   ['2017-12',
                    0, 7.58, 13.3, 25.33, 0, 17.76, 0, 15.97, 10.77, 6.46, 2.82
                    ], 
                   ['2018-01',
                    0, 6.91, 13.23, 26.47, 0, 18.14, 0, 16.06, 10.11, 5.58, 3.49
                    ], 
                   ['2018-02',
                    0, 6.34, 13.83, 25.43, 0, 18.95, 0, 15.63, 10.37, 6.12, 3.31
                    ], 
                   ['2018-03',
                    0, 7.84, 12.11, 23.8, 0, 18.33, 0, 14.49, 11.9, 7.52, 4
                    ], 
                   ['2018-04',
                    0, 7.68, 13.32, 24.32, 0, 17.98, 0, 15.13, 11.58, 5.88, 4.13
                    ], 
                   ['2018-05',
                    0, 7.37, 13.44, 25.34, 0, 16.93, 0, 15.35, 11.03, 7.26, 3.28
                    ], 
                   ['2018-06',
                    0, 7.48, 15.72, 24.01, 0, 17.58, 0, 15.77, 10.25, 6.13, 3.06
                    ], 
                   ['2018-07',
                    0, 13.62, 18.49, 24.6, 0, 15.64, 0, 12.01, 6.73, 5.64, 3.26
                    ], 
                   ['2018-08',
                    0, 9.6, 18.1, 23.08, 0, 15.95, 0, 12.17, 8.92, 6.98, 5.19
                    ], 
                   ['2018-09',
                    0, 10.47, 17.91, 24.62, 0, 16.03, 0, 11.13, 8.71, 5.81, 5.32
                    ], 
                   ['2018-10',
                    0, 8.3, 18.61, 25.15, 0, 17.03, 0, 13.48, 7.68, 5.93, 3.82
                    ], 
                   ['2018-11',
                    0, 5.39, 16.26, 21.75, 0, 19.57, 0, 17.95, 8.98, 5.6, 4.51
                    ], 
                   ['2018-12',
                    0, 4.76, 12.49, 20.05, 0, 22.49, 0, 19.58, 10.28, 6.8, 3.54
                    ], 
                   ['2019-01',
                    0, 4.51, 14.42, 19.52, 0, 21.58, 0, 19.08, 9.51, 6.28, 5.1
                    ], 
                   ['2019-02',
                    0, 4.15, 13.42, 20.88, 0, 19.99, 0, 19.15, 9.97, 6.85, 5.59
                    ], 
                   ['2019-03',
                    0, 4.47, 13.36, 19.63, 1.18, 19.87, 1.72, 17.16, 10.07, 7.13, 5.41
                    ], 
                   ['2019-04',
                    1.66, 5.52, 15.09, 16.16, 12.73, 13.62, 11.23, 10.97, 6.48, 3.9, 2.65
                    ], 
                   ['2019-05',
                    1.86, 6.06, 14.4, 13.63, 14.19, 14.12, 12.09, 12.09, 5.47, 3.71, 2.38
                    ], 
                   ['2019-06',
                    1.09, 6.17, 12.97, 14.73, 14.49, 14.22, 12.3, 12.62, 5.78, 3.71, 1.91
                    ], 
                   ['2019-07',
                    1.22, 3.92, 13.46, 15.29, 14.48, 15.41, 12.36, 12.2, 6.13, 3.5, 2.02
                    ], 
                   ['2019-08',
                    1.55, 6.44, 13.1, 14.52, 13.42, 13.97, 11.45, 12.84, 6.11, 4.37, 2.23
                    ], 
                   ['2019-09',
                    1.17, 4.43, 13.43, 13.32, 13.74, 14.03, 12.79, 13.28, 7.16, 4.18, 2.48
                    ], 
                   ['2019-10',
                    1.63, 3.29, 15.85, 13.52, 15.5, 14.51, 10.93, 11.39, 6.65, 4.67, 2.05
                    ], 
                   ['2019-11',
                    2.08, 3.04, 23.23, 12.87, 14.16, 13.63, 10.85, 11.05, 4.7, 2.71, 1.65
                    ], 
                   ['2019-12',
                    1.49, 3.73, 19.18, 12.23, 13.39, 15.54, 12.83, 11.43, 5.23, 2.89, 2.05
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba úrokových měr v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-14-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart14);
    function drawCOLUMN3Chart15() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Auto-moto', 'Cestování', 'Domácnost', 'Elektronika', 'Jiné', 'Refinancování půjček', 'Vlastní projekt', 'Vzdělání', 'Zdraví'],
                   ['2016-02',
                    13.08, 0.93, 7.48, 4.67, 9.03, 46.42, 13.08, 2.18, 3.12
                    ], 
                   ['2016-03',
                    18.6, 0.35, 14.39, 2.11, 14.39, 38.6, 10.18, 0.7, 0.7
                    ], 
                   ['2016-04',
                    22.59, 0.42, 10.04, 2.51, 9.21, 46.44, 5.86, 1.67, 1.26
                    ], 
                   ['2016-05',
                    21.43, 0.97, 12.66, 1.62, 11.69, 41.56, 7.79, 0.97, 1.3
                    ], 
                   ['2016-06',
                    22.14, 1.53, 17.18, 0.76, 11.83, 35.5, 8.78, 1.15, 1.15
                    ], 
                   ['2016-07',
                    24.66, 0, 16.59, 2.24, 8.07, 37.67, 8.52, 0.9, 1.35
                    ], 
                   ['2016-08',
                    18.35, 0.37, 16.1, 1.5, 11.61, 44.19, 7.12, 0.37, 0.37
                    ], 
                   ['2016-09',
                    23.08, 0.85, 13.68, 1.71, 11.54, 36.32, 8.55, 1.28, 2.99
                    ], 
                   ['2016-10',
                    23.25, 1.11, 17.71, 4.06, 8.49, 37.64, 4.8, 1.48, 1.48
                    ], 
                   ['2016-11',
                    17.26, 0.24, 14.42, 3.31, 9.46, 46.1, 8.04, 0.47, 0.71
                    ], 
                   ['2016-12',
                    15.6, 0.44, 16.04, 1.1, 12.09, 46.15, 6.59, 1.1, 0.88
                    ], 
                   ['2017-01',
                    19.95, 0.51, 19.7, 2.02, 14.39, 34.85, 6.57, 0.76, 1.26
                    ], 
                   ['2017-02',
                    20.26, 1.05, 17.37, 1.84, 8.16, 41.32, 7.37, 1.58, 1.05
                    ], 
                   ['2017-03',
                    24.24, 0.76, 21.72, 2.02, 11.11, 35.1, 3.54, 0.51, 1.01
                    ], 
                   ['2017-04',
                    21.17, 1.02, 19.13, 3.32, 10.46, 40.05, 3.32, 0.77, 0.77
                    ], 
                   ['2017-05',
                    24.66, 1, 17.4, 1.5, 10.39, 38.05, 5.13, 0.38, 1.5
                    ], 
                   ['2017-06',
                    22.38, 1.71, 20.16, 1.92, 10.38, 34.98, 4.94, 2.12, 1.41
                    ], 
                   ['2017-07',
                    21.87, 2.59, 24.66, 1.14, 13.99, 26.01, 6.63, 1.35, 1.76
                    ], 
                   ['2017-08',
                    22.76, 1.48, 21.55, 2.17, 14.25, 27.63, 7.21, 1.39, 1.56
                    ], 
                   ['2017-09',
                    22.76, 1.06, 26.02, 0.73, 14.39, 25.61, 7.15, 1.38, 0.89
                    ], 
                   ['2017-10',
                    21.98, 0.62, 25.69, 1.72, 13.39, 28.43, 5.98, 0.69, 1.51
                    ], 
                   ['2017-11',
                    20.87, 0.51, 22.38, 1.63, 19.52, 27.62, 5.01, 1.12, 1.35
                    ], 
                   ['2017-12',
                    4.09, 0.15, 4.83, 0.22, 63.67, 25.19, 1.26, 0.07, 0.52
                    ], 
                   ['2018-01',
                    14.42, 0.59, 15.09, 0.89, 38.07, 24.91, 3.94, 1.04, 1.04
                    ], 
                   ['2018-02',
                    24.35, 0.94, 24.78, 1.44, 13.4, 26.95, 6.41, 0.72, 1.01
                    ], 
                   ['2018-03',
                    25.47, 0.81, 26.07, 1.41, 13.52, 24.55, 5.52, 1.14, 1.51
                    ], 
                   ['2018-04',
                    26.35, 1.45, 25.19, 1.63, 13.21, 21.99, 7.68, 0.99, 1.51
                    ], 
                   ['2018-05',
                    25.56, 2.24, 26.6, 1.37, 13.44, 21.85, 6.83, 0.82, 1.31
                    ], 
                   ['2018-06',
                    24.06, 2.06, 26.07, 1.05, 16.17, 21.45, 5.88, 1.31, 1.96
                    ], 
                   ['2018-07',
                    25.95, 2.59, 26.83, 0.88, 14.45, 20.97, 5.49, 1.14, 1.71
                    ], 
                   ['2018-08',
                    23.71, 2.31, 25.76, 1.26, 14.85, 23.61, 5.4, 1.52, 1.57
                    ], 
                   ['2018-09',
                    21.66, 1.09, 26.56, 1.57, 16.27, 25.35, 4.48, 1.51, 1.51
                    ], 
                   ['2018-10',
                    21.73, 1.27, 24.76, 2.15, 17.43, 24.32, 5.4, 1.4, 1.54
                    ], 
                   ['2018-11',
                    20.94, 0.53, 27.63, 1.58, 19.08, 22.63, 5.28, 1.02, 1.3
                    ], 
                   ['2018-12',
                    20.16, 1.1, 27.54, 2.44, 21.73, 18.54, 6.1, 1.1, 1.28
                    ], 
                   ['2019-01',
                    22.41, 2.26, 26.48, 1.62, 18.24, 20.11, 6.03, 1.47, 1.37
                    ], 
                   ['2019-02',
                    23.67, 1.58, 26.05, 1.3, 19.06, 19.66, 5.87, 1.4, 1.4
                    ], 
                   ['2019-03',
                    25.86, 0.71, 26.1, 1.53, 19.24, 18.5, 5.8, 1.02, 1.25
                    ], 
                   ['2019-04',
                    24.29, 1.66, 24.11, 1.18, 20.65, 18.84, 6.29, 1.21, 1.77
                    ], 
                   ['2019-05',
                    22.46, 1.79, 25.79, 1.82, 19.59, 19.13, 6.34, 1.19, 1.89
                    ], 
                   ['2019-06',
                    22.66, 3.55, 27.34, 1.25, 19.88, 16.41, 5.7, 1.48, 1.72
                    ], 
                   ['2019-07',
                    24.05, 3.85, 28.07, 1.48, 15.64, 18.3, 5.36, 1.32, 1.93
                    ], 
                   ['2019-08',
                    23.97, 2.52, 28.14, 1.36, 17.04, 18.89, 4.98, 1.52, 1.58
                    ], 
                   ['2019-09',
                    24.8, 1.38, 28.69, 2.16, 15.23, 18.63, 5.6, 1.74, 1.77
                    ], 
                   ['2019-10',
                    22.26, 1.34, 30.96, 1.98, 14.83, 21.13, 4.6, 1.34, 1.56
                    ], 
                   ['2019-11',
                    20.58, 0.89, 29.12, 2.55, 16.15, 22.67, 4.5, 1.72, 1.82
                    ], 
                   ['2019-12',
                    21.37, 1.07, 28.04, 2.61, 16.94, 21.75, 4.76, 1.4, 2.05
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba účelu ǘvěrů v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-15-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart15);
    function drawCOLUMN3Chart16() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Hlavní město Praha', 'Jihomoravský kraj', 'Jihočeský kraj', 'Karlovarský kraj', 'Kraj Vysočina', 'Královéhradecký kraj', 'Liberecký kraj', 'Moravskoslezský kraj', 'Olomoucký kraj', 'Pardubický kraj', 'Plzeňský kraj', 'Středočeský kraj', 'Zlínský kraj', 'Ústecký kraj'],
                   ['2016-02',
                    29.28, 9.66, 5.3, 2.18, 2.8, 2.18, 4.36, 10.9, 3.74, 2.8, 3.12, 12.46, 4.67, 6.54
                    ], 
                   ['2016-03',
                    21.05, 10.18, 5.96, 2.46, 3.16, 5.61, 4.91, 7.37, 4.21, 4.21, 4.21, 17.54, 3.86, 5.26
                    ], 
                   ['2016-04',
                    21.34, 8.79, 5.44, 1.26, 3.35, 4.6, 6.69, 11.3, 4.18, 4.18, 7.95, 11.72, 4.18, 5.02
                    ], 
                   ['2016-05',
                    18.18, 13.31, 4.87, 0.97, 1.3, 5.52, 3.9, 13.31, 6.17, 4.55, 5.52, 11.04, 6.49, 4.87
                    ], 
                   ['2016-06',
                    15.65, 13.74, 4.58, 1.91, 2.67, 1.91, 4.96, 12.98, 4.2, 5.73, 4.96, 14.12, 4.2, 8.4
                    ], 
                   ['2016-07',
                    18.39, 5.38, 4.04, 2.69, 2.24, 4.04, 3.59, 13.9, 6.73, 2.69, 4.04, 13.9, 5.38, 13
                    ], 
                   ['2016-08',
                    16.85, 8.61, 5.62, 2.62, 4.49, 6.37, 5.99, 6.74, 6.37, 4.12, 3.37, 16.48, 3, 9.36
                    ], 
                   ['2016-09',
                    15.38, 11.11, 8.12, 1.71, 2.99, 3.85, 5.13, 9.83, 5.98, 5.13, 2.99, 17.09, 5.13, 5.56
                    ], 
                   ['2016-10',
                    15.13, 11.81, 3.69, 2.58, 2.95, 2.58, 6.64, 12.92, 6.64, 7.01, 4.06, 14.39, 4.06, 5.54
                    ], 
                   ['2016-11',
                    14.89, 8.75, 4.73, 2.84, 3.31, 4.02, 4.73, 16.08, 4.49, 6.15, 4.96, 11.58, 4.73, 8.75
                    ], 
                   ['2016-12',
                    13.85, 12.09, 4.4, 3.08, 2.64, 4.4, 4.62, 12.53, 5.93, 4.18, 4.62, 13.19, 4.18, 10.33
                    ], 
                   ['2017-01',
                    15.91, 12.63, 3.03, 2.78, 2.78, 5.81, 4.55, 12.12, 5.3, 3.79, 4.8, 13.64, 3.79, 9.09
                    ], 
                   ['2017-02',
                    13.16, 11.84, 3.95, 3.16, 4.21, 3.16, 6.32, 11.84, 3.42, 4.47, 5, 14.47, 5, 10
                    ], 
                   ['2017-03',
                    12.63, 12.63, 5.05, 2.02, 5.81, 4.55, 4.8, 11.87, 4.8, 4.8, 4.29, 13.89, 4.29, 8.59
                    ], 
                   ['2017-04',
                    19.13, 7.91, 5.1, 3.83, 3.83, 5.36, 4.85, 9.95, 5.1, 4.59, 5.87, 11.48, 3.57, 9.44
                    ], 
                   ['2017-05',
                    15.02, 10.76, 5.13, 3.25, 3, 5.01, 5.38, 12.52, 4.38, 4.38, 5.26, 12.89, 4.51, 8.51
                    ], 
                   ['2017-06',
                    16.23, 9.68, 3.83, 3.43, 3.43, 4.44, 3.93, 12.9, 5.75, 4.84, 4.33, 13.61, 4.64, 8.97
                    ], 
                   ['2017-07',
                    11.61, 10.05, 6.22, 2.9, 4.15, 4.87, 5.28, 14.2, 5.7, 4.77, 4.25, 11.71, 5.39, 8.91
                    ], 
                   ['2017-08',
                    14.07, 10.51, 4, 3.56, 3.13, 4.26, 5.04, 14.51, 5.47, 4.17, 4.78, 13.99, 4.69, 7.82
                    ], 
                   ['2017-09',
                    12.44, 9.84, 4.47, 2.93, 3.82, 4.8, 3.82, 13.25, 6.42, 5.04, 4.47, 15.04, 4.63, 9.02
                    ], 
                   ['2017-10',
                    11.68, 11.26, 5.15, 3.09, 3.91, 4.6, 3.71, 12.29, 5.01, 4.12, 5.56, 15.38, 4.95, 9.27
                    ], 
                   ['2017-11',
                    11.81, 10.01, 5.06, 2.92, 3.26, 5.91, 4.89, 13.67, 5.74, 4.84, 4.61, 13.67, 4.33, 9.28
                    ], 
                   ['2017-12',
                    11.44, 10.1, 4.16, 3.19, 4.01, 4.61, 4.01, 13.97, 5.57, 4.61, 5.5, 14.93, 5.42, 8.47
                    ], 
                   ['2018-01',
                    13.75, 10.86, 4.54, 2.01, 3.27, 4.98, 4.46, 11.08, 6.62, 4.61, 5.13, 14.57, 4.68, 9.44
                    ], 
                   ['2018-02',
                    11.38, 10.3, 4.83, 2.67, 3.6, 4.47, 5.55, 14.41, 5.62, 3.96, 5.55, 13.76, 4.68, 9.22
                    ], 
                   ['2018-03',
                    12.6, 10.44, 4.43, 2.49, 4, 3.84, 4.87, 13.52, 5.79, 5.41, 5.19, 13.79, 4.6, 9.03
                    ], 
                   ['2018-04',
                    12.33, 11.58, 4.65, 3.32, 2.79, 3.61, 5.06, 12.74, 6.34, 5.24, 4.48, 15.13, 4.13, 8.61
                    ], 
                   ['2018-05',
                    12.18, 10.81, 4.42, 3.22, 3.5, 4.7, 4.7, 13.44, 5.73, 4.86, 4.42, 14.15, 4.97, 8.9
                    ], 
                   ['2018-06',
                    12.1, 9.74, 4.52, 3.62, 3.16, 4.42, 4.32, 13.16, 5.42, 4.32, 5.52, 16.32, 3.52, 9.84
                    ], 
                   ['2018-07',
                    10.51, 8.34, 4.3, 2.43, 4.04, 4.45, 4.97, 13.15, 6.58, 3.99, 5.39, 14.91, 6.11, 10.82
                    ], 
                   ['2018-08',
                    12.49, 9.34, 4.41, 3.2, 3.83, 4.88, 5.51, 13.17, 5.14, 5.3, 4.51, 13.9, 4.2, 10.13
                    ], 
                   ['2018-09',
                    11.07, 10.28, 4.6, 2.72, 3.09, 4.66, 5.57, 13.19, 6.84, 4.72, 4.78, 15.06, 5.2, 8.23
                    ], 
                   ['2018-10',
                    12.25, 10.23, 4.3, 2.5, 3.42, 4.96, 5.53, 11.76, 6.23, 4.3, 4.52, 15.72, 5.22, 9.04
                    ], 
                   ['2018-11',
                    10.42, 10.88, 4.54, 3.38, 4.22, 4.61, 4.29, 13.2, 5.03, 4.29, 5.21, 16.05, 5.39, 8.48
                    ], 
                   ['2018-12',
                    12.26, 10.34, 6.16, 2.73, 4.94, 5.87, 4.82, 12.14, 5.69, 4.07, 5.29, 13.65, 4.42, 7.61
                    ], 
                   ['2019-01',
                    11.18, 10.54, 5.79, 2.4, 3.43, 4.61, 4.76, 11.38, 6.57, 4.81, 4.76, 15.6, 4.76, 9.42
                    ], 
                   ['2019-02',
                    11.98, 10.25, 4.43, 2.94, 3.36, 3.87, 4.15, 12.4, 6.01, 4.52, 5.64, 16.12, 4.85, 9.51
                    ], 
                   ['2019-03',
                    11.56, 10.93, 5.37, 3.33, 3.88, 4.66, 4.74, 12.3, 5.53, 4.19, 4.23, 15.13, 4.78, 9.37
                    ], 
                   ['2019-04',
                    11.74, 9.39, 4.97, 3.42, 4.34, 4.49, 5.37, 12.59, 4.64, 4.45, 5.15, 14.91, 4.86, 9.68
                    ], 
                   ['2019-05',
                    11.39, 9.6, 5.26, 3.08, 4.06, 4.31, 5.4, 11.49, 6.24, 4.38, 5.96, 14.65, 4.56, 9.64
                    ], 
                   ['2019-06',
                    10.78, 10.27, 4.18, 3.4, 3.71, 4.8, 5.39, 13.2, 5.47, 4.73, 4.92, 14.57, 4.84, 9.73
                    ], 
                   ['2019-07',
                    9.41, 9.96, 5.14, 3.6, 3.69, 5.07, 5.2, 12.17, 6.65, 4.56, 5.62, 14.55, 5.39, 8.99
                    ], 
                   ['2019-08',
                    9.64, 9.18, 5.4, 3.14, 4.27, 4.27, 5.14, 12.42, 6.05, 4.3, 5.79, 16.14, 4.33, 9.93
                    ], 
                   ['2019-09',
                    10.95, 10.02, 4.39, 3.4, 3.9, 3.75, 4.5, 12.26, 6.23, 4.61, 5.6, 15.37, 4.75, 10.27
                    ], 
                   ['2019-10',
                    9.09, 9.52, 4.99, 3.43, 4.03, 4.78, 4.78, 12.99, 6.65, 4.81, 4.95, 15.39, 5.7, 8.88
                    ], 
                   ['2019-11',
                    10.92, 10.19, 5.2, 3.08, 4.2, 5.03, 4.67, 12.87, 5.82, 4.04, 5.39, 14.92, 4.86, 8.8
                    ], 
                   ['2019-12',
                    10.97, 9.33, 4.57, 2.61, 4.85, 5.23, 5.32, 11.71, 5.69, 4.06, 5.27, 16.29, 4.43, 9.66
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba krajů v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-16-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart16);
    function drawCOLUMN3Chart17() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Důchod', 'Jiné', 'Nezaměstnaný', 'OSVČ', 'Podnikatel', 'Rodičovská dovolená', 'Student', 'Svobodné povolání', 'Zaměstnanec'],
                   ['2016-02',
                    1.56, 1.87, 0, 33.96, 7.79, 0.31, 0.62, 0.62, 53.27
                    ], 
                   ['2016-03',
                    0.7, 2.11, 0, 25.26, 5.26, 2.11, 0, 1.05, 63.51
                    ], 
                   ['2016-04',
                    2.51, 1.26, 0, 13.39, 4.6, 0.42, 0.84, 0.42, 76.57
                    ], 
                   ['2016-05',
                    3.25, 0.97, 0, 17.21, 3.9, 1.62, 0.32, 1.62, 71.1
                    ], 
                   ['2016-06',
                    1.91, 0.38, 0, 17.94, 5.73, 2.29, 0.76, 1.15, 69.85
                    ], 
                   ['2016-07',
                    3.14, 1.35, 0, 17.04, 6.73, 0.9, 0.45, 0.45, 69.96
                    ], 
                   ['2016-08',
                    3.75, 0.37, 0, 15.73, 4.49, 0.75, 0, 0.75, 74.16
                    ], 
                   ['2016-09',
                    2.14, 0.85, 0, 15.81, 3.42, 1.28, 0, 0.43, 76.07
                    ], 
                   ['2016-10',
                    3.32, 1.11, 0, 14.76, 3.32, 2.21, 1.48, 0.37, 73.43
                    ], 
                   ['2016-11',
                    4.26, 1.18, 0, 18.68, 3.55, 2.13, 0.24, 0.24, 69.74
                    ], 
                   ['2016-12',
                    5.05, 1.1, 0, 17.14, 4.4, 1.32, 0.22, 0, 70.77
                    ], 
                   ['2017-01',
                    3.28, 2.02, 0, 16.92, 2.02, 1.77, 0.25, 0.25, 73.48
                    ], 
                   ['2017-02',
                    5, 0.26, 0, 12.63, 2.37, 2.63, 0.53, 0.79, 75.79
                    ], 
                   ['2017-03',
                    3.79, 1.01, 0, 11.62, 1.52, 2.02, 0, 0, 80.05
                    ], 
                   ['2017-04',
                    5.36, 1.02, 0, 12.5, 2.81, 0.51, 0.26, 0, 77.55
                    ], 
                   ['2017-05',
                    3.75, 0.63, 0, 11.76, 2.13, 1.5, 0.38, 0.25, 79.6
                    ], 
                   ['2017-06',
                    3.83, 0.91, 0, 12.6, 2.22, 1.81, 0.5, 0.2, 77.92
                    ], 
                   ['2017-07',
                    4.35, 0.52, 0, 10.67, 2.69, 1.45, 0.1, 0.62, 79.59
                    ], 
                   ['2017-08',
                    4, 1.22, 0, 12.86, 2.35, 1.48, 0.26, 0.43, 77.41
                    ], 
                   ['2017-09',
                    3.5, 0.73, 0, 12.2, 2.2, 0.89, 0.33, 0.33, 79.84
                    ], 
                   ['2017-10',
                    6.11, 0.82, 0, 12.71, 1.79, 1.1, 0.48, 0.48, 76.51
                    ], 
                   ['2017-11',
                    5.79, 1.24, 0, 10.74, 1.91, 1.41, 0.28, 0.39, 78.23
                    ], 
                   ['2017-12',
                    7.8, 1.26, 0, 11.66, 1.56, 2.08, 0.22, 0.59, 74.81
                    ], 
                   ['2018-01',
                    5.43, 0.37, 0.22, 13.68, 1.86, 2.68, 0.3, 0.3, 75.17
                    ], 
                   ['2018-02',
                    5.26, 0.86, 0, 13.18, 1.37, 3.24, 0.29, 0.22, 75.58
                    ], 
                   ['2018-03',
                    4.38, 0.65, 0.05, 12.6, 1.78, 3.79, 0.49, 0.22, 76.04
                    ], 
                   ['2018-04',
                    4.71, 1.75, 0, 12.86, 2.27, 2.91, 0.52, 0.41, 74.58
                    ], 
                   ['2018-05',
                    4.53, 0.49, 0, 10.6, 1.26, 2.84, 0.38, 0.44, 79.46
                    ], 
                   ['2018-06',
                    4.12, 0.3, 0, 10.85, 1.56, 4.72, 0.05, 0.5, 77.9
                    ], 
                   ['2018-07',
                    4.97, 0.73, 0, 10.46, 1.66, 2.64, 0.16, 0.36, 79.03
                    ], 
                   ['2018-08',
                    5.61, 0.42, 0.05, 11.44, 1.36, 3.78, 0.31, 0.16, 76.86
                    ], 
                   ['2018-09',
                    5.32, 0.85, 0, 10.53, 1.21, 2.36, 0.24, 0.06, 79.43
                    ], 
                   ['2018-10',
                    5.88, 0.7, 0, 11.24, 1.05, 2.63, 0.35, 0.22, 77.92
                    ], 
                   ['2018-11',
                    5.98, 0.67, 0, 10.91, 1.27, 3.59, 0.28, 0.11, 77.19
                    ], 
                   ['2018-12',
                    4.76, 0.41, 0.06, 12.09, 1.92, 2.85, 0.17, 0.17, 77.57
                    ], 
                   ['2019-01',
                    4.07, 0.69, 0, 10.69, 1.37, 2.65, 0.1, 0.25, 80.19
                    ], 
                   ['2019-02',
                    5.55, 0.65, 0, 11.32, 1.35, 3.12, 0.42, 0.19, 77.4
                    ], 
                   ['2019-03',
                    5.53, 0.74, 0.04, 10.54, 1.1, 3.53, 0.12, 0.24, 78.17
                    ], 
                   ['2019-04',
                    5.67, 0.55, 0, 11.12, 1.18, 2.69, 0.18, 0.33, 78.28
                    ], 
                   ['2019-05',
                    5.33, 0.46, 0, 9.64, 1.26, 3.19, 0.04, 0.28, 79.82
                    ], 
                   ['2019-06',
                    5.35, 0.74, 0, 8.79, 1.05, 3.01, 0.16, 0.12, 80.78
                    ], 
                   ['2019-07',
                    4.88, 0.64, 0, 9.18, 1.38, 2.28, 0.13, 0.26, 81.25
                    ], 
                   ['2019-08',
                    5.56, 0.55, 0, 8.93, 0.94, 3.1, 0.1, 0.03, 80.79
                    ], 
                   ['2019-09',
                    5.35, 0.6, 0.07, 9.07, 1.13, 2.73, 0.35, 0.25, 80.45
                    ], 
                   ['2019-10',
                    5.66, 0.35, 0, 8.39, 0.81, 2.87, 0.39, 0.11, 81.42
                    ], 
                   ['2019-11',
                    5.56, 0.83, 0.07, 9.73, 1.26, 2.51, 0.1, 0.3, 79.65
                    ], 
                   ['2019-12',
                    5.74, 0.47, 0.05, 10.31, 0.93, 2.24, 0.23, 0.14, 79.89
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba zdrojů příjmu v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-17-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart17);
    function drawCOLUMN3Chart18() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'do 50 tis. Kč', 'od 50 do 100 tis. Kč', 'od 100 do 150 tis. Kč', 'od 150 do 200 tis. Kč', 'od 200 do 250 tis. Kč', 'od 250 do 300 tis. Kč', 'od 300 do 350 tis. Kč', 'od 350 do 400 tis. Kč', 'od 400 do 450 tis. Kč', 'od 450 do 500 tis. Kč', 'od 500 do 550 tis. Kč', 'od 550 do 600 tis. Kč', 'od 600 do 650 tis. Kč', 'od 650 do 700 tis. Kč', 'od 700 tis. Kč'],
                   ['2016-02',
                    26.79, 23.36, 15.26, 26.79, 5.3, 2.49, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-03',
                    21.75, 23.86, 20, 15.44, 7.72, 11.23, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-04',
                    17.57, 25.94, 20.5, 14.23, 9.62, 12.13, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-05',
                    22.73, 24.35, 17.53, 16.23, 7.79, 11.36, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-06',
                    22.9, 19.85, 18.32, 15.27, 10.69, 12.98, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-07',
                    18.39, 24.66, 17.49, 20.63, 8.07, 10.76, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-08',
                    25.09, 26.59, 15.36, 15.73, 8.61, 8.61, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-09',
                    24.79, 26.5, 14.53, 16.67, 7.69, 9.83, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-10',
                    25.46, 20.3, 20.66, 17.34, 6.27, 9.23, 0, 0.74, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-11',
                    19.15, 29.31, 15.84, 15.84, 7.57, 8.51, 1.42, 1.18, 0.24, 0.95, 0, 0, 0, 0, 0
                    ], 
                   ['2016-12',
                    24.4, 24.18, 14.51, 15.38, 6.81, 10.11, 1.54, 1.32, 0.44, 1.32, 0, 0, 0, 0, 0
                    ], 
                   ['2017-01',
                    20.96, 26.01, 15.91, 15.91, 7.83, 10.1, 1.01, 0.51, 0.76, 1.01, 0, 0, 0, 0, 0
                    ], 
                   ['2017-02',
                    20.79, 25.53, 16.32, 16.58, 8.42, 8.42, 1.32, 1.05, 0.53, 1.05, 0, 0, 0, 0, 0
                    ], 
                   ['2017-03',
                    23.99, 27.53, 17.93, 15.66, 4.8, 7.07, 1.52, 1.01, 0, 0.51, 0, 0, 0, 0, 0
                    ], 
                   ['2017-04',
                    24.23, 21.17, 19.13, 13.01, 8.42, 9.18, 1.28, 1.28, 1.02, 1.28, 0, 0, 0, 0, 0
                    ], 
                   ['2017-05',
                    22.78, 22.9, 14.77, 14.27, 7.51, 9.39, 2.63, 1.75, 1, 3, 0, 0, 0, 0, 0
                    ], 
                   ['2017-06',
                    23.89, 24.29, 14.62, 15.12, 6.65, 7.06, 2.62, 2.02, 1.01, 2.72, 0, 0, 0, 0, 0
                    ], 
                   ['2017-07',
                    26.11, 22.49, 15.03, 13.37, 7.25, 7.15, 2.28, 2.9, 1.14, 2.28, 0, 0, 0, 0, 0
                    ], 
                   ['2017-08',
                    25.37, 23.37, 15.38, 12.86, 7.12, 6.52, 3.13, 2.17, 1.04, 3.04, 0, 0, 0, 0, 0
                    ], 
                   ['2017-09',
                    26.34, 22.68, 13.33, 13.25, 6.91, 6.26, 2.76, 2.93, 2.03, 3.5, 0, 0, 0, 0, 0
                    ], 
                   ['2017-10',
                    26.03, 20.47, 13.12, 14.15, 8.04, 6.18, 3.23, 2.61, 1.44, 4.74, 0, 0, 0, 0, 0
                    ], 
                   ['2017-11',
                    27.39, 21.26, 13.95, 12.15, 7.03, 6.13, 3.71, 2.81, 1.35, 4.22, 0, 0, 0, 0, 0
                    ], 
                   ['2017-12',
                    26.82, 24.59, 12.63, 12.11, 6.09, 7.13, 3.27, 2.23, 1.93, 3.19, 0, 0, 0, 0, 0
                    ], 
                   ['2018-01',
                    25.5, 21.19, 14.42, 12.34, 6.47, 6.99, 4.39, 2.6, 1.78, 4.31, 0, 0, 0, 0, 0
                    ], 
                   ['2018-02',
                    22.98, 22.55, 13.9, 11.74, 6.7, 7.56, 3.39, 3.53, 2.31, 5.33, 0, 0, 0, 0, 0
                    ], 
                   ['2018-03',
                    24.82, 22.55, 14.76, 14.12, 6.33, 5.68, 2.97, 3.3, 1.73, 3.73, 0, 0, 0, 0, 0
                    ], 
                   ['2018-04',
                    26.47, 20.94, 15.13, 13.15, 7.1, 6.17, 2.97, 2.97, 1.4, 3.72, 0, 0, 0, 0, 0
                    ], 
                   ['2018-05',
                    27.36, 24.69, 14.15, 12.45, 5.9, 6.12, 2.84, 3, 0.98, 2.51, 0, 0, 0, 0, 0
                    ], 
                   ['2018-06',
                    28.33, 22.8, 14.47, 11.3, 7.13, 6.58, 3.01, 2.91, 1.05, 2.41, 0, 0, 0, 0, 0
                    ], 
                   ['2018-07',
                    25.38, 24.24, 13.15, 13.36, 6.89, 6.11, 3, 3.26, 0.93, 3.68, 0, 0, 0, 0, 0
                    ], 
                   ['2018-08',
                    28.38, 22.67, 13.12, 12.01, 6.77, 6.35, 3.04, 3.25, 1.1, 2.41, 0.26, 0.37, 0, 0.1, 0.16
                    ], 
                   ['2018-09',
                    27.59, 22.5, 13.07, 11.74, 6.05, 7.2, 3.02, 3.09, 1.27, 3.02, 0.42, 0.6, 0.12, 0.06, 0.24
                    ], 
                   ['2018-10',
                    29.5, 22.7, 11.81, 10.54, 6.89, 5.79, 3.29, 3.56, 1.49, 2.41, 0.53, 0.57, 0.18, 0.18, 0.57
                    ], 
                   ['2018-11',
                    33.02, 21.54, 12.71, 10.77, 5.39, 5.32, 3.31, 3.45, 1.23, 1.76, 0.18, 0.32, 0.46, 0.07, 0.49
                    ], 
                   ['2018-12',
                    36.9, 22.08, 11.85, 9.59, 5.64, 5.17, 2.38, 2.21, 1.05, 1.98, 0.17, 0.41, 0.23, 0.12, 0.23
                    ], 
                   ['2019-01',
                    32.07, 24.42, 12.51, 11.53, 5.1, 5.39, 2.89, 2.16, 0.98, 1.72, 0.15, 0.39, 0.05, 0.2, 0.44
                    ], 
                   ['2019-02',
                    30.71, 24.74, 12.26, 11.7, 5.68, 5.17, 2.14, 2.98, 0.93, 1.96, 0.47, 0.51, 0.19, 0.28, 0.28
                    ], 
                   ['2019-03',
                    31.19, 23.35, 12.23, 12.23, 5.76, 5.05, 2.98, 2.78, 1.49, 1.57, 0.2, 0.39, 0.16, 0.31, 0.31
                    ], 
                   ['2019-04',
                    29.78, 20.79, 13.69, 11.26, 6.4, 5.93, 2.8, 2.91, 1.47, 2.17, 0.66, 0.74, 0.37, 0.37, 0.66
                    ], 
                   ['2019-05',
                    29.99, 21.51, 12.47, 11.81, 5.68, 5.22, 3.43, 3.05, 1.23, 2.45, 0.74, 0.88, 0.42, 0.46, 0.67
                    ], 
                   ['2019-06',
                    33.24, 22.7, 11.17, 10.35, 5.78, 5.55, 2.93, 2.58, 1.25, 1.68, 0.82, 0.51, 0.47, 0.51, 0.47
                    ], 
                   ['2019-07',
                    32.85, 21.58, 13.26, 10.34, 5.72, 5.68, 2.95, 2.06, 1.22, 1.7, 0.45, 1, 0.42, 0.39, 0.39
                    ], 
                   ['2019-08',
                    31.89, 21.41, 12.39, 11.64, 5.5, 5.66, 3.14, 2.78, 1.42, 1.62, 0.81, 0.78, 0.13, 0.45, 0.39
                    ], 
                   ['2019-09',
                    32.48, 23.38, 12.86, 10.02, 4.99, 5.42, 2.69, 2.76, 1.03, 1.81, 0.35, 0.78, 0.28, 0.46, 0.67
                    ], 
                   ['2019-10',
                    32.27, 23.18, 12.21, 11.22, 6.55, 4.95, 2.41, 2.58, 0.92, 1.7, 0.46, 0.35, 0.28, 0.25, 0.67
                    ], 
                   ['2019-11',
                    33.12, 20.28, 11.45, 10.23, 4.9, 7.15, 3.54, 3.01, 1.65, 1.72, 0.53, 0.93, 0.4, 0.3, 0.79
                    ], 
                   ['2019-12',
                    35.18, 21.37, 10.55, 10.13, 5.41, 4.81, 3.03, 2.57, 1.35, 2.05, 0.98, 0.89, 0.79, 0.28, 0.61
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba výší úvěru v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-18-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart18);
    function drawCOLUMN3Chart19() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'do 6 měs.', 'od 6 do 12 měs.', 'od 12 do 18 měs.', 'od 18 do 24 měs.', 'od 24 do 30 měs.', 'od 30 do 36 měs.', 'od 36 do 42 měs.', 'od 42 do 48 měs.', 'od 48 do 54 měs.', 'od 54 do 60 měs.', 'od 60 do 66 měs.', 'od 66 do 72 měs.', 'od 72 do 78 měs.', 'od 78 měs.'],
                   ['2016-02',
                    3.4268, 5.919, 8.4112, 11.5265, 9.6573, 9.9688, 5.6075, 11.215, 3.7383, 6.2305, 5.919, 4.6729, 2.1807, 11.5265
                    ], 
                   ['2016-03',
                    0.3509, 2.807, 2.807, 8.0702, 7.0175, 12.9825, 7.7193, 11.2281, 5.614, 6.6667, 4.5614, 5.9649, 3.1579, 21.0526
                    ], 
                   ['2016-04',
                    0, 2.5105, 2.5105, 10.4603, 5.4393, 9.205, 8.7866, 10.4603, 7.9498, 8.3682, 10.0418, 6.6946, 2.0921, 15.4812
                    ], 
                   ['2016-05',
                    0, 3.5714, 3.2468, 9.7403, 7.7922, 10.0649, 7.4675, 10.7143, 3.8961, 9.7403, 4.2208, 4.8701, 3.8961, 20.7792
                    ], 
                   ['2016-06',
                    0, 1.145, 6.1069, 8.7786, 6.1069, 6.8702, 4.9618, 10.3053, 8.3969, 6.8702, 4.5802, 9.9237, 4.9618, 20.9924
                    ], 
                   ['2016-07',
                    0.8969, 2.2422, 3.5874, 5.3812, 7.6233, 8.0717, 6.278, 10.3139, 7.6233, 12.5561, 6.278, 8.9686, 4.0359, 16.1435
                    ], 
                   ['2016-08',
                    0.3745, 1.8727, 2.9963, 7.1161, 7.4906, 8.6142, 8.6142, 9.3633, 7.4906, 10.1124, 2.9963, 6.367, 3.7453, 22.8464
                    ], 
                   ['2016-09',
                    0.8547, 1.7094, 4.7009, 8.9744, 5.5556, 4.2735, 4.2735, 11.1111, 8.1197, 8.1197, 4.2735, 11.9658, 3.4188, 22.6496
                    ], 
                   ['2016-10',
                    0.738, 2.214, 3.69, 7.7491, 4.428, 7.0111, 6.2731, 11.8081, 7.7491, 10.7011, 5.1661, 8.1181, 5.9041, 18.4502
                    ], 
                   ['2016-11',
                    0.2364, 0.9456, 3.3097, 6.8558, 5.4374, 7.3286, 6.383, 11.3475, 4.7281, 8.5106, 3.7825, 6.8558, 7.3286, 26.9504
                    ], 
                   ['2016-12',
                    0.4396, 1.7582, 3.0769, 6.8132, 4.3956, 7.033, 5.2747, 9.8901, 7.4725, 7.4725, 4.3956, 4.1758, 6.3736, 31.4286
                    ], 
                   ['2017-01',
                    0.2525, 3.0303, 3.5354, 5.303, 5.5556, 9.3434, 3.7879, 10.3535, 8.5859, 7.5758, 4.5455, 8.3333, 6.5657, 23.2323
                    ], 
                   ['2017-02',
                    0.2632, 1.0526, 3.9474, 5.2632, 5.2632, 6.5789, 6.0526, 12.8947, 7.3684, 8.9474, 7.6316, 6.8421, 5.5263, 22.3684
                    ], 
                   ['2017-03',
                    0.7576, 3.2828, 4.798, 6.8182, 4.798, 5.303, 5.8081, 11.8687, 7.0707, 10.8586, 4.798, 6.5657, 3.7879, 23.4848
                    ], 
                   ['2017-04',
                    0.5102, 2.0408, 3.0612, 6.3776, 7.1429, 7.9082, 6.1224, 7.9082, 6.6327, 7.9082, 8.6735, 5.3571, 4.5918, 25.7653
                    ], 
                   ['2017-05',
                    0.5006, 2.0025, 2.8786, 6.1327, 5.0063, 5.8824, 4.7559, 9.5119, 5.5069, 7.5094, 5.8824, 6.8836, 5.1314, 32.4155
                    ], 
                   ['2017-06',
                    0, 2.3185, 2.4194, 7.0565, 5.3427, 5.746, 6.0484, 9.0726, 6.3508, 8.4677, 4.9395, 6.8548, 3.8306, 31.5524
                    ], 
                   ['2017-07',
                    0.4145, 1.5544, 4.2487, 6.5285, 6.2176, 4.9741, 4.8705, 10.8808, 6.4249, 8.1865, 4.9741, 5.8031, 4.9741, 29.9482
                    ], 
                   ['2017-08',
                    0.7819, 1.477, 3.649, 7.5586, 5.7341, 5.6473, 6.603, 9.5569, 4.344, 7.1242, 4.2572, 6.8636, 3.3884, 33.0148
                    ], 
                   ['2017-09',
                    0.5691, 3.0081, 3.4959, 6.0163, 4.3902, 6.1789, 6.3415, 10.0813, 5.935, 6.748, 5.7724, 6.6667, 3.9024, 30.8943
                    ], 
                   ['2017-10',
                    0.4121, 1.9231, 3.0907, 6.9368, 5.3571, 6.3874, 4.6016, 9.1346, 5.7005, 6.7308, 5.5632, 5.1511, 5.2885, 33.7225
                    ], 
                   ['2017-11',
                    0.3937, 2.5872, 3.4308, 6.2992, 5.793, 5.0056, 5.1744, 11.3048, 4.8931, 6.8616, 5.5681, 6.3555, 4.4432, 31.8898
                    ], 
                   ['2017-12',
                    0.6686, 3.1947, 3.4918, 7.1322, 5.052, 5.2749, 6.5379, 10.847, 6.5379, 5.3492, 5.1263, 6.0178, 4.4577, 30.312
                    ], 
                   ['2018-01',
                    0.4461, 3.1227, 3.9405, 5.0558, 5.7993, 5.8736, 5.2045, 9.145, 5.1301, 6.9888, 6.0967, 6.0223, 3.7918, 33.3829
                    ], 
                   ['2018-02',
                    0.2161, 3.098, 3.6023, 5.7637, 4.9712, 4.611, 4.683, 10.6628, 5.5476, 6.7003, 5.5476, 5.4755, 4.8991, 34.2219
                    ], 
                   ['2018-03',
                    0.2163, 2.6501, 4.0022, 5.4624, 5.192, 5.4083, 5.3002, 8.6533, 4.8134, 7.8421, 5.2461, 5.7328, 4.7052, 34.7756
                    ], 
                   ['2018-04',
                    0.4072, 2.7341, 3.6067, 6.1082, 3.8394, 4.7702, 6.05, 10.0058, 5.8755, 7.2717, 5.2356, 5.4101, 5.0611, 33.6242
                    ], 
                   ['2018-05',
                    0.3277, 2.0208, 3.823, 6.6084, 4.97, 6.0076, 5.3523, 10.1038, 5.7892, 6.9907, 4.5877, 5.953, 4.0961, 33.3697
                    ], 
                   ['2018-06',
                    0.452, 2.1095, 3.3149, 6.6298, 4.7715, 6.6298, 5.3742, 10.3466, 4.3697, 6.2783, 4.7715, 5.8764, 4.5203, 34.5555
                    ], 
                   ['2018-07',
                    0.5179, 2.5893, 3.0554, 6.4733, 4.8679, 5.2305, 4.9715, 9.7359, 4.609, 8.2341, 4.8162, 5.1787, 4.0911, 35.6292
                    ], 
                   ['2018-08',
                    0.6296, 2.7282, 4.1448, 6.6107, 4.6695, 5.2466, 5.9286, 9.6013, 5.1941, 6.978, 5.0367, 5.5089, 4.5645, 33.1584
                    ], 
                   ['2018-09',
                    0.484, 2.7828, 3.9927, 6.2916, 5.1422, 5.3842, 4.5372, 9.3769, 4.9607, 6.8966, 6.1101, 5.4446, 3.9927, 34.6038
                    ], 
                   ['2018-10',
                    0.7902, 3.468, 3.2046, 6.5408, 6.0579, 4.5654, 5.3117, 10.1844, 4.5215, 7.0676, 4.4776, 6.453, 4.0825, 33.2748
                    ], 
                   ['2018-11',
                    0.4576, 2.8159, 4.9982, 7.8493, 4.9278, 6.0542, 5.8782, 9.7149, 4.1535, 6.019, 4.8926, 4.8222, 4.2591, 33.1573
                    ], 
                   ['2018-12',
                    0.9878, 4.7647, 4.5322, 8.0186, 5.2876, 5.8106, 5.0552, 10.6334, 4.7066, 5.8687, 3.835, 3.9512, 3.6607, 32.8879
                    ], 
                   ['2019-01',
                    0.5885, 5.0515, 3.4821, 7.5037, 5.6891, 5.4929, 4.9534, 8.9259, 5.591, 6.3266, 4.9044, 4.8553, 3.7764, 32.8592
                    ], 
                   ['2019-02',
                    0.699, 3.2619, 3.6813, 7.4091, 4.4734, 5.7316, 5.3122, 9.0401, 5.918, 6.384, 4.5666, 5.1724, 3.9609, 34.3896
                    ], 
                   ['2019-03',
                    0.5878, 3.0172, 4.4671, 7.6411, 3.8793, 5.6034, 5.721, 8.8166, 6.4655, 7.2492, 4.0752, 5.094, 4.232, 33.1505
                    ], 
                   ['2019-04',
                    0.7361, 3.1285, 3.975, 7.2874, 4.8583, 5.5208, 5.2632, 9.3485, 5.3736, 6.1097, 5.8152, 4.1958, 4.0486, 34.3393
                    ], 
                   ['2019-05',
                    0.8059, 3.4688, 4.1696, 6.9376, 4.4149, 5.7463, 5.2558, 9.7407, 4.7652, 6.7975, 5.431, 4.3798, 3.4688, 34.6181
                    ], 
                   ['2019-06',
                    0.5859, 3.2031, 4.8438, 7.5391, 4.0625, 5.5078, 5.2734, 10, 4.5312, 5.4297, 4.1797, 4.7656, 3.6328, 36.4453
                    ], 
                   ['2019-07',
                    0.7386, 3.8536, 4.2068, 7.9961, 4.7206, 6.0051, 4.817, 9.7624, 4.817, 6.1978, 4.1105, 4.5279, 4.1105, 34.1362
                    ], 
                   ['2019-08',
                    0.4528, 3.2988, 4.3338, 7.4386, 4.4955, 5.6598, 4.5925, 9.282, 4.3014, 6.3066, 4.9806, 5.0129, 4.5278, 35.3169
                    ], 
                   ['2019-09',
                    0.7793, 2.9756, 4.853, 7.1201, 5.3135, 6.022, 4.853, 9.5643, 4.9593, 5.8448, 4.7821, 4.5342, 3.9674, 34.4315
                    ], 
                   ['2019-10',
                    0.6723, 2.937, 3.8924, 7.3248, 5.2017, 5.5202, 5.2725, 9.3064, 4.3878, 5.4494, 5.3432, 4.3878, 4.6355, 35.6688
                    ], 
                   ['2019-11',
                    0.8604, 3.4083, 3.9378, 7.2138, 4.5334, 4.6658, 4.9636, 9.4639, 3.7723, 6.949, 4.5996, 5.4269, 4.368, 35.8372
                    ], 
                   ['2019-12',
                    0.7933, 3.4998, 3.9664, 8.4461, 4.3397, 5.9729, 4.1531, 9.0527, 4.3397, 5.9263, 4.293, 4.8063, 4.573, 35.8376
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba délek úvěru v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 1. 2020 ze Zonky loanbooku k 1/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-19-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart19);
