
google.charts.load('current', {'packages':['bar', 'line', 'corechart']});
    function drawBAR3Chart0() {
        var data = google.visualization.arrayToDataTable([
                ['Účel', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Auto-moto (285 z 5515)',
                    0, 0.0181, 0.0544, 0.2901, 0.0181, 0.5258, 0.0181, 0.9066, 1.233, 1.3237, 0.7797
                    ], 
                   ['Cestování (18 z 527)',
                    0, 0, 0, 0.1898, 0, 0.3795, 0, 0.9488, 1.3283, 0.1898, 0.3795
                    ], 
                   ['Domácnost (475 z 6747)',
                    0, 0.0445, 0.1334, 0.4595, 0.0445, 0.9782, 0.0296, 1.5118, 1.4229, 1.245, 1.1709
                    ], 
                   ['Elektronika (21 z 599)',
                    0, 0, 0.3339, 0.1669, 0, 0.3339, 0, 0.8347, 0.3339, 0.8347, 0.6678
                    ], 
                   ['Jiné (307 z 5070)',
                    0, 0.0394, 0.0986, 0.4142, 0.0789, 0.927, 0.0197, 1.4004, 1.1045, 1.0651, 0.9073
                    ], 
                   ['Refinancování půjček (436 z 7089)',
                    0, 0.0423, 0.1552, 0.4514, 0.0141, 0.9874, 0.0282, 1.2273, 1.1285, 1.0157, 1.1003
                    ], 
                   ['Vlastní projekt (106 z 1433)',
                    0, 0.0698, 0.2791, 0.3489, 0.1396, 0.9072, 0.0698, 1.8144, 1.6748, 1.5352, 0.5583
                    ], 
                   ['Vzdělání (17 z 398)',
                    0, 0, 0, 0.2513, 0, 0.7538, 0.2513, 0.7538, 0.5025, 1.7588, 0
                    ], 
                   ['Zdraví (23 z 464)',
                    0, 0, 0.2155, 0.2155, 0, 0.6466, 0, 0.6466, 1.0776, 0.8621, 1.2931
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle účelu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-0-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart0);
    function drawBAR3Chart1() {
        var data = google.visualization.arrayToDataTable([
                ['Kraj', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Hlavní město Praha (157 z 3587)',
                    0, 0, 0.1394, 0.3624, 0.0558, 0.5576, 0.0279, 0.9479, 0.9757, 0.92, 0.3903
                    ], 
                   ['Jihomoravský kraj (137 z 2851)',
                    0, 0.0351, 0.2455, 0.2455, 0.0702, 0.6664, 0, 1.0172, 0.8418, 0.9821, 0.7015
                    ], 
                   ['Jihočeský kraj (100 z 1313)',
                    0, 0, 0.3808, 0.5331, 0.0762, 1.0663, 0.1523, 1.904, 1.2947, 1.0663, 1.1424
                    ], 
                   ['Karlovarský kraj (59 z 773)',
                    0, 0, 0.1294, 0, 0, 0.6468, 0.1294, 2.1992, 1.5524, 1.9405, 1.0349
                    ], 
                   ['Kraj Vysočina (60 z 1039)',
                    0, 0.0962, 0, 0.385, 0, 0.77, 0, 1.0587, 1.6362, 0.6737, 1.155
                    ], 
                   ['Královéhradecký kraj (72 z 1303)',
                    0, 0, 0, 0.2302, 0, 0.6907, 0, 1.4582, 1.0744, 1.1512, 0.921
                    ], 
                   ['Liberecký kraj (92 z 1356)',
                    0, 0.0737, 0, 0.1475, 0, 1.3274, 0, 1.3274, 1.6224, 1.3274, 0.9587
                    ], 
                   ['Moravskoslezský kraj (234 z 3650)',
                    0, 0.0274, 0.1644, 0.3562, 0, 1.0137, 0.0274, 1.3151, 1.2877, 1.0959, 1.1233
                    ], 
                   ['Olomoucký kraj (100 z 1595)',
                    0, 0, 0.1254, 0.4389, 0.0627, 0.6897, 0, 1.0031, 1.1912, 1.5674, 1.1912
                    ], 
                   ['Pardubický kraj (78 z 1225)',
                    0, 0.1633, 0, 0.5714, 0, 0.6531, 0, 1.7143, 0.9796, 1.2245, 1.0612
                    ], 
                   ['Plzeňský kraj (116 z 1395)',
                    0, 0.1434, 0, 0.7168, 0, 0.9319, 0.1434, 1.7921, 2.2222, 1.5054, 0.8602
                    ], 
                   ['Středočeský kraj (219 z 3931)',
                    0, 0.0254, 0.0763, 0.3307, 0.0509, 0.7632, 0, 1.1956, 0.9921, 0.9667, 1.1702
                    ], 
                   ['Zlínský kraj (70 z 1314)',
                    0, 0.0761, 0.3044, 0.6088, 0.0761, 0.9132, 0, 0.6849, 1.0654, 0.761, 0.8371
                    ], 
                   ['Ústecký kraj (194 z 2510)',
                    0, 0, 0.0797, 0.5976, 0.0797, 1.2351, 0.0398, 1.3147, 1.4741, 1.7131, 1.1952
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle kraje žadatele',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-1-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart1);
    function drawBAR3Chart2() {
        var data = google.visualization.arrayToDataTable([
                ['Zdroj příjmu', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Důchod (139 z 1375)',
                    0, 0.2182, 0.3636, 0.5818, 0.2182, 1.7455, 0.0727, 1.8909, 1.3818, 1.9636, 1.6727
                    ], 
                   ['Jiné (12 z 208)',
                    0, 0, 0, 0.4808, 0, 0, 0, 1.4423, 0.9615, 0.9615, 1.9231
                    ], 
                   ['OSVČ (156 z 2733)',
                    0, 0, 0.1464, 0.4391, 0.1098, 0.6952, 0.0366, 1.6831, 1.1343, 1.0245, 0.4391
                    ], 
                   ['Podnikatel (18 z 388)',
                    0, 0, 0, 0.7732, 0, 0.2577, 0, 0.7732, 1.0309, 1.8041, 0
                    ], 
                   ['Rodičovská dovolená (66 z 707)',
                    0, 0, 0, 0.2829, 0, 0.8487, 0, 1.273, 2.4045, 1.8388, 2.6874
                    ], 
                   ['Student (9 z 106)',
                    0, 0, 0, 0, 0, 0, 0, 1.8868, 1.8868, 2.8302, 1.8868
                    ], 
                   ['Svobodné povolání (9 z 81)',
                    0, 0, 0, 0, 0, 0, 0, 2.4691, 4.9383, 1.2346, 2.4691
                    ], 
                   ['Zaměstnanec (1277 z 22239)',
                    0, 0.0315, 0.1169, 0.3732, 0.0225, 0.8319, 0.027, 1.1736, 1.1691, 1.0837, 0.9128
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle zdroje příjmu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-2-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart2);
    function drawBAR3Chart3() {
        var data = google.visualization.arrayToDataTable([
                ['Výše úvěru', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['do 50 000,- Kč (598 z 10547)',
                    0, 0, 0.0569, 0.1707, 0.0095, 0.531, 0.0284, 0.8912, 1.024, 1.4127, 1.5455
                    ], 
                   ['50 001,- až 100 000,- Kč (475 z 6503)',
                    0, 0.0154, 0.123, 0.2614, 0.0461, 0.9073, 0.0154, 1.63, 1.7223, 1.4147, 1.1687
                    ], 
                   ['100 001,- až 150 000,- Kč (240 z 3406)',
                    0, 0.0881, 0.0587, 0.6166, 0.1174, 0.8514, 0, 1.8203, 1.7029, 1.2918, 0.4991
                    ], 
                   ['150 001,- až 200 000,- Kč (168 z 2819)',
                    0, 0, 0.1064, 0.5321, 0.0355, 1.4899, 0, 1.5963, 0.9223, 0.9933, 0.2838
                    ], 
                   ['200 001,- až 250 000,- Kč (67 z 1388)',
                    0, 0.1441, 0.4323, 0.5764, 0.072, 1.2968, 0.072, 1.0086, 0.9366, 0.2161, 0.072
                    ], 
                   ['250 001,- až 300 000,- Kč (64 z 1359)',
                    0, 0.0736, 0.1472, 1.1038, 0, 0.7358, 0.0736, 1.3981, 0.8094, 0.2943, 0.0736
                    ], 
                   ['300 001,- až 350 000,- Kč (28 z 557)',
                    0, 0.1795, 0.3591, 0.5386, 0, 1.2567, 0.3591, 0.7181, 1.4363, 0.1795, 0
                    ], 
                   ['350 001,- až 400 000,- Kč (20 z 485)',
                    0, 0.2062, 0.6186, 0.8247, 0, 1.0309, 0, 0.6186, 0.6186, 0.2062, 0
                    ], 
                   ['400 001,- až 450 000,- Kč (9 z 221)',
                    0, 0, 0.905, 0.4525, 0, 2.2624, 0, 0.4525, 0, 0, 0
                    ], 
                   ['450 001,- až 500 000,- Kč (17 z 434)',
                    0, 0.2304, 0.2304, 1.6129, 0, 0.6912, 0, 0.9217, 0.2304, 0, 0
                    ], 
                   ['500 001,- až 550 000,- Kč (0 z 30)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['550 001,- až 600 000,- Kč (1 z 36)',
                    0, 0, 0, 0, 2.7778, 0, 0, 0, 0, 0, 0
                    ], 
                   ['600 001,- až 650 000,- Kč (1 z 25)',
                    0, 0, 0, 0, 0, 4, 0, 0, 0, 0, 0
                    ], 
                   ['650 001,- až 700 000,- Kč (0 z 18)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['od 700 001,- Kč (0 z 14)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle výše úvěru',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-3-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart3);
    function drawBAR3Chart4() {
        var data = google.visualization.arrayToDataTable([
                ['Délka úvěru', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['6 až 12 měs. (56 z 2072)',
                    0, 0, 0, 0, 0.0483, 0.0965, 0, 0.1448, 0.4344, 0.6757, 1.3031
                    ], 
                   ['13 až 18 měs. (55 z 1828)',
                    0, 0, 0.0547, 0.0547, 0.0547, 0.2735, 0, 0.3282, 0.7659, 0.6565, 0.8206
                    ], 
                   ['19 až 24 měs. (134 z 2682)',
                    0, 0, 0, 0.1491, 0, 0.3356, 0.0746, 1.0067, 1.2304, 1.6033, 0.5966
                    ], 
                   ['25 až 30 měs. (100 z 1775)',
                    0, 0, 0.0563, 0.1127, 0, 0.507, 0, 0.9014, 0.8451, 1.0141, 2.1972
                    ], 
                   ['31 až 36 měs. (99 z 1648)',
                    0, 0, 0, 0.3641, 0, 0.3034, 0, 1.5777, 0.8495, 1.3956, 1.517
                    ], 
                   ['37 až 42 měs. (100 z 1473)',
                    0, 0, 0, 0.4073, 0, 1.0183, 0.0679, 1.222, 1.5614, 1.3578, 1.1541
                    ], 
                   ['43 až 48 měs. (132 z 2551)',
                    0, 0, 0.0784, 0.3136, 0.0784, 0.9408, 0, 1.0584, 1.372, 1.0584, 0.2744
                    ], 
                   ['49 až 54 měs. (99 z 1248)',
                    0, 0, 0.1603, 0.2404, 0.0801, 0.1603, 0.0801, 1.7628, 1.8429, 1.9231, 1.6827
                    ], 
                   ['55 až 60 měs. (86 z 1475)',
                    0, 0.1356, 0.339, 0.7458, 0, 0.7458, 0, 0.8814, 1.0847, 1.4915, 0.4068
                    ], 
                   ['61 až 66 měs. (87 z 1146)',
                    0, 0.0873, 0.1745, 0.6108, 0.1745, 1.3962, 0.0873, 1.0471, 0.7853, 1.1344, 2.0942
                    ], 
                   ['67 až 72 měs. (89 z 1246)',
                    0, 0.0803, 0.4013, 0.8828, 0, 0.8026, 0, 2.0064, 1.4446, 0.5618, 0.9631
                    ], 
                   ['73 až 78 měs. (75 z 947)',
                    0, 0, 0.1056, 0.1056, 0, 1.3728, 0, 1.056, 2.8511, 1.2672, 1.1616
                    ], 
                   ['od 79 měs. (576 z 7751)',
                    0, 0.0774, 0.2064, 0.6322, 0.0516, 1.4708, 0.0387, 1.8965, 1.3418, 1.1224, 0.5935
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle délky úvěru',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-4-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart4);
    function drawBAR3Chart5() {
        var data = google.visualization.arrayToDataTable([
                ['Délka úvěru', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['6 až 12 měs.',
                    0, 0, 0, 0, 0.1645714285714286, 0.1975324675324676, 0, 0.1045887445887446, 0.5143549783549783, 0.7358008658008659, 1.720848484848485
                    ], 
                   ['13 až 18 měs.',
                    0, 0, 0.04125, 0.0293333333333333, 0.0293333333333333, 0.2036111111111111, 0, 0.27650290885585, 0.5512330675860087, 0.5211303598362421, 0.616005117431588
                    ], 
                   ['19 až 24 měs.',
                    0, 0, 0, 0.0819617224880383, 0, 0.1212252964426877, 0.0252173913043478, 0.4686625060675404, 0.6177090453406243, 0.7865436961970143, 0.4637915985616214
                    ], 
                   ['25 až 30 měs.',
                    0, 0, 0.0214814814814815, 0.0527428571428571, 0, 0.2316516076516076, 0, 0.3764732713008575, 0.3587641895779827, 0.4246380082242152, 1.0370946795222657
                    ], 
                   ['31 až 36 měs.',
                    0, 0, 0, 0.1287373737373737, 0, 0.1034599313821325, 0, 0.4300381423341575, 0.3923989392433416, 0.5659386984510324, 0.5585364676173499
                    ], 
                   ['37 až 42 měs.',
                    0, 0, 0, 0.1210453889401258, 0, 0.2430769230769232, 0.0258536585365854, 0.4010331938181745, 0.5048657506552243, 0.3618569229345866, 0.3496218565403418
                    ], 
                   ['43 až 48 měs.',
                    0, 0, 0.0236363636363636, 0.0870959595959596, 0.0366604995374653, 0.1837064796905222, 0, 0.2139111730214391, 0.394986308180008, 0.3027036187553742, 0.0877578481499808
                    ], 
                   ['49 až 54 měs.',
                    0, 0, 0.0355555555555556, 0.0533333333333333, 0.0177777777777778, 0.0355555555555556, 0.0177777777777778, 0.3911111111111112, 0.4088888888888889, 0.4266666666666666, 0.3733333333333333
                    ], 
                   ['55 až 60 měs.',
                    0, 0.028, 0.068, 0.15, 0, 0.15, 0, 0.176, 0.216, 0.298, 0.082
                    ], 
                   ['61 až 66 měs.',
                    0, 0.0163636363636364, 0.0309090909090909, 0.1109090909090909, 0.0309090909090909, 0.2545454545454546, 0.0163636363636364, 0.1909090909090909, 0.1436363636363636, 0.2054545454545454, 0.3799999999999999
                    ], 
                   ['67 až 72 měs.',
                    0, 0.0133333333333333, 0.0666666666666667, 0.1466666666666667, 0, 0.1333333333333334, 0, 0.335, 0.24, 0.0933333333333333, 0.16
                    ], 
                   ['73 až 78 měs.',
                    0, 0, 0.0169230769230769, 0.0169230769230769, 0, 0.2107692307692308, 0, 0.1630769230769231, 0.4384615384615385, 0.1953846153846154, 0.1784615384615384
                    ], 
                   ['od 79 měs.',
                    0, 0.0114285714285714, 0.03, 0.09, 0.0071428571428571, 0.21, 0.0057142857142857, 0.2714285714285714, 0.1914285714285714, 0.16, 0.0842857142857143
                    ]
        ]);
        var options = {
            chart: {
                title: 'Normalizovaná rizikovost podle délky úvěru',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Odhad zesplatněných ročně [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-5-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart5);
    function drawBAR3Chart6() {
        var data = google.visualization.arrayToDataTable([
                ['Má příběh?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (202 z 4486)',
                    0, 0, 0.1115, 0.156, 0.1115, 0.4904, 0.0892, 1.0923, 0.9362, 0.6242, 0.8917
                    ], 
                   ['Ano (1486 z 23356)',
                    0, 0.0428, 0.1284, 0.4367, 0.0257, 0.912, 0.0171, 1.2973, 1.2759, 1.2588, 0.9676
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle příběhu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-6-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart6);
    function drawBAR3Chart7() {
        var data = google.visualization.arrayToDataTable([
                ['Má pojištění?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (603 z 15027)',
                    0, 0.0133, 0.1131, 0.2529, 0.0732, 0.4525, 0.0532, 0.8585, 0.7853, 0.6588, 0.752
                    ], 
                   ['Ano (0 z 0)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle pojištění, od jeho zavedení',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-7-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart7);
    function drawBAR3Chart8() {
        var data = google.visualization.arrayToDataTable([
                ['Byl při originaci investorem?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (1675 z 26473)',
                    0, 0.0378, 0.1322, 0.4117, 0.0416, 0.8839, 0.0264, 1.307, 1.2805, 1.2088, 0.9972
                    ], 
                   ['Ano (13 z 1369)',
                    0, 0, 0, 0, 0, 0.073, 0.073, 0.4383, 0.073, 0.1461, 0.1461
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle statusu investora',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-8-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart8);
    function drawBAR3Chart9() {
        var data = google.visualization.arrayToDataTable([
                ['Počet předchozích půjček', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['0 (1492 z 21578)',
                    0, 0.0463, 0.1251, 0.3893, 0.0463, 0.9222, 0.0185, 1.4181, 1.3996, 1.381, 1.1679
                    ], 
                   ['1 (161 z 4568)',
                    0, 0, 0.0876, 0.4597, 0.0219, 0.7005, 0.0438, 0.7662, 0.7005, 0.4597, 0.2846
                    ], 
                   ['2 (34 z 1181)',
                    0, 0, 0.3387, 0.3387, 0, 0.3387, 0.0847, 0.9314, 0.508, 0.254, 0.0847
                    ], 
                   ['3 (1 z 352)',
                    0, 0, 0, 0, 0, 0, 0.2841, 0, 0, 0, 0
                    ], 
                   ['4 (0 z 108)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['5 (0 z 32)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['6 (0 z 12)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['7 (0 z 6)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['8 (0 z 3)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['9 (0 z 1)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['10 (0 z 1)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle počtu předchozích půjček',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-9-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart9);
    function drawLINE3Chart10() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 1.0309, 0, 1.5152, 0, 2.7027, 0, 7.5472, 0
                    ], 
                   ['2016-03',
                    0, 0, 0, 0, 0, 2.1739, 0, 1.7241, 3.8462, 20.6897, 33.3333
                    ], 
                   ['2016-04',
                    0, 0, 0, 3.9216, 0, 0, 0, 4.5455, 10.5263, 31.25, 36.3636
                    ], 
                   ['2016-05',
                    0, 0, 0, 2.8571, 0, 2.381, 0, 9.0909, 2.8571, 6.8966, 16
                    ], 
                   ['2016-06',
                    0, 0, 5, 0, 0, 2.9412, 0, 10, 4, 6.6667, 13.3333
                    ], 
                   ['2016-07',
                    0, 0, 3.8462, 2.439, 0, 8.3333, 0, 10.7143, 10.5263, 7.1429, 27.7778
                    ], 
                   ['2016-08',
                    0, 0, 0, 2.439, 0, 0, 0, 6.0606, 11.5385, 21.0526, 13.0435
                    ], 
                   ['2016-09',
                    0, 0, 0, 0, 0, 3.0303, 0, 12.1212, 0, 9.0909, 30
                    ], 
                   ['2016-10',
                    0, 0, 0, 0, 0, 3.3333, 0, 7.1429, 7.1429, 14.2857, 9.5238
                    ], 
                   ['2016-11',
                    0, 0, 0, 1.3889, 0, 3.5088, 0, 11.9048, 5, 20, 23.0769
                    ], 
                   ['2016-12',
                    0, 0, 0, 0, 0, 8, 0, 15.2174, 14.8148, 25, 26.9231
                    ], 
                   ['2017-01',
                    0, 0, 0, 1.6667, 0, 2.1277, 0, 4, 9.6774, 18.4211, 13.0435
                    ], 
                   ['2017-02',
                    0, 0, 0, 0, 0, 0, 0, 4.878, 7.6923, 13.6364, 26.3158
                    ], 
                   ['2017-03',
                    0, 0, 0, 1.3699, 0, 6.0606, 0, 3.0303, 5.4054, 12.1212, 30.4348
                    ], 
                   ['2017-04',
                    0, 0, 0, 1.8182, 0, 2, 0, 20, 42.3077, 11.1111, 25
                    ], 
                   ['2017-05',
                    0, 0, 1.6667, 6.4, 0, 10.3093, 0, 6.25, 16.0714, 16.6667, 29.4118
                    ], 
                   ['2017-06',
                    0, 2.9412, 1.4493, 2.4845, 0, 5.4545, 0, 13.8889, 25, 25, 29.6296
                    ], 
                   ['2017-07',
                    0, 2.9412, 0, 4.4586, 0, 11.6667, 0, 14.7368, 16.9492, 24.2424, 11.1111
                    ], 
                   ['2017-08',
                    0, 0, 2.2989, 3.6269, 0, 11.7647, 0, 11.9266, 13.75, 39.1304, 20
                    ], 
                   ['2017-09',
                    0, 3.0303, 1.2346, 2.439, 0, 7.5188, 0, 13.8889, 13.9241, 18.4615, 27.2727
                    ], 
                   ['2017-10',
                    0, 0, 2.0202, 1.6043, 0, 9.4444, 0, 14.6667, 17.2414, 23.6842, 25.9259
                    ], 
                   ['2017-11',
                    0, 3.0769, 0.8403, 1.2605, 0, 8.046, 0, 6.7901, 11.5702, 20.4819, 25.5319
                    ], 
                   ['2017-12',
                    0, 2.3256, 1.3333, 2.381, 0, 10.4167, 0, 13.1783, 19.1489, 19.1176, 17.6471
                    ], 
                   ['2018-01',
                    0, 3.3333, 1.1905, 2.3392, 0, 4.4444, 0, 12.3188, 15.2941, 19.6078, 20.5882
                    ], 
                   ['2018-02',
                    0, 0, 1.1364, 1.676, 0, 8.7248, 0, 11.8519, 17.0213, 14.5161, 24.2424
                    ], 
                   ['2018-03',
                    0, 2.2222, 2.0202, 3.2558, 0, 10.5263, 0, 10.7383, 17.6056, 19.5652, 21.8182
                    ], 
                   ['2018-04',
                    0, 0, 3.4483, 2.8249, 0, 6.2112, 0, 11.039, 18.6916, 22.0779, 23.5294
                    ], 
                   ['2018-05',
                    0, 0, 2.9126, 1.9512, 0, 6.8783, 0, 11.6438, 15.4472, 18.4211, 26.8293
                    ], 
                   ['2018-06',
                    0, 0, 0.8333, 2.3256, 0, 5.814, 0, 11.1111, 11.5789, 16.4384, 21.4286
                    ], 
                   ['2018-07',
                    0, 0, 0, 4.6154, 0, 5.6338, 0, 11.2903, 7.4074, 10, 14.6341
                    ], 
                   ['2018-08',
                    0, 0, 2.0202, 2.2346, 0, 4.7297, 0, 4.7244, 9.6386, 12.987, 10
                    ], 
                   ['2018-09',
                    0, 2.0833, 1.0204, 1.2195, 0, 1.626, 0, 9, 10.2941, 14.2857, 25.5319
                    ], 
                   ['2018-10',
                    0, 0, 2.2727, 1.8519, 0, 2.3392, 0, 5.625, 7.5949, 9.8765, 18.1818
                    ], 
                   ['2018-11',
                    0, 0, 2.9197, 0.4525, 0, 0.8097, 0, 4.717, 11.6279, 8.2353, 16.4557
                    ], 
                   ['2018-12',
                    0, 0, 1.3889, 2.1277, 0, 0.6061, 0, 5.0955, 4.878, 12.6984, 15.625
                    ], 
                   ['2019-01',
                    0, 0, 0, 0, 0, 2.8249, 0, 4.2683, 9.7826, 8.4746, 21.6667
                    ], 
                   ['2019-02',
                    0, 0, 0, 0, 0, 1.9608, 0, 1.7045, 11.6505, 6.4516, 14.0351
                    ], 
                   ['2019-03',
                    0, 0, 0, 1.2821, 0, 3.1579, 0, 3.125, 6.9307, 8, 14.2857
                    ], 
                   ['2019-04',
                    0, 0, 0, 0, 3.8462, 1.626, 1.9417, 4.4643, 6.0606, 5.7692, 13.8889
                    ], 
                   ['2019-05',
                    0, 4, 0, 0, 1.7094, 0, 1, 2.6316, 6.7797, 9.0909, 3.7037
                    ], 
                   ['2019-06',
                    0, 0, 0, 0, 0, 0, 2, 3.2258, 4.0816, 6.25, 6.6667
                    ], 
                   ['2019-07',
                    0, 0, 1.3158, 0, 0, 0, 1.0989, 3.9216, 3.9216, 3.8462, 0
                    ], 
                   ['2019-08',
                    0, 0, 1.3889, 1.9608, 0.9901, 3.5714, 1.5385, 7.4468, 2.2727, 2.7778, 5.8824
                    ], 
                   ['2019-09',
                    0, 0, 0, 1.4706, 3.2258, 0, 1.0417, 1.1494, 2.7778, 0, 11.1111
                    ], 
                   ['2019-10',
                    0, 0, 0, 1.8868, 3.0769, 0, 0, 0, 0, 4, 7.1429
                    ], 
                   ['2019-11',
                    0, 0, 0, 0, 0, 0, 0, 2.1277, 0, 0, 0
                    ], 
                   ['2019-12',
                    0, 0, 0, 0, 0, 2.8571, 0, 0, 0, 0, 0
                    ], 
                   ['2020-01',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2020-02',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2020-03',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2020-04',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění podle data originace a ratingu [%]',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-10-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart10);
    function drawLINE3Chart11() {
        var data = google.visualization.arrayToDataTable([
                ['Počet měsíců života půjčky', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['0',
                    0, 0.23, 0.3, 0.71, 0.22, 1.82, 0.19, 3.23, 5.34, 7.26, 9.99
                    ], 
                   ['1',
                    0, 0.23, 0.3, 0.72, 0.22, 1.84, 0.19, 3.26, 5.4, 7.33, 10.07
                    ], 
                   ['2',
                    0, 0.24, 0.32, 0.75, 0.24, 1.94, 0.21, 3.47, 5.72, 7.83, 10.62
                    ], 
                   ['3',
                    0, 0.24, 0.34, 0.79, 0.28, 2.07, 0.24, 3.73, 6.07, 8.39, 11.5
                    ], 
                   ['4',
                    0, 0.25, 0.36, 0.84, 0.32, 2.22, 0.28, 4.01, 6.44, 8.93, 12.38
                    ], 
                   ['5',
                    0, 0.27, 0.38, 0.88, 0.37, 2.37, 0.33, 4.31, 6.84, 9.58, 13.36
                    ], 
                   ['6',
                    0, 0.28, 0.41, 0.93, 0.43, 2.54, 0.38, 4.6, 7.26, 10.08, 14.32
                    ], 
                   ['7',
                    0, 0.29, 0.45, 0.98, 0.42, 2.76, 0.46, 4.98, 7.88, 10.75, 15.35
                    ], 
                   ['8',
                    0, 0.3, 0.48, 1.02, 0.41, 2.97, 0.49, 5.37, 8.51, 11.7, 16.29
                    ], 
                   ['9',
                    0, 0.32, 0.5, 1.07, 0.44, 3.13, 0.53, 5.71, 9.25, 12.6, 17.55
                    ], 
                   ['10',
                    0, 0.34, 0.53, 1.13, 0.58, 3.38, 0.6, 6.16, 9.89, 13.5, 18.71
                    ], 
                   ['11',
                    0, 0.32, 0.57, 1.21, 0.83, 3.66, 0.51, 6.63, 10.65, 14.44, 20.14
                    ], 
                   ['12',
                    0, 0.31, 0.61, 1.26, 0.87, 3.98, 0.53, 7.18, 11.3, 15.3, 21.51
                    ], 
                   ['13',
                    0, 0.33, 0.67, 1.35, 0, 4.25, 0, 7.71, 11.94, 16.38, 23.03
                    ], 
                   ['14',
                    0, 0.36, 0.73, 1.42, 0, 4.52, 0, 8.35, 12.78, 17.23, 24.06
                    ], 
                   ['15',
                    0, 0.38, 0.79, 1.54, 0, 4.9, 0, 9.1, 13.58, 18.74, 25.91
                    ], 
                   ['16',
                    0, 0.4, 0.86, 1.66, 0, 5.27, 0, 9.8, 14.35, 19.9, 27.3
                    ], 
                   ['17',
                    0, 0.42, 0.87, 1.73, 0, 5.73, 0, 10.52, 15.29, 21.27, 29.5
                    ], 
                   ['18',
                    0, 0.45, 0.81, 1.81, 0, 6.23, 0, 11.22, 15.82, 22.5, 30.42
                    ], 
                   ['19',
                    0, 0.49, 0.81, 1.91, 0, 6.85, 0, 12.28, 17.07, 23.52, 31.95
                    ], 
                   ['20',
                    0, 0.48, 0.87, 2.01, 0, 7.41, 0, 12.91, 18.15, 25.05, 33.46
                    ], 
                   ['21',
                    0, 0.46, 0.88, 2.12, 0, 7.82, 0, 13.46, 18.99, 26.06, 36.23
                    ], 
                   ['22',
                    0, 0.53, 1, 2.1, 0, 8.19, 0, 13.98, 20.08, 27.93, 38.5
                    ], 
                   ['23',
                    0, 0.65, 1.14, 2.2, 0, 8.74, 0, 14.47, 20.93, 29.34, 39.89
                    ], 
                   ['24',
                    0, 0.73, 1.11, 2.31, 0, 8.97, 0, 15.56, 22.51, 30.61, 40.52
                    ], 
                   ['25',
                    0, 0.83, 1.04, 2.46, 0, 9.35, 0, 16.39, 23.4, 31.8, 41.91
                    ], 
                   ['26',
                    0, 0.96, 1.02, 2.47, 0, 9.16, 0, 16.93, 23.25, 32.71, 45.04
                    ], 
                   ['27',
                    0, 1.15, 0.98, 2.63, 0, 9.69, 0, 17.07, 23.85, 33.2, 47.21
                    ], 
                   ['28',
                    0, 1.06, 1.11, 2.77, 0, 10.53, 0, 17.21, 24.62, 34, 48.6
                    ], 
                   ['29',
                    0, 1, 1.15, 2.88, 0, 10.51, 0, 17.56, 25.16, 34.31, 50.51
                    ], 
                   ['30',
                    0, 0.6, 1.06, 3.11, 0, 10.62, 0, 18.78, 26.5, 34.07, 49.18
                    ], 
                   ['31',
                    0, 0.76, 0.99, 3.47, 0, 10.29, 0, 18, 27.41, 33.75, 50
                    ], 
                   ['32',
                    0, 0.47, 0.97, 3.81, 0, 10.88, 0, 18.29, 28.07, 35.42, 49.66
                    ], 
                   ['33',
                    0, 0.56, 0.71, 3.47, 0, 9.82, 0, 18.9, 28.57, 35.06, 50.74
                    ], 
                   ['34',
                    0, 0, 0.86, 3.38, 0, 7.75, 0, 18.95, 29.47, 35.07, 52.38
                    ], 
                   ['35',
                    0, 0, 0.7, 3.42, 0, 7.28, 0, 17.8, 25.42, 35.36, 53.15
                    ], 
                   ['36',
                    0, 0, 0.44, 2.18, 0, 5.53, 0, 19.39, 25.83, 36.08, 54.46
                    ], 
                   ['37',
                    0, 0, 0.57, 2.48, 0, 6.19, 0, 20.39, 22.76, 39.13, 54.95
                    ], 
                   ['38',
                    0, 0, 0.65, 2.23, 0, 6.25, 0, 20.71, 23.42, 39.53, 53.66
                    ], 
                   ['39',
                    0, 0, 0.73, 2.56, 0, 7.59, 0, 21.95, 25.25, 41.74, 56.16
                    ], 
                   ['40',
                    0, 0, 0.86, 3, 0, 7.69, 0, 23.36, 25.29, 42, 59.09
                    ], 
                   ['41',
                    0, 0, 1.05, 3.47, 0, 6.6, 0, 20.93, 20.29, 41.56, 60.38
                    ], 
                   ['42',
                    0, 0, 1.22, 3.57, 0, 6.41, 0, 20.9, 22.03, 39.68, 59.09
                    ], 
                   ['43',
                    0, 0, 1.52, 3.42, 0, 6.35, 0, 20.69, 22, 42.59, 63.16
                    ], 
                   ['44',
                    0, 0, 1.92, 4.04, 0, 5.88, 0, 20.83, 28.21, 45.83, 63.64
                    ], 
                   ['45',
                    0, 0, 2.7, 3.85, 0, 6.82, 0, 21.62, 26.67, 45, 69.23
                    ], 
                   ['46',
                    0, 0, 0, 3.51, 0, 7.89, 0, 20, 22.73, 48.48, 61.9
                    ], 
                   ['47',
                    0, 0, 0, 4.65, 0, 7.14, 0, 16, 26.67, 51.72, 61.11
                    ], 
                   ['48',
                    0, 0, 0, 0, 0, 10, 0, 12.5, 40, 50, 57.14
                    ], 
                   ['49',
                    0, 0, 0, 0, 0, 22.22, 0, 15.38, 16.67, 47.06, 66.67
                    ], 
                   ['50',
                    0, 0, 0, 0, 0, 12.5, 0, 12.5, 0, 33.33, 0
                    ], 
                   ['51',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění v průběhu života půjčky, podle ratingu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z doživších se [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-11-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart11);
    function drawLINE3Chart12() {
        var data = google.visualization.arrayToDataTable([
                ['Počet měsíců života půjčky', '2016', '2017', '2018', '2019', '2020'],
                   ['0',
                    5.14, 5.37, 3.18, 0.62, 0
                    ], 
                   ['1',
                    5.22, 5.4, 3.21, 0.63, 0
                    ], 
                   ['2',
                    5.34, 5.56, 3.3, 0.65, 0
                    ], 
                   ['3',
                    5.45, 5.7, 3.4, 0.68, 0
                    ], 
                   ['4',
                    5.59, 5.85, 3.5, 0.7, 0
                    ], 
                   ['5',
                    5.71, 6.02, 3.62, 0.73, 0
                    ], 
                   ['6',
                    5.89, 6.17, 3.74, 0.82, 0
                    ], 
                   ['7',
                    6.09, 6.34, 3.88, 0.93, 0
                    ], 
                   ['8',
                    6.24, 6.5, 4.03, 1.03, 0
                    ], 
                   ['9',
                    6.45, 6.7, 4.17, 1.09, 0
                    ], 
                   ['10',
                    6.64, 6.87, 4.3, 1.25, 0
                    ], 
                   ['11',
                    6.88, 7.03, 4.44, 1.48, 0
                    ], 
                   ['12',
                    7.13, 7.23, 4.61, 1.63, 0
                    ], 
                   ['13',
                    7.38, 7.47, 4.78, 1.77, 0
                    ], 
                   ['14',
                    7.71, 7.67, 4.95, 1.79, 0
                    ], 
                   ['15',
                    8.02, 7.86, 5.14, 1.75, 0
                    ], 
                   ['16',
                    8.21, 8.06, 5.33, 0, 0
                    ], 
                   ['17',
                    8.53, 8.29, 5.37, 0, 0
                    ], 
                   ['18',
                    8.83, 8.58, 5.52, 0, 0
                    ], 
                   ['19',
                    9.09, 8.8, 6.08, 0, 0
                    ], 
                   ['20',
                    9.38, 9.07, 6.62, 0, 0
                    ], 
                   ['21',
                    9.59, 9.34, 7.04, 0, 0
                    ], 
                   ['22',
                    10.02, 9.62, 7.58, 0, 0
                    ], 
                   ['23',
                    10.4, 9.98, 8.13, 0, 0
                    ], 
                   ['24',
                    10.77, 10.38, 8.34, 0, 0
                    ], 
                   ['25',
                    11.14, 10.78, 8.19, 0, 0
                    ], 
                   ['26',
                    11.4, 11.12, 6.78, 0, 0
                    ], 
                   ['27',
                    11.57, 11.44, 5.41, 0, 0
                    ], 
                   ['28',
                    11.87, 11.83, 0, 0, 0
                    ], 
                   ['29',
                    12.54, 11.19, 0, 0, 0
                    ], 
                   ['30',
                    12.97, 11.54, 0, 0, 0
                    ], 
                   ['31',
                    13.39, 11.72, 0, 0, 0
                    ], 
                   ['32',
                    13.75, 12.37, 0, 0, 0
                    ], 
                   ['33',
                    14.21, 12, 0, 0, 0
                    ], 
                   ['34',
                    14.84, 11.85, 0, 0, 0
                    ], 
                   ['35',
                    15.28, 10.74, 0, 0, 0
                    ], 
                   ['36',
                    15.76, 10.21, 0, 0, 0
                    ], 
                   ['37',
                    16.55, 10.25, 0, 0, 0
                    ], 
                   ['38',
                    17.02, 9.17, 0, 0, 0
                    ], 
                   ['39',
                    17.85, 9.42, 0, 0, 0
                    ], 
                   ['40',
                    18.73, 0, 0, 0, 0
                    ], 
                   ['41',
                    16.15, 0, 0, 0, 0
                    ], 
                   ['42',
                    16.18, 0, 0, 0, 0
                    ], 
                   ['43',
                    17.14, 0, 0, 0, 0
                    ], 
                   ['44',
                    18.75, 0, 0, 0, 0
                    ], 
                   ['45',
                    19.47, 0, 0, 0, 0
                    ], 
                   ['46',
                    19.23, 0, 0, 0, 0
                    ], 
                   ['47',
                    20.99, 0, 0, 0, 0
                    ], 
                   ['48',
                    22.14, 0, 0, 0, 0
                    ], 
                   ['49',
                    21.25, 0, 0, 0, 0
                    ], 
                   ['50',
                    10, 0, 0, 0, 0
                    ], 
                   ['51',
                    0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění v průběhu života půjčky, podle roku originace',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z doživších se [%]'}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-12-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart12);
    function drawLINE3Chart13() {
        var data = google.visualization.arrayToDataTable([
                ['Měsíc', 'Objemem vážený průměrný úrok [% p.a.]', 'Počtem vážený průměrný úrok [% p.a.]', 'Ztraceno [% objemu]', 'S pojištěním [% všech půjček]', 'Bez příběhu [% všech půjček]'],
                   ['2016-02',
                    9.48158258028822, 9.915233644859812, 0, 0, 0.9299999999999999
                    ], 
                   ['2016-03',
                    9.507338250083809, 10.034270833333334, 0.13, 0, 0.52
                    ], 
                   ['2016-04',
                    9.397446355112478, 9.949309494451295, 0.23, 0, 0.49
                    ], 
                   ['2016-05',
                    9.31118460232555, 9.977387387387388, 0.17, 0, 0.63
                    ], 
                   ['2016-06',
                    9.207182025562384, 9.972300884955752, 0.14, 0, 0.66
                    ], 
                   ['2016-07',
                    9.127489940673367, 9.910331421287443, 0.12, 0, 0.7000000000000001
                    ], 
                   ['2016-08',
                    9.110183915529062, 9.954835164835165, 0.1, 0, 1.04
                    ], 
                   ['2016-09',
                    9.032353283960816, 9.866494023904382, 0.09, 0, 1.0999999999999999
                    ], 
                   ['2016-10',
                    9.019944356462485, 9.880848214285713, 0.08, 0, 1.16
                    ], 
                   ['2016-11',
                    9.011734147670893, 9.925717002662608, 0.07, 0, 1.1400000000000001
                    ], 
                   ['2016-12',
                    9.009857794498451, 9.986398166339228, 0.06, 0, 1.08
                    ], 
                   ['2017-01',
                    8.927109445982492, 9.953991769547324, 0.06, 0, 1
                    ], 
                   ['2017-02',
                    8.807850683572859, 9.8537339055794, 0.07, 0, 0.97
                    ], 
                   ['2017-03',
                    8.772715891923353, 9.841824457593688, 0.07, 0, 1.01
                    ], 
                   ['2017-04',
                    8.659677213284112, 9.738507119889757, 0.06, 0, 1.01
                    ], 
                   ['2017-05',
                    8.433559196771801, 9.553833992094862, 0.05, 0, 1.05
                    ], 
                   ['2017-06',
                    8.266391498913281, 9.391465386558869, 0.07, 0, 1.04
                    ], 
                   ['2017-07',
                    8.129859930687351, 9.247765346680406, 0.08, 0, 1.1199999999999999
                    ], 
                   ['2017-08',
                    8.031712420530425, 9.125138587303615, 0.09, 0, 1.34
                    ], 
                   ['2017-09',
                    7.927677087770594, 9.045549314760729, 0.09, 0, 1.46
                    ], 
                   ['2017-10',
                    7.865682451548923, 8.982567964013299, 0.09, 0, 1.6
                    ], 
                   ['2017-11',
                    7.766697189031557, 8.89723444001019, 0.1, 0, 1.73
                    ], 
                   ['2017-12',
                    7.730692240551537, 8.871466521671586, 0.1, 0, 1.83
                    ], 
                   ['2018-01',
                    7.7297335420218465, 8.850983981693364, 0.09, 0, 1.96
                    ], 
                   ['2018-02',
                    7.727861656676985, 8.835431706994578, 0.08, 0, 2.03
                    ], 
                   ['2018-03',
                    7.74065798435242, 8.846852062503741, 0.08, 0, 2.1399999999999997
                    ], 
                   ['2018-04',
                    7.7260361404793745, 8.8419092418373, 0.08, 0.7000000000000001, 2.2399999999999998
                    ], 
                   ['2018-05',
                    7.722359235000748, 8.831647034722934, 0.08, 1.83, 2.45
                    ], 
                   ['2018-06',
                    7.692501598828086, 8.802888382904037, 0.08, 2.83, 2.73
                    ], 
                   ['2018-07',
                    7.6056631510720125, 8.71870781527531, 0.07, 3.94, 2.94
                    ], 
                   ['2018-08',
                    7.57225061664269, 8.708000583892897, 0.07, 4.8500000000000005, 3.19
                    ], 
                   ['2018-09',
                    7.532511387533076, 8.687392032539778, 0.07, 5.55, 3.5999999999999996
                    ], 
                   ['2018-10',
                    7.480300610473837, 8.65316829468347, 0.06, 6.36, 5.16
                    ], 
                   ['2018-11',
                    7.469617036269997, 8.662756842797329, 0.06, 7.55, 7.88
                    ], 
                   ['2018-12',
                    7.4725531788960415, 8.678989689341188, 0.06, 8.290000000000001, 9.55
                    ], 
                   ['2019-01',
                    7.483066654953751, 8.704221910291585, 0.06, 9.13, 11.32
                    ], 
                   ['2019-02',
                    7.508923692985673, 8.740593824228029, 0.05, 10.18, 12.93
                    ], 
                   ['2019-03',
                    7.527800831451616, 8.774402340807695, 0.05, 11.34, 14.649999999999999
                    ], 
                   ['2019-04',
                    7.488827475399956, 8.72187510298237, 0.05, 12.479999999999999, 16.38
                    ], 
                   ['2019-05',
                    7.456122043199563, 8.680631921824103, 0.05, 13.96, 18.04
                    ], 
                   ['2019-06',
                    7.429856604678536, 8.64104872296653, 0.05, 15.190000000000001, 19.259999999999998
                    ], 
                   ['2019-07',
                    7.403376785244365, 8.598541264507519, 0.05, 16.38, 20.51
                    ], 
                   ['2019-08',
                    7.3786178460965886, 8.56654559945349, 0.05, 17.57, 21.57
                    ], 
                   ['2019-09',
                    7.368042483669791, 8.551435616438356, 0.05, 18.47, 22.439999999999998
                    ], 
                   ['2019-10',
                    7.3538318572496415, 8.524780307040762, 0.04, 19.49, 23.22
                    ], 
                   ['2019-11',
                    7.296185808881532, 8.467691333823408, 0.04, 20.61, 24.09
                    ], 
                   ['2019-12',
                    7.2659654709066706, 8.439652112534032, 0.04, 21.66, 24.81
                    ], 
                   ['2020-01',
                    7.251273484582808, 8.429692767060857, 0.04, 22.57, 25.590000000000003
                    ], 
                   ['2020-02',
                    7.237088870055972, 8.420333525014376, 0.04, 23.72, 26.32
                    ], 
                   ['2020-03',
                    7.224898174950519, 8.405309599563228, 0.04, 24.94, 26.99
                    ], 
                   ['2020-04',
                    7.225596529615621, 8.409518460874946, 0.04, 25.95, 27.389999999999997
                    ]
        ]);
        var options = {
            chart: {
                title: 'Souhrnné statistiky platformy',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            axes: {
                y: {
                  0: {label: ''}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-13-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart13);
    function drawLINE3Chart14() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Objemem vážený průměrný úrok [% p.a.]', 'Počtem vážený průměrný úrok [% p.a.]', 'Ztraceno [% objemu]', 'Zesplatněno [% ukončených půjček]', 'S pojištěním [% všech půjček]', 'Bez příběhu [% všech půjček]'],
                   ['2016-02',
                    9.48158258028822, 9.915233644859812, 0, 2.39, 0, 0.9299999999999999
                    ], 
                   ['2016-03',
                    9.585444120100084, 10.137368421052631, 0.26, 5.3100000000000005, 0, 0
                    ], 
                   ['2016-04',
                    9.163282829789138, 9.780794979079499, 0.45, 7.920000000000001, 0, 0.42
                    ], 
                   ['2016-05',
                    9.082614146116729, 10.0662987012987, 0, 4.91, 0, 0.97
                    ], 
                   ['2016-06',
                    8.966992604765817, 10.079694656488549, 0, 4.72, 0, 0.76
                    ], 
                   ['2016-07',
                    8.71180547954026, 9.599865470852018, 0, 8.62, 0, 0.8999999999999999
                    ], 
                   ['2016-08',
                    8.984324748836796, 10.136067415730336, 0, 6.529999999999999, 0, 3
                    ], 
                   ['2016-09',
                    8.465082508250827, 9.323333333333332, 0, 5.26, 0, 1.28
                    ], 
                   ['2016-10',
                    8.949773202873141, 10.004760147601477, 0, 4.8500000000000005, 0, 1.8499999999999999
                    ], 
                   ['2016-11',
                    8.955806209612794, 10.109385342789597, 0, 7.79, 0, 0.95
                    ], 
                   ['2016-12',
                    9.057868008424995, 10.376813186813187, 0.03, 12.07, 0, 0.66
                    ], 
                   ['2017-01',
                    8.495928138293058, 9.881414141414142, 0, 5.88, 0, 0.51
                    ], 
                   ['2017-02',
                    7.8471228266965785, 9.053157894736842, 0.14, 4.49, 0, 0.79
                    ], 
                   ['2017-03',
                    8.433172810146651, 9.7639898989899, 0.04, 6.140000000000001, 0, 1.52
                    ], 
                   ['2017-04',
                    7.745830772012294, 8.914744897959183, 0, 10.45, 0, 1.02
                    ], 
                   ['2017-05',
                    7.417096114519428, 8.667722152690864, 0, 9.04, 0, 1.25
                    ], 
                   ['2017-06',
                    7.545334066538356, 8.64524193548387, 0.15, 10.14, 0, 1.11
                    ], 
                   ['2017-07',
                    7.359513154132113, 8.423678756476683, 0.17, 9.55, 0, 1.4500000000000002
                    ], 
                   ['2017-08',
                    7.555856039762137, 8.548210251954822, 0.12, 10.040000000000001, 0, 2.69
                    ], 
                   ['2017-09',
                    7.41962586580376, 8.682682926829267, 0.06, 8.68, 0, 2.1999999999999997
                    ], 
                   ['2017-10',
                    7.5813903381431595, 8.70256868131868, 0.06, 10, 0, 2.6100000000000003
                    ], 
                   ['2017-11',
                    7.358334806304316, 8.565084364454442, 0.15, 7.33, 0, 2.42
                    ], 
                   ['2017-12',
                    7.549312861817267, 8.765260029717682, 0.09, 9.93, 0, 2.6
                    ], 
                   ['2018-01',
                    7.827964382592286, 8.753197026022304, 0, 8.1, 0, 3.2
                    ], 
                   ['2018-02',
                    7.804064544265155, 8.804121037463977, 0.01, 8.42, 0, 2.74
                    ], 
                   ['2018-03',
                    7.946755418832431, 9.061930773391023, 0.04, 10.23, 0, 3.19
                    ], 
                   ['2018-04',
                    7.750774111184185, 8.91350203606748, 0.08, 9.73, 7.39, 3.32
                    ], 
                   ['2018-05',
                    7.7679907826962555, 8.875035499726925, 0.1, 8.649999999999999, 12.559999999999999, 4.53
                    ], 
                   ['2018-06',
                    7.556124475794424, 8.690652938221998, 0.02, 7.06, 12.049999999999999, 5.42
                    ], 
                   ['2018-07',
                    6.855983288827634, 8.022366649404454, 0.01, 5.949999999999999, 15.02, 5.33
                    ], 
                   ['2018-08',
                    7.263500630472232, 8.683336831059812, 0, 5.24, 14.48, 6.09
                    ], 
                   ['2018-09',
                    7.109913487698421, 8.50935874168179, 0, 5.88, 13.91, 9.01
                    ], 
                   ['2018-10',
                    7.05173854601613, 8.41142230026339, 0.03, 4.6899999999999995, 13.780000000000001, 22.21
                    ], 
                   ['2018-11',
                    7.523809724320709, 8.942129531854981, 0, 4.54, 16.68, 32.73
                    ], 
                   ['2018-12',
                    7.860266636791396, 9.22445671121441, 0, 4.09, 17.080000000000002, 37.01
                    ], 
                   ['2019-01',
                    7.842695897037852, 9.272981853849926, 0, 4.93, 18.93, 36
                    ], 
                   ['2019-02',
                    8.071726483309671, 9.411714818266542, 0, 3.8699999999999997, 22.509999999999998, 35.410000000000004
                    ], 
                   ['2019-03',
                    7.990097559615894, 9.383808777429467, 0, 4.05, 22.3, 35.97
                    ], 
                   ['2019-04',
                    7.1895177961853385, 8.315542878174456, 0, 2.96, 23.22, 37.14
                    ], 
                   ['2019-05',
                    7.157471910748028, 8.287827610371409, 0.05, 1.97, 28.52, 38.26
                    ], 
                   ['2019-06',
                    7.247352543290043, 8.320078125, 0.01, 1.5599999999999998, 27.189999999999998, 36.17
                    ], 
                   ['2019-07',
                    7.345318743626808, 8.38932562620424, 0.01, 1.28, 26.33, 35.839999999999996
                    ], 
                   ['2019-08',
                    7.245446437408584, 8.395562742561449, 0.04, 2.88, 27.169999999999998, 35.410000000000004
                    ], 
                   ['2019-09',
                    7.445739826069647, 8.61291888062345, 0.03, 1.49, 25.259999999999998, 35.67
                    ], 
                   ['2019-10',
                    7.3117831160957865, 8.416928520877565, 0.01, 1.11, 27.46, 36.02
                    ], 
                   ['2019-11',
                    6.610016995870875, 7.891058901389808, 0, 0.29, 29.520000000000003, 37.29
                    ], 
                   ['2019-12',
                    6.9217811761701045, 8.176187587494168, 0, 0.48, 30, 41.06
                    ], 
                   ['2020-01',
                    7.1356366436108445, 8.425339805825242, 0, 0, 29.17, 39.15
                    ], 
                   ['2020-02',
                    7.211859175172073, 8.494643387815751, 0, 0, 32.95, 39.86
                    ], 
                   ['2020-03',
                    7.305667768408088, 8.552255285826156, 0, 0, 34.18, 41.78
                    ], 
                   ['2020-04',
                    7.582944136314255, 8.887240164415736, 0, 0, 34.53, 40.28
                    ]
        ]);
        var options = {
            chart: {
                title: 'Souhrnné statistiky podle data originace',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            axes: {
                y: {
                  0: {label: ''}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-14-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart14);
    function drawCOLUMN3Chart15() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 33.96, 0, 21.18, 0, 13.71, 12.46, 18.69, 0
                    ], 
                   ['2016-03',
                    0, 1.05, 6.32, 23.86, 0, 18.6, 0, 22.46, 10.53, 12.28, 4.91
                    ], 
                   ['2016-04',
                    0, 0.42, 13.81, 25.94, 0, 15.9, 0, 12.13, 17.57, 8.37, 5.86
                    ], 
                   ['2016-05',
                    0, 0.97, 11.36, 26.62, 0, 16.88, 0, 12.66, 12.34, 10.06, 9.09
                    ], 
                   ['2016-06',
                    0, 4.58, 9.92, 21.37, 0, 16.41, 0, 14.89, 13.36, 13.36, 6.11
                    ], 
                   ['2016-07',
                    0, 3.14, 15.7, 25.11, 0, 14.8, 0, 14.8, 9.87, 7.62, 8.97
                    ], 
                   ['2016-08',
                    0, 4.12, 12.36, 21.35, 0, 15.36, 0, 14.61, 13.86, 8.24, 10.11
                    ], 
                   ['2016-09',
                    0, 3.85, 12.82, 24.36, 0, 17.52, 0, 18.8, 11.11, 6.41, 5.13
                    ], 
                   ['2016-10',
                    0, 2.21, 15.5, 22.88, 0, 14.76, 0, 11.81, 14.02, 9.59, 9.23
                    ], 
                   ['2016-11',
                    0, 1.89, 9.69, 24.11, 0, 18.68, 0, 13.48, 13, 12.06, 7.09
                    ], 
                   ['2016-12',
                    0, 1.54, 9.45, 21.54, 0, 18.68, 0, 13.41, 15.16, 13.19, 7.03
                    ], 
                   ['2017-01',
                    0, 2.02, 14.65, 21.46, 0, 16.67, 0, 16.16, 10.61, 11.62, 6.82
                    ], 
                   ['2017-02',
                    0, 3.42, 13.95, 29.21, 0, 17.89, 0, 13.68, 9.21, 7.11, 5.53
                    ], 
                   ['2017-03',
                    0, 3.54, 14.39, 25.76, 0, 13.38, 0, 11.62, 12.12, 11.62, 7.58
                    ], 
                   ['2017-04',
                    0, 5.87, 15.82, 21.94, 0, 21.68, 0, 15.05, 8.93, 5.87, 4.85
                    ], 
                   ['2017-05',
                    0, 7.26, 14.02, 28.16, 0, 17.02, 0, 13.02, 9.64, 8.01, 2.88
                    ], 
                   ['2017-06',
                    0, 7.76, 12.8, 28.12, 0, 17.54, 0, 15.22, 8.87, 6.25, 3.43
                    ], 
                   ['2017-07',
                    0, 6.74, 15.44, 28.91, 0, 18.03, 0, 14.51, 7.67, 5.49, 3.21
                    ], 
                   ['2017-08',
                    0, 6.34, 13.99, 29.28, 0, 17.2, 0, 15.2, 9.56, 5.82, 2.61
                    ], 
                   ['2017-09',
                    0, 5.53, 14.15, 28.86, 0, 18.29, 0, 13.5, 9.59, 7.07, 3.01
                    ], 
                   ['2017-10',
                    0, 6.66, 12.98, 26.03, 0, 20.26, 0, 14.84, 9.62, 7.55, 2.06
                    ], 
                   ['2017-11',
                    0, 7.99, 14.9, 26.66, 0, 17.72, 0, 14.06, 9.39, 5.91, 3.37
                    ], 
                   ['2017-12',
                    0, 7.58, 13.3, 25.33, 0, 17.76, 0, 15.97, 10.77, 6.46, 2.82
                    ], 
                   ['2018-01',
                    0, 6.91, 13.23, 26.47, 0, 18.14, 0, 16.06, 10.11, 5.58, 3.49
                    ], 
                   ['2018-02',
                    0, 6.34, 13.83, 25.43, 0, 18.95, 0, 15.63, 10.37, 6.12, 3.31
                    ], 
                   ['2018-03',
                    0, 7.84, 12.11, 23.8, 0, 18.33, 0, 14.49, 11.9, 7.52, 4
                    ], 
                   ['2018-04',
                    0, 7.68, 13.32, 24.32, 0, 17.98, 0, 15.13, 11.58, 5.88, 4.13
                    ], 
                   ['2018-05',
                    0, 7.37, 13.44, 25.34, 0, 16.93, 0, 15.35, 11.03, 7.26, 3.28
                    ], 
                   ['2018-06',
                    0, 7.48, 15.72, 24.01, 0, 17.58, 0, 15.77, 10.25, 6.13, 3.06
                    ], 
                   ['2018-07',
                    0, 13.62, 18.49, 24.6, 0, 15.64, 0, 12.01, 6.73, 5.64, 3.26
                    ], 
                   ['2018-08',
                    0, 9.6, 18.1, 23.08, 0, 15.95, 0, 12.17, 8.92, 6.98, 5.19
                    ], 
                   ['2018-09',
                    0, 10.47, 17.91, 24.62, 0, 16.03, 0, 11.13, 8.71, 5.81, 5.32
                    ], 
                   ['2018-10',
                    0, 8.3, 18.61, 25.15, 0, 17.03, 0, 13.48, 7.68, 5.93, 3.82
                    ], 
                   ['2018-11',
                    0, 5.39, 16.26, 21.75, 0, 19.57, 0, 17.95, 8.98, 5.6, 4.51
                    ], 
                   ['2018-12',
                    0, 4.76, 12.49, 20.05, 0, 22.49, 0, 19.58, 10.28, 6.8, 3.54
                    ], 
                   ['2019-01',
                    0, 4.51, 14.42, 19.52, 0, 21.58, 0, 19.08, 9.51, 6.28, 5.1
                    ], 
                   ['2019-02',
                    0, 4.15, 13.42, 20.88, 0, 19.99, 0, 19.15, 9.97, 6.85, 5.59
                    ], 
                   ['2019-03',
                    0, 4.47, 13.36, 19.63, 1.18, 19.87, 1.72, 17.16, 10.07, 7.13, 5.41
                    ], 
                   ['2019-04',
                    1.66, 5.52, 15.09, 16.16, 12.73, 13.62, 11.23, 10.97, 6.48, 3.9, 2.65
                    ], 
                   ['2019-05',
                    1.86, 6.06, 14.4, 13.63, 14.19, 14.12, 12.09, 12.09, 5.47, 3.71, 2.38
                    ], 
                   ['2019-06',
                    1.09, 6.17, 12.97, 14.73, 14.49, 14.22, 12.3, 12.62, 5.78, 3.71, 1.91
                    ], 
                   ['2019-07',
                    1.22, 3.92, 13.46, 15.29, 14.48, 15.41, 12.36, 12.2, 6.13, 3.5, 2.02
                    ], 
                   ['2019-08',
                    1.55, 6.44, 13.1, 14.52, 13.42, 13.97, 11.45, 12.84, 6.11, 4.37, 2.23
                    ], 
                   ['2019-09',
                    1.17, 4.43, 13.43, 13.32, 13.74, 14.03, 12.79, 13.28, 7.16, 4.18, 2.48
                    ], 
                   ['2019-10',
                    1.63, 3.29, 15.85, 13.52, 15.5, 14.51, 10.93, 11.39, 6.65, 4.67, 2.05
                    ], 
                   ['2019-11',
                    2.08, 3.04, 23.23, 12.87, 14.16, 13.63, 10.85, 11.05, 4.7, 2.71, 1.65
                    ], 
                   ['2019-12',
                    1.49, 3.73, 19.18, 12.23, 13.39, 15.54, 12.83, 11.43, 5.23, 2.89, 2.05
                    ], 
                   ['2020-01',
                    1.4, 4.19, 15.11, 13.9, 14.6, 14.52, 12.58, 11.61, 4.82, 4.35, 2.91
                    ], 
                   ['2020-02',
                    1.89, 3.57, 16.01, 12.48, 14.08, 13.86, 13.22, 12.33, 5.01, 4.57, 2.97
                    ], 
                   ['2020-03',
                    1.61, 3.56, 16.21, 11.67, 15.51, 14.84, 11.35, 11.16, 6.15, 4.7, 3.25
                    ], 
                   ['2020-04',
                    1.41, 2.7, 14.62, 11.51, 13.8, 12.68, 12.21, 14.56, 6.81, 7.52, 2.17
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba úrokových měr v čase podle počtu úvěrů',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-15-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart15);
    function drawCOLUMN3Chart16() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 109, 0, 68, 0, 44, 40, 60, 0
                    ], 
                   ['2016-03',
                    0, 3, 18, 68, 0, 53, 0, 64, 30, 35, 14
                    ], 
                   ['2016-04',
                    0, 1, 33, 62, 0, 38, 0, 29, 42, 20, 14
                    ], 
                   ['2016-05',
                    0, 3, 35, 82, 0, 52, 0, 39, 38, 31, 28
                    ], 
                   ['2016-06',
                    0, 12, 26, 56, 0, 43, 0, 39, 35, 35, 16
                    ], 
                   ['2016-07',
                    0, 7, 35, 56, 0, 33, 0, 33, 22, 17, 20
                    ], 
                   ['2016-08',
                    0, 11, 33, 57, 0, 41, 0, 39, 37, 22, 27
                    ], 
                   ['2016-09',
                    0, 9, 30, 57, 0, 41, 0, 44, 26, 15, 12
                    ], 
                   ['2016-10',
                    0, 6, 42, 62, 0, 40, 0, 32, 38, 26, 25
                    ], 
                   ['2016-11',
                    0, 8, 41, 102, 0, 79, 0, 57, 55, 51, 30
                    ], 
                   ['2016-12',
                    0, 7, 43, 98, 0, 85, 0, 61, 69, 60, 32
                    ], 
                   ['2017-01',
                    0, 8, 58, 85, 0, 66, 0, 64, 42, 46, 27
                    ], 
                   ['2017-02',
                    0, 13, 53, 111, 0, 68, 0, 52, 35, 27, 21
                    ], 
                   ['2017-03',
                    0, 14, 57, 102, 0, 53, 0, 46, 48, 46, 30
                    ], 
                   ['2017-04',
                    0, 23, 62, 86, 0, 85, 0, 59, 35, 23, 19
                    ], 
                   ['2017-05',
                    0, 58, 112, 225, 0, 136, 0, 104, 77, 64, 23
                    ], 
                   ['2017-06',
                    0, 77, 127, 279, 0, 174, 0, 151, 88, 62, 34
                    ], 
                   ['2017-07',
                    0, 65, 149, 279, 0, 174, 0, 140, 74, 53, 31
                    ], 
                   ['2017-08',
                    0, 73, 161, 337, 0, 198, 0, 175, 110, 67, 30
                    ], 
                   ['2017-09',
                    0, 68, 174, 355, 0, 225, 0, 166, 118, 87, 37
                    ], 
                   ['2017-10',
                    0, 97, 189, 379, 0, 295, 0, 216, 140, 110, 30
                    ], 
                   ['2017-11',
                    0, 142, 265, 474, 0, 315, 0, 250, 167, 105, 60
                    ], 
                   ['2017-12',
                    0, 102, 179, 341, 0, 239, 0, 215, 145, 87, 38
                    ], 
                   ['2018-01',
                    0, 93, 178, 356, 0, 244, 0, 216, 136, 75, 47
                    ], 
                   ['2018-02',
                    0, 88, 192, 353, 0, 263, 0, 217, 144, 85, 46
                    ], 
                   ['2018-03',
                    0, 145, 224, 440, 0, 339, 0, 268, 220, 139, 74
                    ], 
                   ['2018-04',
                    0, 132, 229, 418, 0, 309, 0, 260, 199, 101, 71
                    ], 
                   ['2018-05',
                    0, 135, 246, 464, 0, 310, 0, 281, 202, 133, 60
                    ], 
                   ['2018-06',
                    0, 149, 313, 478, 0, 350, 0, 314, 204, 122, 61
                    ], 
                   ['2018-07',
                    0, 263, 357, 475, 0, 302, 0, 232, 130, 109, 63
                    ], 
                   ['2018-08',
                    0, 183, 345, 440, 0, 304, 0, 232, 170, 133, 99
                    ], 
                   ['2018-09',
                    0, 173, 296, 407, 0, 265, 0, 184, 144, 96, 88
                    ], 
                   ['2018-10',
                    0, 189, 424, 573, 0, 388, 0, 307, 175, 135, 87
                    ], 
                   ['2018-11',
                    0, 153, 462, 618, 0, 556, 0, 510, 255, 159, 128
                    ], 
                   ['2018-12',
                    0, 82, 215, 345, 0, 387, 0, 337, 177, 117, 61
                    ], 
                   ['2019-01',
                    0, 92, 294, 398, 0, 440, 0, 389, 194, 128, 104
                    ], 
                   ['2019-02',
                    0, 89, 288, 448, 0, 429, 0, 411, 214, 147, 120
                    ], 
                   ['2019-03',
                    0, 114, 341, 501, 30, 507, 44, 438, 257, 182, 138
                    ], 
                   ['2019-04',
                    45, 150, 410, 439, 346, 370, 305, 298, 176, 106, 72
                    ], 
                   ['2019-05',
                    53, 173, 411, 389, 405, 403, 345, 345, 156, 106, 68
                    ], 
                   ['2019-06',
                    28, 158, 332, 377, 371, 364, 315, 323, 148, 95, 49
                    ], 
                   ['2019-07',
                    38, 122, 419, 476, 451, 480, 385, 380, 191, 109, 63
                    ], 
                   ['2019-08',
                    48, 199, 405, 449, 415, 432, 354, 397, 189, 135, 69
                    ], 
                   ['2019-09',
                    33, 125, 379, 376, 388, 396, 361, 375, 202, 118, 70
                    ], 
                   ['2019-10',
                    46, 93, 448, 382, 438, 410, 309, 322, 188, 132, 58
                    ], 
                   ['2019-11',
                    63, 92, 702, 389, 428, 412, 328, 334, 142, 82, 50
                    ], 
                   ['2019-12',
                    32, 80, 411, 262, 287, 333, 275, 245, 112, 62, 44
                    ], 
                   ['2020-01',
                    36, 108, 389, 358, 376, 374, 324, 299, 124, 112, 75
                    ], 
                   ['2020-02',
                    51, 96, 431, 336, 379, 373, 356, 332, 135, 123, 80
                    ], 
                   ['2020-03',
                    41, 91, 414, 298, 396, 379, 290, 285, 157, 120, 83
                    ], 
                   ['2020-04',
                    24, 46, 249, 196, 235, 216, 208, 248, 116, 128, 37
                    ]
        ]);
        var options = {
            chart: {
                title: 'Počet půjček v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Počet [ks]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-16-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart16);
    function drawCOLUMN3Chart17() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 14.363000000000001, 0, 8.606999999999996, 0, 5.159999999999999, 4.072000000000001, 5.755000000000003, 0
                    ], 
                   ['2016-03',
                    0, 0.52, 2.775, 10.094999999999999, 0, 8.319999999999999, 0, 8.456, 2.8569999999999998, 3.9049999999999994, 1.44
                    ], 
                   ['2016-04',
                    0, 0.21, 4.840000000000001, 10.290000000000001, 0, 5.680000000000001, 0, 3.460000000000001, 5.574999999999998, 2.287, 1.187
                    ], 
                   ['2016-05',
                    0, 0.445, 6.425000000000001, 12.719999999999994, 0, 7.47, 0, 5.185, 3.4410000000000007, 2.96, 2.5949999999999998
                    ], 
                   ['2016-06',
                    0, 2.885, 4.0600000000000005, 10.155, 0, 6.100000000000001, 0, 4.825, 3.42, 3.8699999999999997, 1.1949999999999998
                    ], 
                   ['2016-07',
                    0, 1.4549999999999998, 6.304999999999998, 8.462000000000002, 0, 4.566999999999999, 0, 4.015000000000001, 2.886, 1.4610000000000003, 1.9100000000000001
                    ], 
                   ['2016-08',
                    0, 1.675, 5.860000000000001, 8.165000000000003, 0, 5.737, 0, 4.855999999999999, 3.895, 1.6350000000000005, 1.9199999999999997
                    ], 
                   ['2016-09',
                    0, 1.5600000000000003, 5.01, 8.361, 0, 5.5, 0, 5.1690000000000005, 2.6300000000000003, 1.15, 0.92
                    ], 
                   ['2016-10',
                    0, 1.08, 6.75, 10.029999999999998, 0, 5.198000000000003, 0, 4.03, 3.585, 2.6900000000000004, 1.9990000000000008
                    ], 
                   ['2016-11',
                    0, 1.3499999999999999, 7.975, 17.544999999999995, 0, 11.615, 0, 6.946000000000001, 6.215, 5.295, 1.7100000000000002
                    ], 
                   ['2016-12',
                    0, 2.135, 8.11, 17.139999999999997, 0, 14.17, 0, 8.275, 7.039999999999999, 4.830000000000002, 2.395
                    ], 
                   ['2017-01',
                    0, 1.92, 11.27, 15.129999999999994, 0, 9.604999999999997, 0, 7.6549999999999985, 4.169999999999999, 3.7649999999999997, 1.7300000000000002
                    ], 
                   ['2017-02',
                    0, 2.615, 9.290000000000004, 18.845, 0, 10.880000000000006, 0, 5.53, 3.185, 1.9800000000000002, 1.1650000000000003
                    ], 
                   ['2017-03',
                    0, 3.14, 9.930000000000003, 14.964999999999995, 0, 6.880000000000001, 0, 5.09, 5.425000000000001, 3.1700000000000004, 1.8600000000000003
                    ], 
                   ['2017-04',
                    0, 6.429999999999999, 10.989999999999995, 13.044999999999993, 0, 11.785000000000004, 0, 6.56, 3.6949999999999994, 1.8400000000000003, 0.9650000000000001
                    ], 
                   ['2017-05',
                    0, 13.98, 23.985, 40.21000000000002, 0, 18.579999999999995, 0, 11.364999999999997, 7.879999999999999, 5.215000000000002, 1.0350000000000001
                    ], 
                   ['2017-06',
                    0, 16.869999999999997, 22.684999999999995, 49.179999999999986, 0, 24.40999999999999, 0, 16.900000000000006, 8.815, 4.805000000000001, 1.8150000000000006
                    ], 
                   ['2017-07',
                    0, 12.584999999999999, 29.36499999999999, 46.289999999999985, 0, 23.134999999999987, 0, 16.309999999999985, 7.009999999999996, 4.1, 1.0850000000000002
                    ], 
                   ['2017-08',
                    0, 16.109999999999992, 29.480000000000004, 57.44000000000001, 0, 26.509999999999987, 0, 22.360000000000017, 10.244999999999994, 5.469999999999996, 1.3900000000000001
                    ], 
                   ['2017-09',
                    0, 15.949999999999998, 36.52, 64.545, 0, 32.800000000000004, 0, 18.79999999999999, 10.434999999999995, 6.524999999999997, 1.3900000000000003
                    ], 
                   ['2017-10',
                    0, 25.11999999999999, 40.41999999999998, 67.41, 0, 45.560000000000045, 0, 25.599999999999973, 15.04, 8.45999999999999, 1.4350000000000005
                    ], 
                   ['2017-11',
                    0, 33.12500000000001, 53.86499999999997, 85.26499999999994, 0, 42.60000000000001, 0, 30.27999999999998, 15.604999999999988, 7.714999999999998, 3.1049999999999995
                    ], 
                   ['2017-12',
                    0, 23.38, 37.21000000000001, 59.11500000000004, 0, 33.37000000000001, 0, 22.805, 14.21499999999999, 6.690000000000001, 1.8650000000000007
                    ], 
                   ['2018-01',
                    0, 22.340000000000007, 33.984999999999985, 62.66500000000001, 0, 37.695, 0, 29.829999999999995, 15.874999999999996, 6.305, 3.2799999999999994
                    ], 
                   ['2018-02',
                    0, 22.72000000000001, 41.379999999999974, 66.32, 0, 40.840000000000025, 0, 28.180000000000003, 18.624999999999996, 8.264999999999997, 2.970000000000001
                    ], 
                   ['2018-03',
                    0, 33.094999999999985, 42.17499999999999, 82.06500000000004, 0, 50.07499999999998, 0, 34.31499999999999, 23.300000000000004, 13.054999999999994, 4.729999999999997
                    ], 
                   ['2018-04',
                    0, 31.99499999999998, 44.87999999999999, 72.10999999999993, 0, 45.124999999999986, 0, 29.769999999999964, 22.334999999999983, 8.224999999999996, 4.049999999999999
                    ], 
                   ['2018-05',
                    0, 29.485000000000007, 48.209999999999994, 73.64000000000004, 0, 40.195000000000036, 0, 31.32, 20.509999999999987, 11.674999999999997, 3.1750000000000003
                    ], 
                   ['2018-06',
                    0, 32.2, 58.855, 78.8650000000001, 0, 48.79500000000004, 0, 35.00000000000003, 18.609999999999985, 9.745000000000001, 2.8849999999999993
                    ], 
                   ['2018-07',
                    0, 58.67500000000002, 66.25499999999995, 76.76499999999997, 0, 40.43499999999998, 0, 26.43999999999999, 10.339999999999993, 7.624999999999995, 3.689999999999999
                    ], 
                   ['2018-08',
                    0, 41.82500000000001, 67.36000000000003, 74.94000000000001, 0, 41.635000000000026, 0, 27.03999999999999, 14.119999999999989, 8.944999999999995, 5.669999999999994
                    ], 
                   ['2018-09',
                    0, 44.004999999999995, 62.144999999999975, 66.55499999999998, 0, 35.28499999999998, 0, 21.93999999999999, 13.159999999999995, 7.439999999999995, 4.924999999999997
                    ], 
                   ['2018-10',
                    0, 52.85500000000003, 84.62000000000003, 99.68999999999998, 0, 51.855, 0, 29.885, 16.80999999999999, 8.61999999999999, 5.324999999999997
                    ], 
                   ['2018-11',
                    0, 38.13999999999998, 93.96000000000016, 110.40500000000004, 0, 71.35000000000008, 0, 50.165000000000084, 22.92499999999999, 10.36499999999999, 6.419999999999993
                    ], 
                   ['2018-12',
                    0, 19.305, 41.65999999999999, 56.97999999999999, 0, 48.12000000000002, 0, 33.76999999999997, 13.699999999999989, 6.419999999999992, 3.195000000000001
                    ], 
                   ['2019-01',
                    0, 22.47499999999999, 57.67500000000003, 69.08500000000006, 0, 58.23, 0, 39.65000000000001, 16.319999999999983, 8.944999999999991, 4.614999999999995
                    ], 
                   ['2019-02',
                    0, 22.790000000000006, 61.74000000000003, 76.47000000000001, 0, 54.58500000000006, 0, 47.320000000000014, 22.04999999999999, 11.429999999999989, 6.484999999999992
                    ], 
                   ['2019-03',
                    0, 28.26, 71.55000000000005, 86.74499999999998, 5.39, 68.61500000000002, 5.805, 48.84000000000003, 23.385, 11.894999999999985, 8.269999999999992
                    ], 
                   ['2019-04',
                    13.014999999999997, 44.679999999999986, 81.65499999999999, 78.02999999999999, 52.735, 52.90000000000003, 37.355000000000025, 31.98499999999998, 15.584999999999985, 7.459999999999989, 3.509999999999999
                    ], 
                   ['2019-05',
                    15.310000000000002, 48.845000000000006, 86.50999999999999, 68.46000000000008, 63.73500000000007, 56.55000000000013, 43.90000000000003, 36.21000000000001, 11.709999999999992, 6.869999999999994, 3.795
                    ], 
                   ['2019-06',
                    7.565000000000002, 38.71500000000001, 69.81499999999997, 63.33999999999998, 56.12500000000006, 46.569999999999986, 34.48500000000003, 33.504999999999974, 10.739999999999984, 6.449999999999995, 2.2899999999999996
                    ], 
                   ['2019-07',
                    9.384999999999998, 29.944999999999986, 87.74, 84.925, 67.30000000000004, 62.80500000000003, 42.55000000000002, 36.420000000000016, 15.229999999999992, 6.154999999999995, 3.7499999999999982
                    ], 
                   ['2019-08',
                    13.635, 47.480000000000025, 85.55499999999999, 76.68500000000007, 64.49000000000004, 57.215000000000096, 44.48000000000002, 39.085000000000015, 13.76999999999999, 9.184999999999997, 3.0749999999999993
                    ], 
                   ['2019-09',
                    6.825000000000002, 29.43000000000001, 83.69999999999999, 67.91500000000002, 63.450000000000024, 47.26499999999999, 40.515, 35.07500000000001, 16.294999999999987, 7.274999999999997, 4.14
                    ], 
                   ['2019-10',
                    12.829999999999998, 21.999999999999996, 88.42999999999999, 62.25499999999999, 68.05500000000005, 52.085000000000036, 36.33000000000001, 28.640000000000015, 14.029999999999985, 8.179999999999993, 3.045
                    ], 
                   ['2019-11',
                    14.294999999999996, 19.785, 191.84000000000026, 58.63500000000005, 53.2450000000001, 47.90500000000006, 31.700000000000003, 24.78499999999998, 9.514999999999993, 4.804999999999999, 2.4250000000000003
                    ], 
                   ['2019-12',
                    8.045, 18.914999999999996, 103.745, 39.67999999999999, 42.58000000000002, 39.90500000000002, 26.044999999999966, 20.844999999999995, 8.279999999999996, 3.285, 1.8950000000000007
                    ], 
                   ['2020-01',
                    8.525, 33.78, 91.34999999999992, 64.09500000000001, 61.22500000000004, 53.41500000000003, 39.270000000000046, 24.794999999999973, 9.129999999999992, 7.5799999999999965, 2.9749999999999988
                    ], 
                   ['2020-02',
                    15.800000000000002, 31.43999999999999, 106.30000000000007, 66.45499999999996, 65.69000000000004, 52.420000000000066, 47.335000000000065, 36.675000000000026, 11.244999999999994, 8.149999999999995, 3.794999999999999
                    ], 
                   ['2020-03',
                    11.405, 22.664999999999996, 98.38000000000004, 54.07499999999998, 66.50500000000007, 55.170000000000016, 36.109999999999985, 29.36499999999999, 12.079999999999993, 8.059999999999992, 4.039999999999999
                    ], 
                   ['2020-04',
                    6.220000000000001, 14.155, 59.085000000000036, 37.07500000000001, 41.319999999999986, 34.260000000000005, 24.45000000000001, 24.29499999999998, 11.219999999999994, 8.399999999999993, 1.8550000000000004
                    ]
        ]);
        var options = {
            chart: {
                title: 'Objem půjček v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Objem [mio. Kč]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-17-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart17);
    function drawCOLUMN3Chart18() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Auto-moto', 'Cestování', 'Domácnost', 'Elektronika', 'Jiné', 'Refinancování půjček', 'Vlastní projekt', 'Vzdělání', 'Zdraví'],
                   ['2016-02',
                    13.08, 0.93, 7.48, 4.67, 9.03, 46.42, 13.08, 2.18, 3.12
                    ], 
                   ['2016-03',
                    18.6, 0.35, 14.39, 2.11, 14.39, 38.6, 10.18, 0.7, 0.7
                    ], 
                   ['2016-04',
                    22.59, 0.42, 10.04, 2.51, 9.21, 46.44, 5.86, 1.67, 1.26
                    ], 
                   ['2016-05',
                    21.43, 0.97, 12.66, 1.62, 11.69, 41.56, 7.79, 0.97, 1.3
                    ], 
                   ['2016-06',
                    22.14, 1.53, 17.18, 0.76, 11.83, 35.5, 8.78, 1.15, 1.15
                    ], 
                   ['2016-07',
                    24.66, 0, 16.59, 2.24, 8.07, 37.67, 8.52, 0.9, 1.35
                    ], 
                   ['2016-08',
                    18.35, 0.37, 16.1, 1.5, 11.61, 44.19, 7.12, 0.37, 0.37
                    ], 
                   ['2016-09',
                    23.08, 0.85, 13.68, 1.71, 11.54, 36.32, 8.55, 1.28, 2.99
                    ], 
                   ['2016-10',
                    23.25, 1.11, 17.71, 4.06, 8.49, 37.64, 4.8, 1.48, 1.48
                    ], 
                   ['2016-11',
                    17.26, 0.24, 14.42, 3.31, 9.46, 46.1, 8.04, 0.47, 0.71
                    ], 
                   ['2016-12',
                    15.6, 0.44, 16.04, 1.1, 12.09, 46.15, 6.59, 1.1, 0.88
                    ], 
                   ['2017-01',
                    19.95, 0.51, 19.7, 2.02, 14.39, 34.85, 6.57, 0.76, 1.26
                    ], 
                   ['2017-02',
                    20.26, 1.05, 17.37, 1.84, 8.16, 41.32, 7.37, 1.58, 1.05
                    ], 
                   ['2017-03',
                    24.24, 0.76, 21.72, 2.02, 11.11, 35.1, 3.54, 0.51, 1.01
                    ], 
                   ['2017-04',
                    21.17, 1.02, 19.13, 3.32, 10.46, 40.05, 3.32, 0.77, 0.77
                    ], 
                   ['2017-05',
                    24.66, 1, 17.4, 1.5, 10.39, 38.05, 5.13, 0.38, 1.5
                    ], 
                   ['2017-06',
                    22.38, 1.71, 20.16, 1.92, 10.38, 34.98, 4.94, 2.12, 1.41
                    ], 
                   ['2017-07',
                    21.87, 2.59, 24.66, 1.14, 13.99, 26.01, 6.63, 1.35, 1.76
                    ], 
                   ['2017-08',
                    22.76, 1.48, 21.55, 2.17, 14.25, 27.63, 7.21, 1.39, 1.56
                    ], 
                   ['2017-09',
                    22.76, 1.06, 26.02, 0.73, 14.39, 25.61, 7.15, 1.38, 0.89
                    ], 
                   ['2017-10',
                    21.98, 0.62, 25.69, 1.72, 13.39, 28.43, 5.98, 0.69, 1.51
                    ], 
                   ['2017-11',
                    20.87, 0.51, 22.38, 1.63, 19.52, 27.62, 5.01, 1.12, 1.35
                    ], 
                   ['2017-12',
                    4.09, 0.15, 4.83, 0.22, 63.67, 25.19, 1.26, 0.07, 0.52
                    ], 
                   ['2018-01',
                    14.42, 0.59, 15.09, 0.89, 38.07, 24.91, 3.94, 1.04, 1.04
                    ], 
                   ['2018-02',
                    24.35, 0.94, 24.78, 1.44, 13.4, 26.95, 6.41, 0.72, 1.01
                    ], 
                   ['2018-03',
                    25.47, 0.81, 26.07, 1.41, 13.52, 24.55, 5.52, 1.14, 1.51
                    ], 
                   ['2018-04',
                    26.35, 1.45, 25.19, 1.63, 13.21, 21.99, 7.68, 0.99, 1.51
                    ], 
                   ['2018-05',
                    25.56, 2.24, 26.6, 1.37, 13.44, 21.85, 6.83, 0.82, 1.31
                    ], 
                   ['2018-06',
                    24.06, 2.06, 26.07, 1.05, 16.17, 21.45, 5.88, 1.31, 1.96
                    ], 
                   ['2018-07',
                    25.95, 2.59, 26.83, 0.88, 14.45, 20.97, 5.49, 1.14, 1.71
                    ], 
                   ['2018-08',
                    23.71, 2.31, 25.76, 1.26, 14.85, 23.61, 5.4, 1.52, 1.57
                    ], 
                   ['2018-09',
                    21.66, 1.09, 26.56, 1.57, 16.27, 25.35, 4.48, 1.51, 1.51
                    ], 
                   ['2018-10',
                    21.73, 1.27, 24.76, 2.15, 17.43, 24.32, 5.4, 1.4, 1.54
                    ], 
                   ['2018-11',
                    20.94, 0.53, 27.63, 1.58, 19.08, 22.63, 5.28, 1.02, 1.3
                    ], 
                   ['2018-12',
                    20.16, 1.1, 27.54, 2.44, 21.73, 18.54, 6.1, 1.1, 1.28
                    ], 
                   ['2019-01',
                    22.41, 2.26, 26.48, 1.62, 18.24, 20.11, 6.03, 1.47, 1.37
                    ], 
                   ['2019-02',
                    23.67, 1.58, 26.05, 1.3, 19.06, 19.66, 5.87, 1.4, 1.4
                    ], 
                   ['2019-03',
                    25.86, 0.71, 26.1, 1.53, 19.24, 18.5, 5.8, 1.02, 1.25
                    ], 
                   ['2019-04',
                    24.29, 1.66, 24.11, 1.18, 20.65, 18.84, 6.29, 1.21, 1.77
                    ], 
                   ['2019-05',
                    22.46, 1.79, 25.79, 1.82, 19.59, 19.13, 6.34, 1.19, 1.89
                    ], 
                   ['2019-06',
                    22.66, 3.55, 27.34, 1.25, 19.88, 16.41, 5.7, 1.48, 1.72
                    ], 
                   ['2019-07',
                    24.05, 3.85, 28.07, 1.48, 15.74, 18.21, 5.36, 1.32, 1.93
                    ], 
                   ['2019-08',
                    23.97, 2.52, 28.14, 1.36, 17.08, 18.86, 4.98, 1.52, 1.58
                    ], 
                   ['2019-09',
                    24.8, 1.38, 28.69, 2.16, 15.23, 18.63, 5.6, 1.74, 1.77
                    ], 
                   ['2019-10',
                    22.26, 1.34, 31, 1.98, 14.83, 21.09, 4.6, 1.34, 1.56
                    ], 
                   ['2019-11',
                    20.58, 0.89, 29.12, 2.55, 16.15, 22.67, 4.5, 1.72, 1.82
                    ], 
                   ['2019-12',
                    21.37, 1.07, 28.04, 2.61, 16.99, 21.7, 4.76, 1.4, 2.05
                    ], 
                   ['2020-01',
                    22.72, 1.79, 26.6, 1.67, 14.33, 24.35, 5.36, 1.59, 1.59
                    ], 
                   ['2020-02',
                    21.84, 1, 25.15, 1.45, 13.26, 29.53, 4.9, 1.19, 1.67
                    ], 
                   ['2020-03',
                    20.44, 0.63, 27.49, 1.68, 15.58, 25.45, 5.95, 0.74, 2.04
                    ], 
                   ['2020-04',
                    21.9, 0.35, 28.24, 2.06, 16.79, 21.55, 5.81, 0.94, 2.35
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba účelu ǘvěrů v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-18-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart18);
    function drawCOLUMN3Chart19() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Hlavní město Praha', 'Jihomoravský kraj', 'Jihočeský kraj', 'Karlovarský kraj', 'Kraj Vysočina', 'Královéhradecký kraj', 'Liberecký kraj', 'Moravskoslezský kraj', 'Olomoucký kraj', 'Pardubický kraj', 'Plzeňský kraj', 'Středočeský kraj', 'Zlínský kraj', 'Ústecký kraj'],
                   ['2016-02',
                    29.28, 9.66, 5.3, 2.18, 2.8, 2.18, 4.36, 10.9, 3.74, 2.8, 3.12, 12.46, 4.67, 6.54
                    ], 
                   ['2016-03',
                    21.05, 10.18, 5.96, 2.46, 3.16, 5.61, 4.91, 7.37, 4.21, 4.21, 4.21, 17.54, 3.86, 5.26
                    ], 
                   ['2016-04',
                    21.34, 8.79, 5.44, 1.26, 3.35, 4.6, 6.69, 11.3, 4.18, 4.18, 7.95, 11.72, 4.18, 5.02
                    ], 
                   ['2016-05',
                    18.18, 13.31, 4.87, 0.97, 1.3, 5.52, 3.9, 13.31, 6.17, 4.55, 5.52, 11.04, 6.49, 4.87
                    ], 
                   ['2016-06',
                    15.65, 13.74, 4.58, 1.91, 2.67, 1.91, 4.96, 12.98, 4.2, 5.73, 4.96, 14.12, 4.2, 8.4
                    ], 
                   ['2016-07',
                    18.39, 5.38, 4.04, 2.69, 2.24, 4.04, 3.59, 13.9, 6.73, 2.69, 4.04, 13.9, 5.38, 13
                    ], 
                   ['2016-08',
                    16.85, 8.61, 5.62, 2.62, 4.49, 6.37, 5.99, 6.74, 6.37, 4.12, 3.37, 16.48, 3, 9.36
                    ], 
                   ['2016-09',
                    15.38, 11.11, 8.12, 1.71, 2.99, 3.85, 5.13, 9.83, 5.98, 5.13, 2.99, 17.09, 5.13, 5.56
                    ], 
                   ['2016-10',
                    15.13, 11.81, 3.69, 2.58, 2.95, 2.58, 6.64, 12.92, 6.64, 7.01, 4.06, 14.39, 4.06, 5.54
                    ], 
                   ['2016-11',
                    14.89, 8.75, 4.73, 2.84, 3.31, 4.02, 4.73, 16.08, 4.49, 6.15, 4.96, 11.58, 4.73, 8.75
                    ], 
                   ['2016-12',
                    13.85, 12.09, 4.4, 3.08, 2.64, 4.4, 4.62, 12.53, 5.93, 4.18, 4.62, 13.19, 4.18, 10.33
                    ], 
                   ['2017-01',
                    15.91, 12.63, 3.03, 2.78, 2.78, 5.81, 4.55, 12.12, 5.3, 3.79, 4.8, 13.64, 3.79, 9.09
                    ], 
                   ['2017-02',
                    13.16, 11.84, 3.95, 3.16, 4.21, 3.16, 6.32, 11.84, 3.42, 4.47, 5, 14.47, 5, 10
                    ], 
                   ['2017-03',
                    12.63, 12.63, 5.05, 2.02, 5.81, 4.55, 4.8, 11.87, 4.8, 4.8, 4.29, 13.89, 4.29, 8.59
                    ], 
                   ['2017-04',
                    19.13, 7.91, 5.1, 3.83, 3.83, 5.36, 4.85, 9.95, 5.1, 4.59, 5.87, 11.48, 3.57, 9.44
                    ], 
                   ['2017-05',
                    15.02, 10.76, 5.13, 3.25, 3, 5.01, 5.38, 12.52, 4.38, 4.38, 5.26, 12.89, 4.51, 8.51
                    ], 
                   ['2017-06',
                    16.23, 9.68, 3.83, 3.43, 3.43, 4.44, 3.93, 12.9, 5.75, 4.84, 4.33, 13.61, 4.64, 8.97
                    ], 
                   ['2017-07',
                    11.61, 10.05, 6.22, 2.9, 4.15, 4.87, 5.28, 14.2, 5.7, 4.77, 4.25, 11.71, 5.39, 8.91
                    ], 
                   ['2017-08',
                    14.07, 10.51, 4, 3.56, 3.13, 4.26, 5.04, 14.51, 5.47, 4.17, 4.78, 13.99, 4.69, 7.82
                    ], 
                   ['2017-09',
                    12.44, 9.84, 4.47, 2.93, 3.82, 4.8, 3.82, 13.25, 6.42, 5.04, 4.47, 15.04, 4.63, 9.02
                    ], 
                   ['2017-10',
                    11.68, 11.26, 5.15, 3.09, 3.91, 4.6, 3.71, 12.29, 5.01, 4.12, 5.56, 15.38, 4.95, 9.27
                    ], 
                   ['2017-11',
                    11.81, 10.01, 5.06, 2.92, 3.26, 5.91, 4.89, 13.67, 5.74, 4.84, 4.61, 13.67, 4.33, 9.28
                    ], 
                   ['2017-12',
                    11.44, 10.1, 4.16, 3.19, 4.01, 4.61, 4.01, 13.97, 5.57, 4.61, 5.5, 14.93, 5.42, 8.47
                    ], 
                   ['2018-01',
                    13.75, 10.86, 4.54, 2.01, 3.27, 4.98, 4.46, 11.08, 6.62, 4.61, 5.13, 14.57, 4.68, 9.44
                    ], 
                   ['2018-02',
                    11.38, 10.3, 4.83, 2.67, 3.6, 4.47, 5.55, 14.41, 5.62, 3.96, 5.55, 13.76, 4.68, 9.22
                    ], 
                   ['2018-03',
                    12.6, 10.44, 4.43, 2.49, 4, 3.84, 4.87, 13.52, 5.79, 5.41, 5.19, 13.79, 4.6, 9.03
                    ], 
                   ['2018-04',
                    12.33, 11.58, 4.65, 3.32, 2.79, 3.61, 5.06, 12.74, 6.34, 5.24, 4.48, 15.13, 4.13, 8.61
                    ], 
                   ['2018-05',
                    12.18, 10.81, 4.42, 3.22, 3.5, 4.7, 4.7, 13.44, 5.73, 4.86, 4.42, 14.15, 4.97, 8.9
                    ], 
                   ['2018-06',
                    12.1, 9.74, 4.52, 3.62, 3.16, 4.42, 4.32, 13.16, 5.42, 4.32, 5.52, 16.32, 3.52, 9.84
                    ], 
                   ['2018-07',
                    10.51, 8.34, 4.3, 2.43, 4.04, 4.45, 4.97, 13.15, 6.58, 3.99, 5.39, 14.91, 6.11, 10.82
                    ], 
                   ['2018-08',
                    12.49, 9.34, 4.41, 3.2, 3.83, 4.88, 5.51, 13.17, 5.14, 5.3, 4.51, 13.9, 4.2, 10.13
                    ], 
                   ['2018-09',
                    11.07, 10.28, 4.6, 2.72, 3.09, 4.66, 5.57, 13.19, 6.84, 4.72, 4.78, 15.06, 5.2, 8.23
                    ], 
                   ['2018-10',
                    12.25, 10.23, 4.3, 2.5, 3.42, 4.96, 5.53, 11.76, 6.23, 4.3, 4.52, 15.72, 5.22, 9.04
                    ], 
                   ['2018-11',
                    10.42, 10.88, 4.54, 3.38, 4.22, 4.61, 4.29, 13.2, 5.03, 4.29, 5.21, 16.05, 5.39, 8.48
                    ], 
                   ['2018-12',
                    12.26, 10.34, 6.16, 2.73, 4.94, 5.87, 4.82, 12.14, 5.69, 4.07, 5.29, 13.65, 4.42, 7.61
                    ], 
                   ['2019-01',
                    11.18, 10.54, 5.79, 2.4, 3.43, 4.61, 4.76, 11.38, 6.57, 4.81, 4.76, 15.6, 4.76, 9.42
                    ], 
                   ['2019-02',
                    11.98, 10.25, 4.43, 2.94, 3.36, 3.87, 4.15, 12.4, 6.01, 4.52, 5.64, 16.12, 4.85, 9.51
                    ], 
                   ['2019-03',
                    11.56, 10.93, 5.37, 3.33, 3.88, 4.66, 4.74, 12.3, 5.53, 4.19, 4.23, 15.13, 4.78, 9.37
                    ], 
                   ['2019-04',
                    11.74, 9.39, 4.97, 3.42, 4.34, 4.49, 5.37, 12.59, 4.64, 4.45, 5.15, 14.91, 4.86, 9.68
                    ], 
                   ['2019-05',
                    11.42, 9.6, 5.26, 3.08, 4.06, 4.31, 5.4, 11.49, 6.24, 4.38, 5.96, 14.65, 4.56, 9.6
                    ], 
                   ['2019-06',
                    10.78, 10.27, 4.18, 3.4, 3.71, 4.8, 5.39, 13.2, 5.47, 4.73, 4.92, 14.57, 4.84, 9.73
                    ], 
                   ['2019-07',
                    9.41, 9.96, 5.14, 3.6, 3.69, 5.07, 5.2, 12.17, 6.65, 4.56, 5.62, 14.55, 5.39, 8.99
                    ], 
                   ['2019-08',
                    9.64, 9.18, 5.4, 3.14, 4.27, 4.27, 5.14, 12.42, 6.05, 4.3, 5.79, 16.14, 4.33, 9.93
                    ], 
                   ['2019-09',
                    10.95, 10.02, 4.39, 3.4, 3.9, 3.75, 4.5, 12.26, 6.23, 4.61, 5.6, 15.37, 4.75, 10.27
                    ], 
                   ['2019-10',
                    9.09, 9.52, 4.99, 3.43, 4.03, 4.78, 4.78, 12.99, 6.65, 4.81, 4.95, 15.39, 5.7, 8.88
                    ], 
                   ['2019-11',
                    10.92, 10.19, 5.2, 3.08, 4.2, 5.03, 4.67, 12.87, 5.82, 4.04, 5.39, 14.92, 4.86, 8.8
                    ], 
                   ['2019-12',
                    10.97, 9.33, 4.57, 2.61, 4.85, 5.23, 5.32, 11.71, 5.69, 4.06, 5.27, 16.29, 4.43, 9.66
                    ], 
                   ['2020-01',
                    9.9, 10.91, 5.55, 3.03, 5.05, 5.59, 3.53, 12.62, 5.83, 4.43, 4.78, 14.37, 5.13, 9.28
                    ], 
                   ['2020-02',
                    9.84, 9.92, 5.91, 2.97, 3.86, 4.83, 4.94, 11.52, 6.24, 4.79, 5.24, 15.16, 5.2, 9.58
                    ], 
                   ['2020-03',
                    9.67, 10.73, 4.89, 3.17, 4.35, 5.09, 3.99, 11.63, 6.5, 5.29, 5.52, 15.15, 4.58, 9.44
                    ], 
                   ['2020-04',
                    11.8, 9.86, 4.82, 2.88, 4.23, 4.76, 4.29, 10.8, 6.52, 4.93, 4.35, 14.86, 4.82, 11.1
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba krajů v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-19-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart19);
    function drawCOLUMN3Chart20() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Důchod', 'Jiné', 'Nezaměstnaný', 'OSVČ', 'Podnikatel', 'Rodičovská dovolená', 'Student', 'Svobodné povolání', 'Zaměstnanec'],
                   ['2016-02',
                    1.56, 1.87, 0, 33.96, 7.79, 0.31, 0.62, 0.62, 53.27
                    ], 
                   ['2016-03',
                    0.7, 2.11, 0, 25.26, 5.26, 2.11, 0, 1.05, 63.51
                    ], 
                   ['2016-04',
                    2.51, 1.26, 0, 13.39, 4.6, 0.42, 0.84, 0.42, 76.57
                    ], 
                   ['2016-05',
                    3.25, 0.97, 0, 17.21, 3.9, 1.62, 0.32, 1.62, 71.1
                    ], 
                   ['2016-06',
                    1.91, 0.38, 0, 17.94, 5.73, 2.29, 0.76, 1.15, 69.85
                    ], 
                   ['2016-07',
                    3.14, 1.35, 0, 17.04, 6.73, 0.9, 0.45, 0.45, 69.96
                    ], 
                   ['2016-08',
                    3.75, 0.37, 0, 15.73, 4.49, 0.75, 0, 0.75, 74.16
                    ], 
                   ['2016-09',
                    2.14, 0.85, 0, 15.81, 3.42, 1.28, 0, 0.43, 76.07
                    ], 
                   ['2016-10',
                    3.32, 1.11, 0, 14.76, 3.32, 2.21, 1.48, 0.37, 73.43
                    ], 
                   ['2016-11',
                    4.26, 1.18, 0, 18.68, 3.55, 2.13, 0.24, 0.24, 69.74
                    ], 
                   ['2016-12',
                    5.05, 1.1, 0, 17.14, 4.4, 1.32, 0.22, 0, 70.77
                    ], 
                   ['2017-01',
                    3.28, 2.02, 0, 16.92, 2.02, 1.77, 0.25, 0.25, 73.48
                    ], 
                   ['2017-02',
                    5, 0.26, 0, 12.63, 2.37, 2.63, 0.53, 0.79, 75.79
                    ], 
                   ['2017-03',
                    3.79, 1.01, 0, 11.62, 1.52, 2.02, 0, 0, 80.05
                    ], 
                   ['2017-04',
                    5.36, 1.02, 0, 12.5, 2.81, 0.51, 0.26, 0, 77.55
                    ], 
                   ['2017-05',
                    3.75, 0.63, 0, 11.76, 2.13, 1.5, 0.38, 0.25, 79.6
                    ], 
                   ['2017-06',
                    3.83, 0.91, 0, 12.6, 2.22, 1.81, 0.5, 0.2, 77.92
                    ], 
                   ['2017-07',
                    4.35, 0.52, 0, 10.67, 2.69, 1.45, 0.1, 0.62, 79.59
                    ], 
                   ['2017-08',
                    4, 1.22, 0, 12.86, 2.35, 1.48, 0.26, 0.43, 77.41
                    ], 
                   ['2017-09',
                    3.5, 0.73, 0, 12.2, 2.2, 0.89, 0.33, 0.33, 79.84
                    ], 
                   ['2017-10',
                    6.11, 0.82, 0, 12.71, 1.79, 1.1, 0.48, 0.48, 76.51
                    ], 
                   ['2017-11',
                    5.79, 1.24, 0, 10.74, 1.91, 1.41, 0.28, 0.39, 78.23
                    ], 
                   ['2017-12',
                    7.8, 1.26, 0, 11.66, 1.56, 2.08, 0.22, 0.59, 74.81
                    ], 
                   ['2018-01',
                    5.43, 0.37, 0.22, 13.68, 1.86, 2.68, 0.3, 0.3, 75.17
                    ], 
                   ['2018-02',
                    5.26, 0.86, 0, 13.18, 1.37, 3.24, 0.29, 0.22, 75.58
                    ], 
                   ['2018-03',
                    4.38, 0.65, 0.05, 12.6, 1.78, 3.79, 0.49, 0.22, 76.04
                    ], 
                   ['2018-04',
                    4.71, 1.75, 0, 12.86, 2.27, 2.91, 0.52, 0.41, 74.58
                    ], 
                   ['2018-05',
                    4.53, 0.49, 0, 10.6, 1.26, 2.84, 0.38, 0.44, 79.46
                    ], 
                   ['2018-06',
                    4.12, 0.3, 0, 10.85, 1.56, 4.72, 0.05, 0.5, 77.9
                    ], 
                   ['2018-07',
                    4.97, 0.73, 0, 10.46, 1.66, 2.64, 0.16, 0.36, 79.03
                    ], 
                   ['2018-08',
                    5.61, 0.42, 0.05, 11.44, 1.36, 3.78, 0.31, 0.16, 76.86
                    ], 
                   ['2018-09',
                    5.32, 0.85, 0, 10.53, 1.21, 2.36, 0.24, 0.06, 79.43
                    ], 
                   ['2018-10',
                    5.88, 0.7, 0, 11.24, 1.05, 2.63, 0.35, 0.22, 77.92
                    ], 
                   ['2018-11',
                    5.98, 0.67, 0, 10.91, 1.27, 3.59, 0.28, 0.11, 77.19
                    ], 
                   ['2018-12',
                    4.76, 0.41, 0.06, 12.09, 1.92, 2.85, 0.17, 0.17, 77.57
                    ], 
                   ['2019-01',
                    4.07, 0.69, 0, 10.69, 1.37, 2.65, 0.1, 0.25, 80.19
                    ], 
                   ['2019-02',
                    5.55, 0.65, 0, 11.32, 1.35, 3.12, 0.42, 0.19, 77.4
                    ], 
                   ['2019-03',
                    5.53, 0.74, 0.04, 10.54, 1.1, 3.53, 0.12, 0.24, 78.17
                    ], 
                   ['2019-04',
                    5.67, 0.55, 0, 11.12, 1.18, 2.69, 0.18, 0.33, 78.28
                    ], 
                   ['2019-05',
                    5.33, 0.46, 0, 9.64, 1.26, 3.19, 0.04, 0.28, 79.82
                    ], 
                   ['2019-06',
                    5.35, 0.74, 0, 8.79, 1.05, 3.01, 0.16, 0.12, 80.78
                    ], 
                   ['2019-07',
                    4.88, 0.64, 0, 9.18, 1.38, 2.28, 0.13, 0.26, 81.25
                    ], 
                   ['2019-08',
                    5.56, 0.55, 0, 8.93, 0.94, 3.1, 0.1, 0.03, 80.79
                    ], 
                   ['2019-09',
                    5.35, 0.6, 0.07, 9.07, 1.13, 2.73, 0.35, 0.25, 80.45
                    ], 
                   ['2019-10',
                    5.66, 0.35, 0, 8.39, 0.81, 2.87, 0.39, 0.11, 81.42
                    ], 
                   ['2019-11',
                    5.56, 0.83, 0.07, 9.73, 1.26, 2.51, 0.1, 0.3, 79.65
                    ], 
                   ['2019-12',
                    5.74, 0.47, 0.05, 10.31, 0.93, 2.24, 0.23, 0.14, 79.89
                    ], 
                   ['2020-01',
                    3.92, 0.89, 0, 10.49, 1.28, 3.18, 0.23, 0.19, 79.81
                    ], 
                   ['2020-02',
                    4.12, 0.82, 0, 11.33, 0.85, 3.53, 0.26, 0.19, 78.9
                    ], 
                   ['2020-03',
                    5.79, 0.78, 0, 10.34, 1.41, 3.64, 0.12, 0.2, 77.72
                    ], 
                   ['2020-04',
                    5.87, 1, 0, 8.57, 1.29, 3.93, 0.06, 0.29, 78.98
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba zdrojů příjmu v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-20-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart20);
    function drawCOLUMN3Chart21() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'do 50 000,- Kč', '50 001,- až 100 000,- Kč', '100 001,- až 150 000,- Kč', '150 001,- až 200 000,- Kč', '200 001,- až 250 000,- Kč', '250 001,- až 300 000,- Kč', '300 001,- až 350 000,- Kč', '350 001,- až 400 000,- Kč', '400 001,- až 450 000,- Kč', '450 001,- až 500 000,- Kč', '500 001,- až 550 000,- Kč', '550 001,- až 600 000,- Kč', '600 001,- až 650 000,- Kč', '650 001,- až 700 000,- Kč', 'od 700 001,- Kč'],
                   ['2016-02',
                    26.79, 23.36, 15.26, 26.79, 5.3, 2.49, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-03',
                    21.75, 23.86, 20, 15.44, 7.72, 11.23, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-04',
                    17.57, 25.94, 20.5, 14.23, 9.62, 12.13, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-05',
                    22.73, 24.35, 17.53, 16.23, 7.79, 11.36, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-06',
                    22.9, 19.85, 18.32, 15.27, 10.69, 12.98, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-07',
                    18.39, 24.66, 17.49, 20.63, 8.07, 10.76, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-08',
                    25.09, 26.59, 15.36, 15.73, 8.61, 8.61, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-09',
                    24.79, 26.5, 14.53, 16.67, 7.69, 9.83, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-10',
                    25.46, 20.3, 20.66, 17.34, 6.27, 9.23, 0, 0.74, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-11',
                    19.15, 29.31, 15.84, 15.84, 7.57, 8.51, 1.42, 1.18, 0.24, 0.95, 0, 0, 0, 0, 0
                    ], 
                   ['2016-12',
                    24.4, 24.18, 14.51, 15.38, 6.81, 10.11, 1.54, 1.32, 0.44, 1.32, 0, 0, 0, 0, 0
                    ], 
                   ['2017-01',
                    20.96, 26.01, 15.91, 15.91, 7.83, 10.1, 1.01, 0.51, 0.76, 1.01, 0, 0, 0, 0, 0
                    ], 
                   ['2017-02',
                    20.79, 25.53, 16.32, 16.58, 8.42, 8.42, 1.32, 1.05, 0.53, 1.05, 0, 0, 0, 0, 0
                    ], 
                   ['2017-03',
                    23.99, 27.53, 17.93, 15.66, 4.8, 7.07, 1.52, 1.01, 0, 0.51, 0, 0, 0, 0, 0
                    ], 
                   ['2017-04',
                    24.23, 21.17, 19.13, 13.01, 8.42, 9.18, 1.28, 1.28, 1.02, 1.28, 0, 0, 0, 0, 0
                    ], 
                   ['2017-05',
                    22.78, 22.9, 14.77, 14.27, 7.51, 9.39, 2.63, 1.75, 1, 3, 0, 0, 0, 0, 0
                    ], 
                   ['2017-06',
                    23.89, 24.29, 14.62, 15.12, 6.65, 7.06, 2.62, 2.02, 1.01, 2.72, 0, 0, 0, 0, 0
                    ], 
                   ['2017-07',
                    26.11, 22.49, 15.03, 13.37, 7.25, 7.15, 2.28, 2.9, 1.14, 2.28, 0, 0, 0, 0, 0
                    ], 
                   ['2017-08',
                    25.37, 23.37, 15.38, 12.86, 7.12, 6.52, 3.13, 2.17, 1.04, 3.04, 0, 0, 0, 0, 0
                    ], 
                   ['2017-09',
                    26.34, 22.68, 13.33, 13.25, 6.91, 6.26, 2.76, 2.93, 2.03, 3.5, 0, 0, 0, 0, 0
                    ], 
                   ['2017-10',
                    26.03, 20.47, 13.12, 14.15, 8.04, 6.18, 3.23, 2.61, 1.44, 4.74, 0, 0, 0, 0, 0
                    ], 
                   ['2017-11',
                    27.39, 21.26, 13.95, 12.15, 7.03, 6.13, 3.71, 2.81, 1.35, 4.22, 0, 0, 0, 0, 0
                    ], 
                   ['2017-12',
                    26.82, 24.59, 12.63, 12.11, 6.09, 7.13, 3.27, 2.23, 1.93, 3.19, 0, 0, 0, 0, 0
                    ], 
                   ['2018-01',
                    25.5, 21.19, 14.42, 12.34, 6.47, 6.99, 4.39, 2.6, 1.78, 4.31, 0, 0, 0, 0, 0
                    ], 
                   ['2018-02',
                    22.98, 22.55, 13.9, 11.74, 6.7, 7.56, 3.39, 3.53, 2.31, 5.33, 0, 0, 0, 0, 0
                    ], 
                   ['2018-03',
                    24.82, 22.55, 14.76, 14.12, 6.33, 5.68, 2.97, 3.3, 1.73, 3.73, 0, 0, 0, 0, 0
                    ], 
                   ['2018-04',
                    26.47, 20.94, 15.13, 13.15, 7.1, 6.17, 2.97, 2.97, 1.4, 3.72, 0, 0, 0, 0, 0
                    ], 
                   ['2018-05',
                    27.36, 24.69, 14.15, 12.45, 5.9, 6.12, 2.84, 3, 0.98, 2.51, 0, 0, 0, 0, 0
                    ], 
                   ['2018-06',
                    28.33, 22.8, 14.47, 11.3, 7.13, 6.58, 3.01, 2.91, 1.05, 2.41, 0, 0, 0, 0, 0
                    ], 
                   ['2018-07',
                    25.38, 24.24, 13.15, 13.36, 6.89, 6.11, 3, 3.26, 0.93, 3.68, 0, 0, 0, 0, 0
                    ], 
                   ['2018-08',
                    28.38, 22.67, 13.12, 12.01, 6.77, 6.35, 3.04, 3.25, 1.1, 2.41, 0.26, 0.37, 0, 0.1, 0.16
                    ], 
                   ['2018-09',
                    27.59, 22.5, 13.07, 11.74, 6.05, 7.2, 3.02, 3.09, 1.27, 3.02, 0.42, 0.6, 0.12, 0.06, 0.24
                    ], 
                   ['2018-10',
                    29.5, 22.7, 11.81, 10.54, 6.89, 5.79, 3.29, 3.56, 1.49, 2.41, 0.53, 0.57, 0.18, 0.18, 0.57
                    ], 
                   ['2018-11',
                    33.02, 21.54, 12.71, 10.77, 5.39, 5.32, 3.31, 3.45, 1.23, 1.76, 0.18, 0.32, 0.46, 0.07, 0.49
                    ], 
                   ['2018-12',
                    36.9, 22.08, 11.85, 9.59, 5.64, 5.17, 2.38, 2.21, 1.05, 1.98, 0.17, 0.41, 0.23, 0.12, 0.23
                    ], 
                   ['2019-01',
                    32.07, 24.42, 12.51, 11.53, 5.1, 5.39, 2.89, 2.16, 0.98, 1.72, 0.15, 0.39, 0.05, 0.2, 0.44
                    ], 
                   ['2019-02',
                    30.71, 24.74, 12.26, 11.7, 5.68, 5.17, 2.14, 2.98, 0.93, 1.96, 0.47, 0.51, 0.19, 0.28, 0.28
                    ], 
                   ['2019-03',
                    31.19, 23.35, 12.23, 12.23, 5.76, 5.05, 2.98, 2.78, 1.49, 1.57, 0.2, 0.39, 0.16, 0.31, 0.31
                    ], 
                   ['2019-04',
                    29.78, 20.79, 13.69, 11.26, 6.4, 5.93, 2.8, 2.91, 1.47, 2.17, 0.66, 0.74, 0.37, 0.37, 0.66
                    ], 
                   ['2019-05',
                    29.99, 21.51, 12.47, 11.81, 5.68, 5.22, 3.43, 3.05, 1.23, 2.45, 0.74, 0.88, 0.42, 0.46, 0.67
                    ], 
                   ['2019-06',
                    33.24, 22.7, 11.17, 10.35, 5.78, 5.55, 2.93, 2.58, 1.25, 1.68, 0.82, 0.51, 0.47, 0.51, 0.47
                    ], 
                   ['2019-07',
                    32.85, 21.58, 13.26, 10.34, 5.72, 5.68, 2.95, 2.06, 1.22, 1.7, 0.45, 1, 0.42, 0.39, 0.39
                    ], 
                   ['2019-08',
                    31.89, 21.41, 12.39, 11.64, 5.5, 5.66, 3.14, 2.78, 1.42, 1.62, 0.81, 0.78, 0.13, 0.45, 0.39
                    ], 
                   ['2019-09',
                    32.48, 23.38, 12.86, 10.02, 4.99, 5.42, 2.69, 2.76, 1.03, 1.81, 0.35, 0.78, 0.28, 0.46, 0.67
                    ], 
                   ['2019-10',
                    32.27, 23.18, 12.21, 11.22, 6.55, 4.95, 2.41, 2.58, 0.92, 1.7, 0.46, 0.35, 0.28, 0.25, 0.67
                    ], 
                   ['2019-11',
                    33.12, 20.28, 11.45, 10.23, 4.9, 7.15, 3.54, 3.01, 1.65, 1.72, 0.53, 0.93, 0.4, 0.3, 0.79
                    ], 
                   ['2019-12',
                    35.18, 21.37, 10.55, 10.13, 5.41, 4.81, 3.03, 2.57, 1.35, 2.05, 0.98, 0.89, 0.79, 0.28, 0.61
                    ], 
                   ['2020-01',
                    28.78, 22.72, 12.97, 11.69, 5.63, 5.48, 2.8, 3.34, 1.67, 1.86, 0.7, 1.13, 0.31, 0.27, 0.66
                    ], 
                   ['2020-02',
                    27.53, 20.88, 12.78, 11.07, 6.72, 6.35, 3.05, 3.6, 2.23, 2.01, 0.97, 1, 0.33, 0.37, 1.11
                    ], 
                   ['2020-03',
                    29.56, 21.34, 12.22, 11.9, 6.58, 5.25, 3.37, 3.41, 1.72, 1.57, 1.06, 0.63, 0.31, 0.35, 0.74
                    ], 
                   ['2020-04',
                    28.13, 21.79, 15.21, 10.75, 5.87, 5.58, 3.29, 2.58, 2, 2.17, 0.53, 1.17, 0.47, 0.12, 0.35
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba výší úvěru v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-21-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart21);
    function drawCOLUMN3Chart22() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '6 až 12 měs.', '13 až 18 měs.', '19 až 24 měs.', '25 až 30 měs.', '31 až 36 měs.', '37 až 42 měs.', '43 až 48 měs.', '49 až 54 měs.', '55 až 60 měs.', '61 až 66 měs.', '67 až 72 měs.', '73 až 78 měs.', 'od 79 měs.'],
                   ['2016-02',
                    9.3458, 8.4112, 11.5265, 9.6573, 9.9688, 5.6075, 11.215, 3.7383, 6.2305, 5.919, 4.6729, 2.1807, 11.5265
                    ], 
                   ['2016-03',
                    3.1579, 2.807, 8.0702, 7.0175, 12.9825, 7.7193, 11.2281, 5.614, 6.6667, 4.5614, 5.9649, 3.1579, 21.0526
                    ], 
                   ['2016-04',
                    2.5105, 2.5105, 10.4603, 5.4393, 9.205, 8.7866, 10.4603, 7.9498, 8.3682, 10.0418, 6.6946, 2.0921, 15.4812
                    ], 
                   ['2016-05',
                    3.5714, 3.2468, 9.7403, 7.7922, 10.0649, 7.4675, 10.7143, 3.8961, 9.7403, 4.2208, 4.8701, 3.8961, 20.7792
                    ], 
                   ['2016-06',
                    1.145, 6.1069, 8.7786, 6.1069, 6.8702, 4.9618, 10.3053, 8.3969, 6.8702, 4.5802, 9.9237, 4.9618, 20.9924
                    ], 
                   ['2016-07',
                    3.139, 3.5874, 5.3812, 7.6233, 8.0717, 6.278, 10.3139, 7.6233, 12.5561, 6.278, 8.9686, 4.0359, 16.1435
                    ], 
                   ['2016-08',
                    2.2472, 2.9963, 7.1161, 7.4906, 8.6142, 8.6142, 9.3633, 7.4906, 10.1124, 2.9963, 6.367, 3.7453, 22.8464
                    ], 
                   ['2016-09',
                    2.5641, 4.7009, 8.9744, 5.5556, 4.2735, 4.2735, 11.1111, 8.1197, 8.1197, 4.2735, 11.9658, 3.4188, 22.6496
                    ], 
                   ['2016-10',
                    2.952, 3.69, 7.7491, 4.428, 7.0111, 6.2731, 11.8081, 7.7491, 10.7011, 5.1661, 8.1181, 5.9041, 18.4502
                    ], 
                   ['2016-11',
                    1.182, 3.3097, 6.8558, 5.4374, 7.3286, 6.383, 11.3475, 4.7281, 8.5106, 3.7825, 6.8558, 7.3286, 26.9504
                    ], 
                   ['2016-12',
                    2.1978, 3.0769, 6.8132, 4.3956, 7.033, 5.2747, 9.8901, 7.4725, 7.4725, 4.3956, 4.1758, 6.3736, 31.4286
                    ], 
                   ['2017-01',
                    3.2828, 3.5354, 5.303, 5.5556, 9.3434, 3.7879, 10.3535, 8.5859, 7.5758, 4.5455, 8.3333, 6.5657, 23.2323
                    ], 
                   ['2017-02',
                    1.3158, 3.9474, 5.2632, 5.2632, 6.5789, 6.0526, 12.8947, 7.3684, 8.9474, 7.6316, 6.8421, 5.5263, 22.3684
                    ], 
                   ['2017-03',
                    4.0404, 4.798, 6.8182, 4.798, 5.303, 5.8081, 11.8687, 7.0707, 10.8586, 4.798, 6.5657, 3.7879, 23.4848
                    ], 
                   ['2017-04',
                    2.551, 3.0612, 6.3776, 7.1429, 7.9082, 6.1224, 7.9082, 6.6327, 7.9082, 8.6735, 5.3571, 4.5918, 25.7653
                    ], 
                   ['2017-05',
                    2.5031, 2.8786, 6.1327, 5.0063, 5.8824, 4.7559, 9.5119, 5.5069, 7.5094, 5.8824, 6.8836, 5.1314, 32.4155
                    ], 
                   ['2017-06',
                    2.3185, 2.4194, 7.0565, 5.3427, 5.746, 6.0484, 9.0726, 6.3508, 8.4677, 4.9395, 6.8548, 3.8306, 31.5524
                    ], 
                   ['2017-07',
                    1.9689, 4.2487, 6.5285, 6.2176, 4.9741, 4.8705, 10.8808, 6.4249, 8.1865, 4.9741, 5.8031, 4.9741, 29.9482
                    ], 
                   ['2017-08',
                    2.2589, 3.649, 7.5586, 5.7341, 5.6473, 6.603, 9.5569, 4.344, 7.1242, 4.2572, 6.8636, 3.3884, 33.0148
                    ], 
                   ['2017-09',
                    3.5772, 3.4959, 6.0163, 4.3902, 6.1789, 6.3415, 10.0813, 5.935, 6.748, 5.7724, 6.6667, 3.9024, 30.8943
                    ], 
                   ['2017-10',
                    2.3352, 3.0907, 6.9368, 5.3571, 6.3874, 4.6016, 9.1346, 5.7005, 6.7308, 5.5632, 5.1511, 5.2885, 33.7225
                    ], 
                   ['2017-11',
                    2.9809, 3.4308, 6.2992, 5.793, 5.0056, 5.1744, 11.3048, 4.8931, 6.8616, 5.5681, 6.3555, 4.4432, 31.8898
                    ], 
                   ['2017-12',
                    3.8633, 3.4918, 7.1322, 5.052, 5.2749, 6.5379, 10.847, 6.5379, 5.3492, 5.1263, 6.0178, 4.4577, 30.312
                    ], 
                   ['2018-01',
                    3.5688, 3.9405, 5.0558, 5.7993, 5.8736, 5.2045, 9.145, 5.1301, 6.9888, 6.0967, 6.0223, 3.7918, 33.3829
                    ], 
                   ['2018-02',
                    3.3141, 3.6023, 5.7637, 4.9712, 4.611, 4.683, 10.6628, 5.5476, 6.7003, 5.5476, 5.4755, 4.8991, 34.2219
                    ], 
                   ['2018-03',
                    2.8664, 4.0022, 5.4624, 5.192, 5.4083, 5.3002, 8.6533, 4.8134, 7.8421, 5.2461, 5.7328, 4.7052, 34.7756
                    ], 
                   ['2018-04',
                    3.1414, 3.6067, 6.1082, 3.8394, 4.7702, 6.05, 10.0058, 5.8755, 7.2717, 5.2356, 5.4101, 5.0611, 33.6242
                    ], 
                   ['2018-05',
                    2.3484, 3.823, 6.6084, 4.97, 6.0076, 5.3523, 10.1038, 5.7892, 6.9907, 4.5877, 5.953, 4.0961, 33.3697
                    ], 
                   ['2018-06',
                    2.5615, 3.3149, 6.6298, 4.7715, 6.6298, 5.3742, 10.3466, 4.3697, 6.2783, 4.7715, 5.8764, 4.5203, 34.5555
                    ], 
                   ['2018-07',
                    3.1072, 3.0554, 6.4733, 4.8679, 5.2305, 4.9715, 9.7359, 4.609, 8.2341, 4.8162, 5.1787, 4.0911, 35.6292
                    ], 
                   ['2018-08',
                    3.3578, 4.1448, 6.6107, 4.6695, 5.2466, 5.9286, 9.6013, 5.1941, 6.978, 5.0367, 5.5089, 4.5645, 33.1584
                    ], 
                   ['2018-09',
                    3.2668, 3.9927, 6.2916, 5.1422, 5.3842, 4.5372, 9.3769, 4.9607, 6.8966, 6.1101, 5.4446, 3.9927, 34.6038
                    ], 
                   ['2018-10',
                    4.2581, 3.2046, 6.5408, 6.0579, 4.5654, 5.3117, 10.1844, 4.5215, 7.0676, 4.4776, 6.453, 4.0825, 33.2748
                    ], 
                   ['2018-11',
                    3.2735, 4.9982, 7.8493, 4.9278, 6.0542, 5.8782, 9.7149, 4.1535, 6.019, 4.8926, 4.8222, 4.2591, 33.1573
                    ], 
                   ['2018-12',
                    5.7525, 4.5322, 8.0186, 5.2876, 5.8106, 5.0552, 10.6334, 4.7066, 5.8687, 3.835, 3.9512, 3.6607, 32.8879
                    ], 
                   ['2019-01',
                    5.64, 3.4821, 7.5037, 5.6891, 5.4929, 4.9534, 8.9259, 5.591, 6.3266, 4.9044, 4.8553, 3.7764, 32.8592
                    ], 
                   ['2019-02',
                    3.9609, 3.6813, 7.4091, 4.4734, 5.7316, 5.3122, 9.0401, 5.918, 6.384, 4.5666, 5.1724, 3.9609, 34.3896
                    ], 
                   ['2019-03',
                    3.605, 4.4671, 7.6411, 3.8793, 5.6034, 5.721, 8.8166, 6.4655, 7.2492, 4.0752, 5.094, 4.232, 33.1505
                    ], 
                   ['2019-04',
                    3.8646, 3.975, 7.2874, 4.8583, 5.5208, 5.2632, 9.3485, 5.3736, 6.1097, 5.8152, 4.1958, 4.0486, 34.3393
                    ], 
                   ['2019-05',
                    4.2747, 4.1696, 6.9376, 4.4149, 5.7463, 5.2558, 9.7407, 4.7652, 6.7975, 5.431, 4.3798, 3.4688, 34.6181
                    ], 
                   ['2019-06',
                    3.7891, 4.8438, 7.5391, 4.0625, 5.5078, 5.2734, 10, 4.5312, 5.4297, 4.1797, 4.7656, 3.6328, 36.4453
                    ], 
                   ['2019-07',
                    4.5922, 4.2068, 7.9961, 4.7206, 6.0051, 4.817, 9.7624, 4.817, 6.1978, 4.1105, 4.5279, 4.1105, 34.1362
                    ], 
                   ['2019-08',
                    3.7516, 4.3338, 7.4386, 4.4955, 5.6598, 4.5925, 9.282, 4.3014, 6.3066, 4.9806, 5.0129, 4.5278, 35.3169
                    ], 
                   ['2019-09',
                    3.7549, 4.853, 7.1201, 5.3135, 6.022, 4.853, 9.5643, 4.9593, 5.8448, 4.7821, 4.5342, 3.9674, 34.4315
                    ], 
                   ['2019-10',
                    3.6093, 3.8924, 7.3248, 5.2017, 5.5202, 5.2725, 9.3064, 4.3878, 5.4494, 5.3432, 4.3878, 4.6355, 35.6688
                    ], 
                   ['2019-11',
                    4.2687, 3.9378, 7.2138, 4.5334, 4.6658, 4.9636, 9.4639, 3.7723, 6.949, 4.5996, 5.4269, 4.368, 35.8372
                    ], 
                   ['2019-12',
                    4.293, 3.9664, 8.4461, 4.3397, 5.9729, 4.1531, 9.0527, 4.3397, 5.9263, 4.293, 4.8063, 4.573, 35.8376
                    ], 
                   ['2020-01',
                    4.0388, 4.2718, 7.4175, 4.1553, 4.6602, 5.1262, 8.0388, 4.3495, 6.4466, 5.4369, 4.6214, 3.4175, 38.0194
                    ], 
                   ['2020-02',
                    3.6776, 3.8633, 5.7578, 3.9004, 5.6835, 4.4205, 8.2467, 5.052, 6.7979, 4.4577, 5.2377, 3.9376, 38.9673
                    ], 
                   ['2020-03',
                    3.4064, 4.0329, 7.361, 5.4424, 6.2647, 4.2287, 8.1049, 4.6985, 5.834, 4.3853, 4.581, 4.581, 37.0791
                    ], 
                   ['2020-04',
                    3.4645, 3.9342, 8.1621, 3.8755, 4.815, 5.1674, 9.5713, 4.9912, 5.4022, 5.6371, 4.7563, 3.6406, 36.5825
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba délek úvěru v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 13. 5. 2020 ze Zonky loanbooku k 5/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-22-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart22);
