
google.charts.load('current', {'packages':['bar', 'line', 'corechart']});
    function drawBAR3Chart0() {
        var data = google.visualization.arrayToDataTable([
                ['Účel', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Auto-moto (285 z 5197)',
                    0, 0.0192, 0.0577, 0.3079, 0.0192, 0.558, 0.0192, 0.9621, 1.3084, 1.4047, 0.8274
                    ], 
                   ['Cestování (18 z 499)',
                    0, 0, 0, 0.2004, 0, 0.4008, 0, 1.002, 1.4028, 0.2004, 0.4008
                    ], 
                   ['Domácnost (467 z 6427)',
                    0, 0.0467, 0.14, 0.4823, 0.0467, 0.9647, 0.0156, 1.5715, 1.4937, 1.2914, 1.2136
                    ], 
                   ['Elektronika (21 z 563)',
                    0, 0, 0.3552, 0.1776, 0, 0.3552, 0, 0.8881, 0.3552, 0.8881, 0.7105
                    ], 
                   ['Jiné (302 z 4839)',
                    0, 0.0413, 0.1033, 0.434, 0.0827, 0.9299, 0, 1.4466, 1.1573, 1.1159, 0.9299
                    ], 
                   ['Refinancování půjček (419 z 6867)',
                    0, 0.0437, 0.1456, 0.466, 0.0146, 0.9611, 0.0146, 1.1941, 1.1359, 1.0048, 1.1213
                    ], 
                   ['Vlastní projekt (105 z 1370)',
                    0, 0.073, 0.292, 0.365, 0.146, 0.9489, 0.073, 1.8978, 1.7518, 1.5328, 0.5839
                    ], 
                   ['Vzdělání (17 z 380)',
                    0, 0, 0, 0.2632, 0, 0.7895, 0.2632, 0.7895, 0.5263, 1.8421, 0
                    ], 
                   ['Zdraví (23 z 438)',
                    0, 0, 0.2283, 0.2283, 0, 0.6849, 0, 0.6849, 1.1416, 0.9132, 1.3699
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle účelu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-0-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart0);
    function drawBAR3Chart1() {
        var data = google.visualization.arrayToDataTable([
                ['Kraj', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Hlavní město Praha (157 z 3438)',
                    0, 0, 0.1454, 0.3781, 0.0582, 0.5817, 0.0291, 0.9889, 1.018, 0.9599, 0.4072
                    ], 
                   ['Jihomoravský kraj (137 z 2738)',
                    0, 0.0365, 0.2557, 0.2557, 0.073, 0.6939, 0, 1.0592, 0.8766, 1.0226, 0.7305
                    ], 
                   ['Jihočeský kraj (100 z 1260)',
                    0, 0, 0.3968, 0.5556, 0.0794, 1.1111, 0.1587, 1.9841, 1.3492, 1.1111, 1.1905
                    ], 
                   ['Karlovarský kraj (57 z 745)',
                    0, 0, 0.1342, 0, 0, 0.6711, 0, 2.1477, 1.6107, 2.0134, 1.0738
                    ], 
                   ['Kraj Vysočina (58 z 982)',
                    0, 0.1018, 0, 0.4073, 0, 0.7128, 0, 1.0183, 1.7312, 0.7128, 1.222
                    ], 
                   ['Královéhradecký kraj (72 z 1253)',
                    0, 0, 0, 0.2394, 0, 0.7183, 0, 1.5164, 1.1173, 1.1971, 0.9577
                    ], 
                   ['Liberecký kraj (92 z 1288)',
                    0, 0.0776, 0, 0.1553, 0, 1.3975, 0, 1.3975, 1.7081, 1.3975, 1.0093
                    ], 
                   ['Moravskoslezský kraj (229 z 3474)',
                    0, 0.0288, 0.1439, 0.3742, 0, 1.0363, 0.0288, 1.3817, 1.3241, 1.1226, 1.1514
                    ], 
                   ['Olomoucký kraj (97 z 1518)',
                    0, 0, 0.1318, 0.4611, 0.0659, 0.5929, 0, 1.054, 1.2516, 1.581, 1.2516
                    ], 
                   ['Pardubický kraj (75 z 1163)',
                    0, 0.172, 0, 0.6019, 0, 0.6019, 0, 1.6337, 1.0318, 1.2898, 1.1178
                    ], 
                   ['Plzeňský kraj (109 z 1331)',
                    0, 0.1503, 0, 0.7513, 0, 0.9016, 0, 1.8032, 2.2539, 1.4275, 0.9016
                    ], 
                   ['Středočeský kraj (216 z 3741)',
                    0, 0.0267, 0.0802, 0.3475, 0.0535, 0.7485, 0, 1.2296, 1.0425, 1.0158, 1.2296
                    ], 
                   ['Zlínský kraj (69 z 1247)',
                    0, 0.0802, 0.3208, 0.6415, 0.0802, 0.8821, 0, 0.7217, 1.1227, 0.8019, 0.8821
                    ], 
                   ['Ústecký kraj (189 z 2402)',
                    0, 0, 0.0833, 0.6245, 0.0833, 1.249, 0.0416, 1.3322, 1.5404, 1.7485, 1.1657
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle kraje žadatele',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-1-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart1);
    function drawBAR3Chart2() {
        var data = google.visualization.arrayToDataTable([
                ['Zdroj příjmu', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Důchod (136 z 1315)',
                    0, 0.2281, 0.3802, 0.6084, 0.2281, 1.673, 0.076, 1.9772, 1.4449, 2.0532, 1.673
                    ], 
                   ['Jiné (12 z 193)',
                    0, 0, 0, 0.5181, 0, 0, 0, 1.5544, 1.0363, 1.0363, 2.0725
                    ], 
                   ['OSVČ (156 z 2614)',
                    0, 0, 0.153, 0.4591, 0.1148, 0.7269, 0.0383, 1.7598, 1.1859, 1.0712, 0.4591
                    ], 
                   ['Podnikatel (18 z 372)',
                    0, 0, 0, 0.8065, 0, 0.2688, 0, 0.8065, 1.0753, 1.8817, 0
                    ], 
                   ['Rodičovská dovolená (62 z 672)',
                    0, 0, 0, 0.2976, 0, 0.8929, 0, 1.0417, 2.381, 1.7857, 2.8274
                    ], 
                   ['Student (9 z 97)',
                    0, 0, 0, 0, 0, 0, 0, 2.0619, 2.0619, 3.0928, 2.0619
                    ], 
                   ['Svobodné povolání (9 z 77)',
                    0, 0, 0, 0, 0, 0, 0, 2.5974, 5.1948, 1.2987, 2.5974
                    ], 
                   ['Zaměstnanec (1253 z 21235)',
                    0, 0.033, 0.1177, 0.3909, 0.0235, 0.8335, 0.0141, 1.2056, 1.2197, 1.1161, 0.9466
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle zdroje příjmu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-2-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart2);
    function drawBAR3Chart3() {
        var data = google.visualization.arrayToDataTable([
                ['Výše úvěru', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['do 50 000,- Kč (589 z 10013)',
                    0, 0, 0.0599, 0.1798, 0.01, 0.5293, 0.02, 0.9288, 1.0686, 1.4881, 1.5979
                    ], 
                   ['50 001,- až 100 000,- Kč (467 z 6196)',
                    0, 0.0161, 0.1291, 0.2744, 0.0484, 0.8877, 0, 1.6785, 1.8076, 1.4687, 1.2266
                    ], 
                   ['100 001,- až 150 000,- Kč (235 z 3278)',
                    0, 0.0915, 0.061, 0.6406, 0.122, 0.8847, 0, 1.8304, 1.7389, 1.2813, 0.5186
                    ], 
                   ['150 001,- až 200 000,- Kč (165 z 2708)',
                    0, 0, 0.1108, 0.5539, 0.0369, 1.514, 0, 1.6248, 0.9601, 0.997, 0.2954
                    ], 
                   ['200 001,- až 250 000,- Kč (66 z 1338)',
                    0, 0.1495, 0.4484, 0.5979, 0.0747, 1.3453, 0.0747, 1.0463, 0.9716, 0.1495, 0.0747
                    ], 
                   ['250 001,- až 300 000,- Kč (63 z 1309)',
                    0, 0.0764, 0.1528, 1.1459, 0, 0.7639, 0.0764, 1.3751, 0.8403, 0.3056, 0.0764
                    ], 
                   ['300 001,- až 350 000,- Kč (25 z 538)',
                    0, 0.1859, 0.1859, 0.5576, 0, 1.1152, 0.1859, 0.7435, 1.487, 0.1859, 0
                    ], 
                   ['350 001,- až 400 000,- Kč (19 z 459)',
                    0, 0.2179, 0.6536, 0.8715, 0, 0.8715, 0, 0.6536, 0.6536, 0.2179, 0
                    ], 
                   ['400 001,- až 450 000,- Kč (9 z 212)',
                    0, 0, 0.9434, 0.4717, 0, 2.3585, 0, 0.4717, 0, 0, 0
                    ], 
                   ['450 001,- až 500 000,- Kč (17 z 412)',
                    0, 0.2427, 0.2427, 1.699, 0, 0.7282, 0, 0.9709, 0.2427, 0, 0
                    ], 
                   ['500 001,- až 550 000,- Kč (0 z 29)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['550 001,- až 600 000,- Kč (1 z 35)',
                    0, 0, 0, 0, 2.8571, 0, 0, 0, 0, 0, 0
                    ], 
                   ['600 001,- až 650 000,- Kč (1 z 23)',
                    0, 0, 0, 0, 0, 4.3478, 0, 0, 0, 0, 0
                    ], 
                   ['650 001,- až 700 000,- Kč (0 z 17)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['od 700 001,- Kč (0 z 13)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle výše úvěru',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-3-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart3);
    function drawBAR3Chart4() {
        var data = google.visualization.arrayToDataTable([
                ['Délka úvěru', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['6 až 12 měs. (56 z 1935)',
                    0, 0, 0, 0, 0.0517, 0.1034, 0, 0.155, 0.4651, 0.7235, 1.3953
                    ], 
                   ['13 až 18 měs. (55 z 1739)',
                    0, 0, 0.0575, 0.0575, 0.0575, 0.2875, 0, 0.345, 0.8051, 0.6901, 0.8626
                    ], 
                   ['19 až 24 měs. (132 z 2528)',
                    0, 0, 0, 0.1582, 0, 0.356, 0.0396, 1.068, 1.3054, 1.7009, 0.5934
                    ], 
                   ['25 až 30 měs. (100 z 1666)',
                    0, 0, 0.06, 0.12, 0, 0.5402, 0, 0.9604, 0.9004, 1.0804, 2.3409
                    ], 
                   ['31 až 36 měs. (98 z 1573)',
                    0, 0, 0, 0.3814, 0, 0.3179, 0, 1.5893, 0.89, 1.4622, 1.5893
                    ], 
                   ['37 až 42 měs. (99 z 1399)',
                    0, 0, 0, 0.4289, 0, 1.0007, 0.0715, 1.2866, 1.644, 1.4296, 1.2152
                    ], 
                   ['43 až 48 měs. (131 z 2434)',
                    0, 0, 0.0822, 0.3287, 0.0822, 0.9449, 0, 1.1093, 1.438, 1.1093, 0.2876
                    ], 
                   ['49 až 54 měs. (99 z 1201)',
                    0, 0, 0.1665, 0.2498, 0.0833, 0.1665, 0.0833, 1.8318, 1.9151, 1.9983, 1.7485
                    ], 
                   ['55 až 60 měs. (86 z 1423)',
                    0, 0.1405, 0.3514, 0.773, 0, 0.773, 0, 0.9136, 1.1244, 1.546, 0.4216
                    ], 
                   ['61 až 66 měs. (80 z 1101)',
                    0, 0.0908, 0.1817, 0.6358, 0.1817, 1.1807, 0, 0.9991, 0.8174, 1.0899, 2.089
                    ], 
                   ['67 až 72 měs. (87 z 1201)',
                    0, 0.0833, 0.3331, 0.9159, 0, 0.8326, 0, 1.9983, 1.4988, 0.5828, 0.9992
                    ], 
                   ['73 až 78 měs. (73 z 919)',
                    0, 0, 0.1088, 0.1088, 0, 1.3058, 0, 1.0881, 2.8292, 1.3058, 1.197
                    ], 
                   ['od 79 měs. (561 z 7461)',
                    0, 0.0804, 0.2144, 0.6567, 0.0536, 1.4743, 0.0268, 1.9166, 1.3805, 1.1125, 0.6031
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle délky úvěru',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-4-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart4);
    function drawBAR3Chart5() {
        var data = google.visualization.arrayToDataTable([
                ['Délka úvěru', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['6 až 12 měs.',
                    0, 0, 0, 0, 0.1765714285714286, 0.2055194805194805, 0, 0.1153246753246753, 0.5543636363636364, 0.7895454545454546, 1.8561168831168835
                    ], 
                   ['13 až 18 měs.',
                    0, 0, 0.0425, 0.032, 0.032, 0.2120833333333333, 0, 0.2905287653522948, 0.5795763843999138, 0.5499274581627523, 0.648030866192631
                    ], 
                   ['19 až 24 měs.',
                    0, 0, 0, 0.0858851674641148, 0, 0.1275889328063241, 0.0130434782608696, 0.4917859371749532, 0.6517193675889328, 0.8407189168573609, 0.4783592677345538
                    ], 
                   ['25 až 30 měs.',
                    0, 0, 0.022962962962963, 0.0557714285714286, 0, 0.2446292226292226, 0, 0.4004780149607736, 0.3797060558853663, 0.4526771925392615, 1.116288335929715
                    ], 
                   ['31 až 36 měs.',
                    0, 0, 0, 0.1348232323232323, 0, 0.1082826366128074, 0, 0.4384411956375903, 0.4137955805000397, 0.5922557740593793, 0.5859336007130125
                    ], 
                   ['37 až 42 měs.',
                    0, 0, 0, 0.1294028730870836, 0, 0.2368589743589744, 0.0268292682926829, 0.4246833608919617, 0.5327583902583903, 0.3803896505372757, 0.3671369571690495
                    ], 
                   ['43 až 48 měs.',
                    0, 0, 0.0245454545454545, 0.0902171717171717, 0.0392414431082331, 0.1905705996131528, 0, 0.2263354697177224, 0.4123821116745842, 0.3159320740590076, 0.0917631260652042
                    ], 
                   ['49 až 54 měs.',
                    0, 0, 0.0377777777777778, 0.0555555555555556, 0.0177777777777778, 0.0377777777777778, 0.0177777777777778, 0.4066666666666666, 0.4266666666666666, 0.4444444444444444, 0.388888888888889
                    ], 
                   ['55 až 60 měs.',
                    0, 0.028, 0.07, 0.154, 0, 0.154, 0, 0.182, 0.224, 0.3100000000000001, 0.084
                    ], 
                   ['61 až 66 měs.',
                    0, 0.0163636363636364, 0.0327272727272727, 0.1163636363636364, 0.0327272727272727, 0.2145454545454545, 0, 0.1818181818181818, 0.1490909090909091, 0.1981818181818182, 0.3799999999999999
                    ], 
                   ['67 až 72 měs.',
                    0, 0.0133333333333333, 0.055, 0.1533333333333333, 0, 0.1383333333333333, 0, 0.3333333333333333, 0.25, 0.0966666666666667, 0.1666666666666667
                    ], 
                   ['73 až 78 měs.',
                    0, 0, 0.0169230769230769, 0.0169230769230769, 0, 0.2015384615384616, 0, 0.1676923076923077, 0.4353846153846154, 0.2015384615384616, 0.1846153846153846
                    ], 
                   ['od 79 měs.',
                    0, 0.0114285714285714, 0.03, 0.0942857142857143, 0.0071428571428571, 0.21, 0.0042857142857143, 0.2742857142857142, 0.1971428571428571, 0.1585714285714286, 0.0857142857142857
                    ]
        ]);
        var options = {
            chart: {
                title: 'Normalizovaná rizikovost podle délky úvěru',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Odhad zesplatněných ročně [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-5-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart5);
    function drawBAR3Chart6() {
        var data = google.visualization.arrayToDataTable([
                ['Má příběh?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (194 z 4177)',
                    0, 0, 0.1197, 0.1676, 0.1197, 0.5028, 0.0718, 1.1013, 1.0055, 0.6225, 0.9337
                    ], 
                   ['Ano (1463 z 22403)',
                    0, 0.0446, 0.1294, 0.4553, 0.0268, 0.9106, 0.0089, 1.3346, 1.3213, 1.2989, 0.9999
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle příběhu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-6-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart6);
    function drawBAR3Chart7() {
        var data = google.visualization.arrayToDataTable([
                ['Má pojištění?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (310 z 9462)',
                    0, 0.0211, 0.148, 0.2008, 0.074, 0.4439, 0.0106, 0.6975, 0.5179, 0.539, 0.6235
                    ], 
                   ['Ano (270 z 4553)',
                    0, 0, 0.0439, 0.4173, 0.0879, 0.4612, 0.0879, 1.23, 1.4935, 0.9884, 1.1201
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle pojištění, od jeho zavedení',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-7-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart7);
    function drawBAR3Chart8() {
        var data = google.visualization.arrayToDataTable([
                ['Byl při originaci investorem?', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['Ne (1644 z 25275)',
                    0, 0.0396, 0.1345, 0.4313, 0.0435, 0.8863, 0.0158, 1.3412, 1.3333, 1.2463, 1.0326
                    ], 
                   ['Ano (13 z 1305)',
                    0, 0, 0, 0, 0, 0.0766, 0.0766, 0.4598, 0.0766, 0.1533, 0.1533
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle statusu investora',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-8-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart8);
    function drawBAR3Chart9() {
        var data = google.visualization.arrayToDataTable([
                ['Počet předchozích půjček', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['0 (1468 z 20662)',
                    0, 0.0484, 0.1258, 0.4065, 0.0484, 0.9244, 0.0097, 1.4616, 1.4519, 1.4229, 1.2051
                    ], 
                   ['1 (156 z 4342)',
                    0, 0, 0.0921, 0.4836, 0.023, 0.6909, 0.023, 0.783, 0.737, 0.4606, 0.2994
                    ], 
                   ['2 (32 z 1110)',
                    0, 0, 0.3604, 0.3604, 0, 0.3604, 0.0901, 0.8108, 0.5405, 0.2703, 0.0901
                    ], 
                   ['3 (1 z 321)',
                    0, 0, 0, 0, 0, 0, 0.3115, 0, 0, 0, 0
                    ], 
                   ['4 (0 z 95)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['5 (0 z 29)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['6 (0 z 11)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['7 (0 z 6)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['8 (0 z 2)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['9 (0 z 1)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['10 (0 z 1)',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatněné půjčky podle počtu předchozích půjček',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            bars: 'horizontal',
            axes: {
                x: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-BAR-9-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawBAR3Chart9);
    function drawLINE3Chart10() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 1.0309, 0, 1.5385, 0, 2.7027, 0, 7.5472, 0
                    ], 
                   ['2016-03',
                    0, 0, 0, 0, 0, 2.1739, 0, 1.7241, 3.8462, 17.8571, 33.3333
                    ], 
                   ['2016-04',
                    0, 0, 0, 3.9216, 0, 0, 0, 4.5455, 10.8108, 33.3333, 36.3636
                    ], 
                   ['2016-05',
                    0, 0, 0, 2.8986, 0, 2.5, 0, 9.375, 2.8571, 6.8966, 16
                    ], 
                   ['2016-06',
                    0, 0, 5, 0, 0, 3.0303, 0, 10, 4.1667, 6.8966, 13.3333
                    ], 
                   ['2016-07',
                    0, 0, 4, 2.5641, 0, 8.3333, 0, 10.7143, 11.1111, 7.1429, 27.7778
                    ], 
                   ['2016-08',
                    0, 0, 0, 2.439, 0, 0, 0, 6.0606, 11.5385, 22.2222, 13.6364
                    ], 
                   ['2016-09',
                    0, 0, 0, 0, 0, 3.0303, 0, 12.1212, 0, 9.0909, 30
                    ], 
                   ['2016-10',
                    0, 0, 0, 0, 0, 3.4483, 0, 7.1429, 7.1429, 14.2857, 10
                    ], 
                   ['2016-11',
                    0, 0, 0, 1.3889, 0, 3.5714, 0, 12.1951, 5, 20.5128, 24
                    ], 
                   ['2016-12',
                    0, 0, 0, 0, 0, 8.1633, 0, 15.9091, 15.0943, 25, 26.9231
                    ], 
                   ['2017-01',
                    0, 0, 0, 1.6949, 0, 2.2222, 0, 4, 9.6774, 18.4211, 13.0435
                    ], 
                   ['2017-02',
                    0, 0, 0, 0, 0, 0, 0, 4.878, 7.6923, 13.6364, 26.3158
                    ], 
                   ['2017-03',
                    0, 0, 0, 1.4493, 0, 6.25, 0, 3.0303, 5.4054, 12.1212, 30.4348
                    ], 
                   ['2017-04',
                    0, 0, 0, 1.8182, 0, 2.0408, 0, 20.4545, 42.3077, 11.7647, 25
                    ], 
                   ['2017-05',
                    0, 0, 1.6949, 6.5574, 0, 10.6383, 0, 6.3492, 16.3636, 17.0213, 29.4118
                    ], 
                   ['2017-06',
                    0, 2.9412, 1.4493, 2.4845, 0, 5.5556, 0, 13.8889, 25.3521, 25, 29.6296
                    ], 
                   ['2017-07',
                    0, 2.9412, 0, 4.5752, 0, 11.7647, 0, 14.8936, 16.9492, 24.2424, 11.5385
                    ], 
                   ['2017-08',
                    0, 0, 2.381, 3.7037, 0, 11.8644, 0, 12.037, 13.9241, 37.7778, 20
                    ], 
                   ['2017-09',
                    0, 3.0303, 1.25, 2.5253, 0, 7.7519, 0, 14.1509, 13.9241, 19.0476, 28.125
                    ], 
                   ['2017-10',
                    0, 0, 2.0833, 1.6304, 0, 8.5227, 0, 14.7651, 18.0723, 24.3243, 26.9231
                    ], 
                   ['2017-11',
                    0, 3.1746, 0.8621, 1.31, 0, 7.6471, 0, 6.9182, 12.069, 20.4819, 26.087
                    ], 
                   ['2017-12',
                    0, 2.381, 1.3514, 2.4096, 0, 9.3525, 0, 13.8211, 19.7802, 19.1176, 17.6471
                    ], 
                   ['2018-01',
                    0, 3.5714, 1.2048, 2.4242, 0, 4.4776, 0, 12.5, 15.6627, 19.6078, 21.2121
                    ], 
                   ['2018-02',
                    0, 0, 1.1494, 1.6949, 0, 8.7838, 0, 12.2137, 17.2043, 14.5161, 24.2424
                    ], 
                   ['2018-03',
                    0, 2.381, 2.0408, 3.3493, 0, 10.6952, 0, 10.8108, 17.9856, 20.6897, 22.6415
                    ], 
                   ['2018-04',
                    0, 0, 3.6145, 2.994, 0, 6.3694, 0, 11.3333, 18.0952, 23.2877, 24
                    ], 
                   ['2018-05',
                    0, 0, 3, 2.0101, 0, 6.9519, 0, 11.8881, 16.1017, 18.5714, 27.5
                    ], 
                   ['2018-06',
                    0, 0, 0.8772, 2.4876, 0, 6.135, 0, 10.7383, 11.828, 17.6471, 21.4286
                    ], 
                   ['2018-07',
                    0, 0, 0, 4.7619, 0, 5.1095, 0, 11.0169, 7.6923, 10.3448, 14.6341
                    ], 
                   ['2018-08',
                    0, 0, 1.0638, 2.3121, 0, 4.1096, 0, 4.1322, 9.8765, 13.3333, 10
                    ], 
                   ['2018-09',
                    0, 2.2727, 1.0753, 1.2987, 0, 0.8475, 0, 8.5106, 10.6061, 14.8936, 26.087
                    ], 
                   ['2018-10',
                    0, 0, 2.381, 1.9231, 0, 2.3952, 0, 5.8442, 7.6923, 10.1266, 18.5185
                    ], 
                   ['2018-11',
                    0, 0, 3.125, 0.4785, 0, 0.8197, 0, 4.8544, 11.7188, 7.1429, 16
                    ], 
                   ['2018-12',
                    0, 0, 1.4706, 2.2388, 0, 0.625, 0, 5.0955, 4.9383, 12.6984, 17.2414
                    ], 
                   ['2019-01',
                    0, 0, 0, 0, 0, 2.9762, 0, 4.4586, 10.2273, 8.6207, 23.6364
                    ], 
                   ['2019-02',
                    0, 0, 0, 0, 0, 1.9868, 0, 1.7751, 11.7647, 5.2632, 14.8148
                    ], 
                   ['2019-03',
                    0, 0, 0, 1.3514, 0, 2.7778, 0, 3.3113, 7.2917, 8.5714, 12.9032
                    ], 
                   ['2019-04',
                    0, 0, 0, 0, 4.1667, 1.7391, 2.0408, 3.7736, 6.6667, 6.1224, 14.7059
                    ], 
                   ['2019-05',
                    0, 4.5455, 0, 0, 1.8018, 0, 0, 1.8868, 7.1429, 9.5238, 4
                    ], 
                   ['2019-06',
                    0, 0, 0, 0, 0, 0, 1.0753, 3.4483, 4.2553, 7.4074, 8.3333
                    ], 
                   ['2019-07',
                    0, 0, 1.4286, 0, 0, 0, 1.2195, 4.2105, 2.1739, 4.3478, 0
                    ], 
                   ['2019-08',
                    0, 0, 1.4706, 2.2727, 1.0309, 3.9604, 0, 8.1395, 2.5641, 3.125, 6.6667
                    ], 
                   ['2019-09',
                    0, 0, 0, 1.6393, 3.7037, 0, 1.1236, 0, 2.9412, 0, 5.8824
                    ], 
                   ['2019-10',
                    0, 0, 0, 2.2222, 3.5088, 0, 0, 0, 0, 5.5556, 9.0909
                    ], 
                   ['2019-11',
                    0, 0, 0, 0, 0, 0, 0, 2.439, 0, 0, 0
                    ], 
                   ['2019-12',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2020-01',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2020-02',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2020-03',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění podle data originace a ratingu [%]',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z ukončených [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-10-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart10);
    function drawLINE3Chart11() {
        var data = google.visualization.arrayToDataTable([
                ['Počet měsíců života půjčky', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['0',
                    0, 0.23, 0.3, 0.72, 0.23, 1.77, 0.13, 3.24, 5.41, 7.35, 10.02
                    ], 
                   ['1',
                    0, 0.23, 0.3, 0.73, 0.24, 1.79, 0.13, 3.27, 5.46, 7.43, 10.1
                    ], 
                   ['2',
                    0, 0.24, 0.32, 0.77, 0.27, 1.92, 0.14, 3.5, 5.84, 7.94, 10.86
                    ], 
                   ['3',
                    0, 0.25, 0.34, 0.81, 0.31, 2.05, 0.17, 3.78, 6.16, 8.5, 11.76
                    ], 
                   ['4',
                    0, 0.26, 0.36, 0.86, 0.35, 2.19, 0.2, 4.06, 6.54, 9.04, 12.63
                    ], 
                   ['5',
                    0, 0.27, 0.39, 0.9, 0.41, 2.35, 0.23, 4.34, 6.94, 9.6, 13.48
                    ], 
                   ['6',
                    0, 0.28, 0.43, 0.95, 0.4, 2.53, 0.27, 4.69, 7.44, 10.14, 14.45
                    ], 
                   ['7',
                    0, 0.3, 0.46, 1, 0.39, 2.75, 0.26, 5.08, 8.1, 11, 15.65
                    ], 
                   ['8',
                    0, 0.31, 0.48, 1.04, 0.42, 2.92, 0.34, 5.41, 8.81, 11.88, 16.63
                    ], 
                   ['9',
                    0, 0.33, 0.5, 1.1, 0.56, 3.15, 0.34, 5.84, 9.53, 12.78, 18.07
                    ], 
                   ['10',
                    0, 0.35, 0.54, 1.18, 0.79, 3.41, 0.33, 6.31, 10.21, 13.74, 19.3
                    ], 
                   ['11',
                    0, 0.3, 0.58, 1.26, 0.82, 3.66, 0.51, 6.79, 10.84, 14.49, 20.61
                    ], 
                   ['12',
                    0, 0.33, 0.63, 1.31, 0, 3.96, 0, 7.4, 11.54, 15.54, 21.85
                    ], 
                   ['13',
                    0, 0.35, 0.69, 1.38, 0, 4.19, 0, 7.93, 12.25, 16.55, 23.48
                    ], 
                   ['14',
                    0, 0.37, 0.75, 1.5, 0, 4.58, 0, 8.72, 13.06, 17.93, 24.84
                    ], 
                   ['15',
                    0, 0.39, 0.8, 1.62, 0, 4.93, 0, 9.39, 13.95, 19.1, 26.5
                    ], 
                   ['16',
                    0, 0.42, 0.85, 1.69, 0, 5.38, 0, 10.13, 14.93, 20.2, 28.3
                    ], 
                   ['17',
                    0, 0.44, 0.76, 1.8, 0, 5.81, 0, 10.79, 15.38, 21.54, 29.41
                    ], 
                   ['18',
                    0, 0.48, 0.76, 1.88, 0, 6.39, 0, 11.8, 16.54, 22.98, 31.62
                    ], 
                   ['19',
                    0, 0.47, 0.81, 2.01, 0, 6.99, 0, 12.62, 17.63, 23.94, 32.71
                    ], 
                   ['20',
                    0, 0.53, 0.86, 2.09, 0, 7.34, 0, 13.26, 18.72, 25.44, 35.07
                    ], 
                   ['21',
                    0, 0.51, 0.97, 2.07, 0, 7.81, 0, 13.66, 19.64, 26.96, 37.27
                    ], 
                   ['22',
                    0, 0.63, 1.11, 2.12, 0, 8.12, 0, 14.2, 20.49, 28.3, 38.76
                    ], 
                   ['23',
                    0, 0.71, 1.08, 2.26, 0, 8.54, 0, 15.08, 21.38, 29.4, 39.72
                    ], 
                   ['24',
                    0, 0.8, 1.01, 2.42, 0, 8.8, 0, 15.9, 22.99, 30.6, 40.57
                    ], 
                   ['25',
                    0, 0.93, 0.99, 2.46, 0, 8.7, 0, 16.67, 23.46, 31.65, 42.75
                    ], 
                   ['26',
                    0, 1.12, 1.03, 2.57, 0, 9.05, 0, 17.12, 23.67, 33.47, 46.86
                    ], 
                   ['27',
                    0, 1.04, 1.07, 2.7, 0, 9.82, 0, 17.12, 24.41, 34.08, 47.95
                    ], 
                   ['28',
                    0, 0.97, 1.1, 2.86, 0, 10, 0, 17.35, 24.95, 33.33, 49.75
                    ], 
                   ['29',
                    0, 0.58, 1.16, 3.1, 0, 10.14, 0, 18.14, 25.73, 33.06, 49.45
                    ], 
                   ['30',
                    0, 0.74, 0.95, 3.41, 0, 10.21, 0, 17.77, 26.42, 33.54, 50
                    ], 
                   ['31',
                    0, 0.47, 0.95, 3.74, 0, 10.62, 0, 17.58, 27.93, 33.69, 49.66
                    ], 
                   ['32',
                    0, 0.55, 0.69, 3.53, 0, 9.91, 0, 18.36, 28.4, 34.19, 51.09
                    ], 
                   ['33',
                    0, 0, 0.82, 3.24, 0, 7.98, 0, 18.49, 29.11, 35.27, 51.16
                    ], 
                   ['34',
                    0, 0, 0.68, 3.26, 0, 7.36, 0, 17.7, 25.82, 34.62, 52.21
                    ], 
                   ['35',
                    0, 0, 0.42, 2.35, 0, 5.49, 0, 18.81, 25.32, 35.22, 55
                    ], 
                   ['36',
                    0, 0, 0.53, 2.4, 0, 5.78, 0, 18.79, 22.31, 38.46, 55.43
                    ], 
                   ['37',
                    0, 0, 0.63, 2.39, 0, 6.11, 0, 20.98, 22.81, 39.37, 54.88
                    ], 
                   ['38',
                    0, 0, 0.7, 2.46, 0, 7.28, 0, 21.6, 24.51, 39.83, 55.41
                    ], 
                   ['39',
                    0, 0, 0.79, 2.93, 0, 7.52, 0, 22.12, 25.58, 40.2, 59.7
                    ], 
                   ['40',
                    0, 0, 1.01, 3.33, 0, 8.04, 0, 20.69, 22.06, 39.74, 57.14
                    ], 
                   ['41',
                    0, 0, 1.19, 3.52, 0, 5.95, 0, 20, 23.21, 39.06, 56.52
                    ], 
                   ['42',
                    0, 0, 1.43, 4.24, 0, 6.45, 0, 20, 22.45, 43.14, 60.98
                    ], 
                   ['43',
                    0, 0, 1.75, 4, 0, 5.66, 0, 20, 26.19, 43.75, 61.76
                    ], 
                   ['44',
                    0, 0, 2.33, 3.66, 0, 6.52, 0, 20.51, 27.59, 42.5, 64.29
                    ], 
                   ['45',
                    0, 0, 0, 3.17, 0, 7.69, 0, 21.21, 27.27, 47.06, 61.9
                    ], 
                   ['46',
                    0, 0, 0, 4.44, 0, 6.25, 0, 16, 25, 48.28, 57.89
                    ], 
                   ['47',
                    0, 0, 0, 0, 0, 8.7, 0, 11.11, 36.36, 50, 66.67
                    ], 
                   ['48',
                    0, 0, 0, 0, 0, 20, 0, 16.67, 16.67, 46.67, 57.14
                    ], 
                   ['49',
                    0, 0, 0, 0, 0, 12.5, 0, 12.5, 0, 33.33, 0
                    ], 
                   ['50',
                    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění v průběhu života půjčky, podle ratingu',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z doživších se [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-11-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart11);
    function drawLINE3Chart12() {
        var data = google.visualization.arrayToDataTable([
                ['Počet měsíců života půjčky', '2016', '2017', '2018', '2019', '2020'],
                   ['0',
                    5.11, 5.32, 3.13, 0.58, 0
                    ], 
                   ['1',
                    5.19, 5.35, 3.16, 0.59, 0
                    ], 
                   ['2',
                    5.31, 5.51, 3.25, 0.61, 0
                    ], 
                   ['3',
                    5.42, 5.65, 3.35, 0.64, 0
                    ], 
                   ['4',
                    5.56, 5.8, 3.45, 0.67, 0
                    ], 
                   ['5',
                    5.68, 5.97, 3.56, 0.74, 0
                    ], 
                   ['6',
                    5.86, 6.11, 3.69, 0.84, 0
                    ], 
                   ['7',
                    6.06, 6.29, 3.83, 0.95, 0
                    ], 
                   ['8',
                    6.21, 6.45, 3.98, 1, 0
                    ], 
                   ['9',
                    6.42, 6.64, 4.12, 1.16, 0
                    ], 
                   ['10',
                    6.61, 6.82, 4.25, 1.36, 0
                    ], 
                   ['11',
                    6.85, 6.97, 4.39, 1.54, 0
                    ], 
                   ['12',
                    7.1, 7.17, 4.57, 1.67, 0
                    ], 
                   ['13',
                    7.35, 7.41, 4.74, 1.68, 0
                    ], 
                   ['14',
                    7.68, 7.62, 4.92, 1.67, 0
                    ], 
                   ['15',
                    7.99, 7.8, 5.13, 0, 0
                    ], 
                   ['16',
                    8.19, 8.01, 5.18, 0, 0
                    ], 
                   ['17',
                    8.5, 8.24, 5.34, 0, 0
                    ], 
                   ['18',
                    8.81, 8.55, 5.84, 0, 0
                    ], 
                   ['19',
                    9.08, 8.76, 6.42, 0, 0
                    ], 
                   ['20',
                    9.36, 9.04, 6.9, 0, 0
                    ], 
                   ['21',
                    9.57, 9.31, 7.43, 0, 0
                    ], 
                   ['22',
                    10.01, 9.6, 7.91, 0, 0
                    ], 
                   ['23',
                    10.39, 9.98, 8.22, 0, 0
                    ], 
                   ['24',
                    10.76, 10.4, 8.13, 0, 0
                    ], 
                   ['25',
                    11.15, 10.83, 6.73, 0, 0
                    ], 
                   ['26',
                    11.41, 11.21, 5.45, 0, 0
                    ], 
                   ['27',
                    11.58, 11.6, 0, 0, 0
                    ], 
                   ['28',
                    11.89, 10.94, 0, 0, 0
                    ], 
                   ['29',
                    12.57, 11.21, 0, 0, 0
                    ], 
                   ['30',
                    13.01, 11.65, 0, 0, 0
                    ], 
                   ['31',
                    13.43, 12.04, 0, 0, 0
                    ], 
                   ['32',
                    13.81, 12, 0, 0, 0
                    ], 
                   ['33',
                    14.29, 11.71, 0, 0, 0
                    ], 
                   ['34',
                    14.95, 10.48, 0, 0, 0
                    ], 
                   ['35',
                    15.4, 9.95, 0, 0, 0
                    ], 
                   ['36',
                    15.88, 10.13, 0, 0, 0
                    ], 
                   ['37',
                    16.74, 8.95, 0, 0, 0
                    ], 
                   ['38',
                    17.26, 8.72, 0, 0, 0
                    ], 
                   ['39',
                    18.24, 0, 0, 0, 0
                    ], 
                   ['40',
                    15.93, 0, 0, 0, 0
                    ], 
                   ['41',
                    15.75, 0, 0, 0, 0
                    ], 
                   ['42',
                    17.17, 0, 0, 0, 0
                    ], 
                   ['43',
                    17.84, 0, 0, 0, 0
                    ], 
                   ['44',
                    18.24, 0, 0, 0, 0
                    ], 
                   ['45',
                    19.03, 0, 0, 0, 0
                    ], 
                   ['46',
                    19.58, 0, 0, 0, 0
                    ], 
                   ['47',
                    20.44, 0, 0, 0, 0
                    ], 
                   ['48',
                    20.78, 0, 0, 0, 0
                    ], 
                   ['49',
                    10.53, 0, 0, 0, 0
                    ], 
                   ['50',
                    0, 0, 0, 0, 0
                    ]
        ]);
        var options = {
            chart: {
                title: 'Zesplatnění v průběhu života půjčky, podle roku originace',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            axes: {
                y: {
                  0: {label: 'Zesplatněno z doživších se [%]'}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-12-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart12);
    function drawLINE3Chart13() {
        var data = google.visualization.arrayToDataTable([
                ['Měsíc', 'Objemem vážený průměrný úrok [% p.a.]', 'Počtem vážený průměrný úrok [% p.a.]', 'Ztraceno [% objemu]', 'S pojištěním [% všech půjček]', 'Bez příběhu [% všech půjček]'],
                   ['2016-02',
                    9.48158258028822, 9.915233644859812, 0, 0, 0.9299999999999999
                    ], 
                   ['2016-03',
                    9.507338250083809, 10.034270833333334, 0.13, 0, 0.52
                    ], 
                   ['2016-04',
                    9.397446355112478, 9.949309494451295, 0.23, 0, 0.49
                    ], 
                   ['2016-05',
                    9.31118460232555, 9.977387387387388, 0.17, 0, 0.63
                    ], 
                   ['2016-06',
                    9.207182025562384, 9.972300884955752, 0.14, 0, 0.66
                    ], 
                   ['2016-07',
                    9.127489940673367, 9.910331421287443, 0.12, 0, 0.7000000000000001
                    ], 
                   ['2016-08',
                    9.110183915529062, 9.954835164835165, 0.1, 0, 1.04
                    ], 
                   ['2016-09',
                    9.032353283960816, 9.866494023904382, 0.09, 0, 1.0999999999999999
                    ], 
                   ['2016-10',
                    9.019944356462485, 9.880848214285713, 0.08, 0, 1.16
                    ], 
                   ['2016-11',
                    9.011734147670893, 9.925717002662608, 0.07, 0, 1.1400000000000001
                    ], 
                   ['2016-12',
                    9.009857794498451, 9.986398166339228, 0.06, 0, 1.08
                    ], 
                   ['2017-01',
                    8.927109445982492, 9.953991769547324, 0.05, 0, 1
                    ], 
                   ['2017-02',
                    8.807850683572859, 9.8537339055794, 0.06, 0, 0.97
                    ], 
                   ['2017-03',
                    8.772715891923353, 9.841824457593688, 0.06, 0, 1.01
                    ], 
                   ['2017-04',
                    8.659677213284112, 9.738507119889757, 0.06, 0, 1.01
                    ], 
                   ['2017-05',
                    8.433559196771801, 9.553833992094862, 0.05, 0, 1.05
                    ], 
                   ['2017-06',
                    8.266391498913281, 9.391465386558869, 0.07, 0, 1.04
                    ], 
                   ['2017-07',
                    8.129859930687351, 9.247765346680406, 0.08, 0, 1.1199999999999999
                    ], 
                   ['2017-08',
                    8.031712420530425, 9.125138587303615, 0.09, 0, 1.34
                    ], 
                   ['2017-09',
                    7.927677087770594, 9.045549314760729, 0.09, 0, 1.46
                    ], 
                   ['2017-10',
                    7.865682451548923, 8.982567964013299, 0.08, 0, 1.6
                    ], 
                   ['2017-11',
                    7.766697189031557, 8.89723444001019, 0.1, 0, 1.73
                    ], 
                   ['2017-12',
                    7.730692240551537, 8.871466521671586, 0.1, 0, 1.83
                    ], 
                   ['2018-01',
                    7.7297335420218465, 8.850983981693364, 0.09, 0, 1.96
                    ], 
                   ['2018-02',
                    7.727861656676985, 8.835431706994578, 0.08, 0, 2.03
                    ], 
                   ['2018-03',
                    7.74065798435242, 8.846852062503741, 0.08, 0, 2.1399999999999997
                    ], 
                   ['2018-04',
                    7.7260361404793745, 8.8419092418373, 0.08, 1.6400000000000001, 2.2399999999999998
                    ], 
                   ['2018-05',
                    7.722359235000748, 8.831647034722934, 0.08, 4.24, 2.45
                    ], 
                   ['2018-06',
                    7.692501598828086, 8.802888382904037, 0.08, 6.29, 2.73
                    ], 
                   ['2018-07',
                    7.6056631510720125, 8.71870781527531, 0.07, 8.25, 2.94
                    ], 
                   ['2018-08',
                    7.57225061664269, 8.708000583892897, 0.07, 9.77, 3.19
                    ], 
                   ['2018-09',
                    7.532511387533076, 8.687392032539778, 0.06, 10.92, 3.5999999999999996
                    ], 
                   ['2018-10',
                    7.480300610473837, 8.65316829468347, 0.06, 12.25, 5.16
                    ], 
                   ['2018-11',
                    7.469617036269997, 8.662756842797329, 0.06, 13.919999999999998, 7.88
                    ], 
                   ['2018-12',
                    7.4725531788960415, 8.678989689341188, 0.06, 14.92, 9.55
                    ], 
                   ['2019-01',
                    7.483066654953751, 8.704221910291585, 0.05, 16.07, 11.32
                    ], 
                   ['2019-02',
                    7.508923692985673, 8.740593824228029, 0.05, 17.34, 12.93
                    ], 
                   ['2019-03',
                    7.527800831451616, 8.774402340807695, 0.05, 18.77, 14.649999999999999
                    ], 
                   ['2019-04',
                    7.488827475399956, 8.72187510298237, 0.05, 20.02, 16.38
                    ], 
                   ['2019-05',
                    7.456122043199563, 8.680631921824103, 0.04, 21.62, 18.04
                    ], 
                   ['2019-06',
                    7.429856604678536, 8.64104872296653, 0.04, 22.61, 19.259999999999998
                    ], 
                   ['2019-07',
                    7.403376785244365, 8.598541264507519, 0.04, 23.580000000000002, 20.51
                    ], 
                   ['2019-08',
                    7.3786178460965886, 8.56654559945349, 0.04, 24.51, 21.57
                    ], 
                   ['2019-09',
                    7.368042483669791, 8.551435616438356, 0.04, 25.05, 22.439999999999998
                    ], 
                   ['2019-10',
                    7.3538318572496415, 8.524780307040762, 0.04, 25.53, 23.22
                    ], 
                   ['2019-11',
                    7.296185808881532, 8.467691333823408, 0.04, 26.090000000000003, 24.09
                    ], 
                   ['2019-12',
                    7.2659654709066706, 8.439652112534032, 0.04, 26.400000000000002, 24.81
                    ], 
                   ['2020-01',
                    7.251273484582808, 8.429692767060857, 0.04, 26.69, 25.590000000000003
                    ], 
                   ['2020-02',
                    7.237088870055972, 8.420333525014376, 0.03, 27.13, 26.32
                    ], 
                   ['2020-03',
                    7.224898174950519, 8.405309599563228, 0.03, 27.46, 26.99
                    ]
        ]);
        var options = {
            chart: {
                title: 'Souhrnné statistiky platformy',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            axes: {
                y: {
                  0: {label: ''}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-13-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart13);
    function drawLINE3Chart14() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Objemem vážený průměrný úrok [% p.a.]', 'Počtem vážený průměrný úrok [% p.a.]', 'Ztraceno [% objemu]', 'Zesplatněno [% ukončených půjček]', 'S pojištěním [% všech půjček]', 'Bez příběhu [% všech půjček]'],
                   ['2016-02',
                    9.48158258028822, 9.915233644859812, 0, 2.4, 0, 0.9299999999999999
                    ], 
                   ['2016-03',
                    9.585444120100084, 10.137368421052631, 0.26, 4.92, 0, 0
                    ], 
                   ['2016-04',
                    9.163282829789138, 9.780794979079499, 0.45, 8.08, 0, 0.42
                    ], 
                   ['2016-05',
                    9.082614146116729, 10.0662987012987, 0, 5, 0, 0.97
                    ], 
                   ['2016-06',
                    8.966992604765817, 10.079694656488549, 0, 4.81, 0, 0.76
                    ], 
                   ['2016-07',
                    8.71180547954026, 9.599865470852018, 0, 8.82, 0, 0.8999999999999999
                    ], 
                   ['2016-08',
                    8.984324748836796, 10.136067415730336, 0, 6.67, 0, 3
                    ], 
                   ['2016-09',
                    8.465082508250827, 9.323333333333332, 0, 5.29, 0, 1.28
                    ], 
                   ['2016-10',
                    8.949773202873141, 10.004760147601477, 0, 4.9799999999999995, 0, 1.8499999999999999
                    ], 
                   ['2016-11',
                    8.955806209612794, 10.109385342789597, 0, 7.89, 0, 0.95
                    ], 
                   ['2016-12',
                    9.057868008424995, 10.376813186813187, 0, 12.23, 0, 0.66
                    ], 
                   ['2017-01',
                    8.495928138293058, 9.881414141414142, 0, 5.94, 0, 0.51
                    ], 
                   ['2017-02',
                    7.8471228266965785, 9.053157894736842, 0.14, 4.51, 0, 0.79
                    ], 
                   ['2017-03',
                    8.433172810146651, 9.7639898989899, 0.04, 6.2700000000000005, 0, 1.52
                    ], 
                   ['2017-04',
                    7.745830772012294, 8.914744897959183, 0, 10.57, 0, 1.02
                    ], 
                   ['2017-05',
                    7.417096114519428, 8.667722152690864, 0, 9.24, 0, 1.25
                    ], 
                   ['2017-06',
                    7.545334066538356, 8.64524193548387, 0.15, 10.190000000000001, 0, 1.11
                    ], 
                   ['2017-07',
                    7.359513154132113, 8.423678756476683, 0.17, 9.71, 0, 1.4500000000000002
                    ], 
                   ['2017-08',
                    7.555856039762137, 8.548210251954822, 0.12, 10.100000000000001, 0, 2.69
                    ], 
                   ['2017-09',
                    7.41962586580376, 8.682682926829267, 0.06, 8.89, 0, 2.1999999999999997
                    ], 
                   ['2017-10',
                    7.5813903381431595, 8.70256868131868, 0.06, 9.98, 0, 2.6100000000000003
                    ], 
                   ['2017-11',
                    7.358334806304316, 8.565084364454442, 0.15, 7.430000000000001, 0, 2.42
                    ], 
                   ['2017-12',
                    7.549312861817267, 8.765260029717682, 0.09, 9.91, 0, 2.6
                    ], 
                   ['2018-01',
                    7.827964382592286, 8.753197026022304, 0, 8.27, 0, 3.2
                    ], 
                   ['2018-02',
                    7.804064544265155, 8.804121037463977, 0.01, 8.53, 0, 2.74
                    ], 
                   ['2018-03',
                    7.946755418832431, 9.061930773391023, 0.04, 10.489999999999998, 0, 3.19
                    ], 
                   ['2018-04',
                    7.750774111184185, 8.91350203606748, 0.08, 10, 17.22, 3.32
                    ], 
                   ['2018-05',
                    7.7679907826962555, 8.875035499726925, 0.1, 8.83, 29.160000000000004, 4.53
                    ], 
                   ['2018-06',
                    7.556124475794424, 8.690652938221998, 0, 7.2700000000000005, 25.259999999999998, 5.42
                    ], 
                   ['2018-07',
                    6.855983288827634, 8.022366649404454, 0.01, 5.96, 28.07, 5.33
                    ], 
                   ['2018-08',
                    7.263500630472232, 8.683336831059812, 0, 5.04, 26.229999999999997, 6.09
                    ], 
                   ['2018-09',
                    7.109913487698421, 8.50935874168179, 0, 5.89, 26.19, 9.01
                    ], 
                   ['2018-10',
                    7.05173854601613, 8.41142230026339, 0.03, 4.8500000000000005, 25.990000000000002, 22.21
                    ], 
                   ['2018-11',
                    7.523809724320709, 8.942129531854981, 0, 4.51, 28.58, 32.73
                    ], 
                   ['2018-12',
                    7.860266636791396, 9.22445671121441, 0, 4.2, 31.14, 37.01
                    ], 
                   ['2019-01',
                    7.842695897037852, 9.272981853849926, 0, 5.21, 32.37, 36
                    ], 
                   ['2019-02',
                    8.071726483309671, 9.411714818266542, 0, 3.8899999999999997, 35.410000000000004, 35.410000000000004
                    ], 
                   ['2019-03',
                    7.990097559615894, 9.383808777429467, 0, 4.02, 36.13, 35.97
                    ], 
                   ['2019-04',
                    7.1895177961853385, 8.315542878174456, 0, 3.06, 35.22, 37.14
                    ], 
                   ['2019-05',
                    7.157471910748028, 8.287827610371409, 0, 1.8499999999999999, 40.71, 38.26
                    ], 
                   ['2019-06',
                    7.247352543290043, 8.320078125, 0.01, 1.51, 36.76, 36.17
                    ], 
                   ['2019-07',
                    7.345318743626808, 8.38932562620424, 0, 1.24, 35.160000000000004, 35.839999999999996
                    ], 
                   ['2019-08',
                    7.245446437408584, 8.395562742561449, 0.04, 3, 35.61, 35.410000000000004
                    ], 
                   ['2019-09',
                    7.445739826069648, 8.61291888062345, 0, 1.24, 33.050000000000004, 35.67
                    ], 
                   ['2019-10',
                    7.3117831160957865, 8.416928520877565, 0, 1.3299999999999998, 33.26, 36.02
                    ], 
                   ['2019-11',
                    6.610016995870875, 7.891058901389808, 0, 0.34, 34.050000000000004, 37.29
                    ], 
                   ['2019-12',
                    6.9217811761701045, 8.176187587494168, 0, 0, 33.78, 41.06
                    ], 
                   ['2020-01',
                    7.1356366436108445, 8.425339805825242, 0, 0, 31.22, 39.15
                    ], 
                   ['2020-02',
                    7.211859175172073, 8.494643387815751, 0, 0, 34.660000000000004, 39.86
                    ], 
                   ['2020-03',
                    7.305667768408088, 8.552255285826156, 0, 0, 34.81, 41.78
                    ]
        ]);
        var options = {
            chart: {
                title: 'Souhrnné statistiky podle data originace',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            axes: {
                y: {
                  0: {label: ''}
                },
            },
            
            isStacked: false
        };
        var chart_div = document.getElementById('chart-LINE-14-interactive');
        var chart = new google.charts.Line(chart_div);

        chart.draw(data, google.charts.Line.convertOptions(options));
    }
        // nothing
  google.charts.setOnLoadCallback(drawLINE3Chart14);
    function drawCOLUMN3Chart15() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 33.96, 0, 21.18, 0, 13.71, 12.46, 18.69, 0
                    ], 
                   ['2016-03',
                    0, 1.05, 6.32, 23.86, 0, 18.6, 0, 22.46, 10.53, 12.28, 4.91
                    ], 
                   ['2016-04',
                    0, 0.42, 13.81, 25.94, 0, 15.9, 0, 12.13, 17.57, 8.37, 5.86
                    ], 
                   ['2016-05',
                    0, 0.97, 11.36, 26.62, 0, 16.88, 0, 12.66, 12.34, 10.06, 9.09
                    ], 
                   ['2016-06',
                    0, 4.58, 9.92, 21.37, 0, 16.41, 0, 14.89, 13.36, 13.36, 6.11
                    ], 
                   ['2016-07',
                    0, 3.14, 15.7, 25.11, 0, 14.8, 0, 14.8, 9.87, 7.62, 8.97
                    ], 
                   ['2016-08',
                    0, 4.12, 12.36, 21.35, 0, 15.36, 0, 14.61, 13.86, 8.24, 10.11
                    ], 
                   ['2016-09',
                    0, 3.85, 12.82, 24.36, 0, 17.52, 0, 18.8, 11.11, 6.41, 5.13
                    ], 
                   ['2016-10',
                    0, 2.21, 15.5, 22.88, 0, 14.76, 0, 11.81, 14.02, 9.59, 9.23
                    ], 
                   ['2016-11',
                    0, 1.89, 9.69, 24.11, 0, 18.68, 0, 13.48, 13, 12.06, 7.09
                    ], 
                   ['2016-12',
                    0, 1.54, 9.45, 21.54, 0, 18.68, 0, 13.41, 15.16, 13.19, 7.03
                    ], 
                   ['2017-01',
                    0, 2.02, 14.65, 21.46, 0, 16.67, 0, 16.16, 10.61, 11.62, 6.82
                    ], 
                   ['2017-02',
                    0, 3.42, 13.95, 29.21, 0, 17.89, 0, 13.68, 9.21, 7.11, 5.53
                    ], 
                   ['2017-03',
                    0, 3.54, 14.39, 25.76, 0, 13.38, 0, 11.62, 12.12, 11.62, 7.58
                    ], 
                   ['2017-04',
                    0, 5.87, 15.82, 21.94, 0, 21.68, 0, 15.05, 8.93, 5.87, 4.85
                    ], 
                   ['2017-05',
                    0, 7.26, 14.02, 28.16, 0, 17.02, 0, 13.02, 9.64, 8.01, 2.88
                    ], 
                   ['2017-06',
                    0, 7.76, 12.8, 28.12, 0, 17.54, 0, 15.22, 8.87, 6.25, 3.43
                    ], 
                   ['2017-07',
                    0, 6.74, 15.44, 28.91, 0, 18.03, 0, 14.51, 7.67, 5.49, 3.21
                    ], 
                   ['2017-08',
                    0, 6.34, 13.99, 29.28, 0, 17.2, 0, 15.2, 9.56, 5.82, 2.61
                    ], 
                   ['2017-09',
                    0, 5.53, 14.15, 28.86, 0, 18.29, 0, 13.5, 9.59, 7.07, 3.01
                    ], 
                   ['2017-10',
                    0, 6.66, 12.98, 26.03, 0, 20.26, 0, 14.84, 9.62, 7.55, 2.06
                    ], 
                   ['2017-11',
                    0, 7.99, 14.9, 26.66, 0, 17.72, 0, 14.06, 9.39, 5.91, 3.37
                    ], 
                   ['2017-12',
                    0, 7.58, 13.3, 25.33, 0, 17.76, 0, 15.97, 10.77, 6.46, 2.82
                    ], 
                   ['2018-01',
                    0, 6.91, 13.23, 26.47, 0, 18.14, 0, 16.06, 10.11, 5.58, 3.49
                    ], 
                   ['2018-02',
                    0, 6.34, 13.83, 25.43, 0, 18.95, 0, 15.63, 10.37, 6.12, 3.31
                    ], 
                   ['2018-03',
                    0, 7.84, 12.11, 23.8, 0, 18.33, 0, 14.49, 11.9, 7.52, 4
                    ], 
                   ['2018-04',
                    0, 7.68, 13.32, 24.32, 0, 17.98, 0, 15.13, 11.58, 5.88, 4.13
                    ], 
                   ['2018-05',
                    0, 7.37, 13.44, 25.34, 0, 16.93, 0, 15.35, 11.03, 7.26, 3.28
                    ], 
                   ['2018-06',
                    0, 7.48, 15.72, 24.01, 0, 17.58, 0, 15.77, 10.25, 6.13, 3.06
                    ], 
                   ['2018-07',
                    0, 13.62, 18.49, 24.6, 0, 15.64, 0, 12.01, 6.73, 5.64, 3.26
                    ], 
                   ['2018-08',
                    0, 9.6, 18.1, 23.08, 0, 15.95, 0, 12.17, 8.92, 6.98, 5.19
                    ], 
                   ['2018-09',
                    0, 10.47, 17.91, 24.62, 0, 16.03, 0, 11.13, 8.71, 5.81, 5.32
                    ], 
                   ['2018-10',
                    0, 8.3, 18.61, 25.15, 0, 17.03, 0, 13.48, 7.68, 5.93, 3.82
                    ], 
                   ['2018-11',
                    0, 5.39, 16.26, 21.75, 0, 19.57, 0, 17.95, 8.98, 5.6, 4.51
                    ], 
                   ['2018-12',
                    0, 4.76, 12.49, 20.05, 0, 22.49, 0, 19.58, 10.28, 6.8, 3.54
                    ], 
                   ['2019-01',
                    0, 4.51, 14.42, 19.52, 0, 21.58, 0, 19.08, 9.51, 6.28, 5.1
                    ], 
                   ['2019-02',
                    0, 4.15, 13.42, 20.88, 0, 19.99, 0, 19.15, 9.97, 6.85, 5.59
                    ], 
                   ['2019-03',
                    0, 4.47, 13.36, 19.63, 1.18, 19.87, 1.72, 17.16, 10.07, 7.13, 5.41
                    ], 
                   ['2019-04',
                    1.66, 5.52, 15.09, 16.16, 12.73, 13.62, 11.23, 10.97, 6.48, 3.9, 2.65
                    ], 
                   ['2019-05',
                    1.86, 6.06, 14.4, 13.63, 14.19, 14.12, 12.09, 12.09, 5.47, 3.71, 2.38
                    ], 
                   ['2019-06',
                    1.09, 6.17, 12.97, 14.73, 14.49, 14.22, 12.3, 12.62, 5.78, 3.71, 1.91
                    ], 
                   ['2019-07',
                    1.22, 3.92, 13.46, 15.29, 14.48, 15.41, 12.36, 12.2, 6.13, 3.5, 2.02
                    ], 
                   ['2019-08',
                    1.55, 6.44, 13.1, 14.52, 13.42, 13.97, 11.45, 12.84, 6.11, 4.37, 2.23
                    ], 
                   ['2019-09',
                    1.17, 4.43, 13.43, 13.32, 13.74, 14.03, 12.79, 13.28, 7.16, 4.18, 2.48
                    ], 
                   ['2019-10',
                    1.63, 3.29, 15.85, 13.52, 15.5, 14.51, 10.93, 11.39, 6.65, 4.67, 2.05
                    ], 
                   ['2019-11',
                    2.08, 3.04, 23.23, 12.87, 14.16, 13.63, 10.85, 11.05, 4.7, 2.71, 1.65
                    ], 
                   ['2019-12',
                    1.49, 3.73, 19.18, 12.23, 13.39, 15.54, 12.83, 11.43, 5.23, 2.89, 2.05
                    ], 
                   ['2020-01',
                    1.4, 4.19, 15.11, 13.9, 14.6, 14.52, 12.58, 11.61, 4.82, 4.35, 2.91
                    ], 
                   ['2020-02',
                    1.89, 3.57, 16.01, 12.48, 14.08, 13.86, 13.22, 12.33, 5.01, 4.57, 2.97
                    ], 
                   ['2020-03',
                    1.61, 3.56, 16.21, 11.67, 15.51, 14.84, 11.35, 11.16, 6.15, 4.7, 3.25
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba úrokových měr v čase podle počtu úvěrů',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-15-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart15);
    function drawCOLUMN3Chart16() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 109, 0, 68, 0, 44, 40, 60, 0
                    ], 
                   ['2016-03',
                    0, 3, 18, 68, 0, 53, 0, 64, 30, 35, 14
                    ], 
                   ['2016-04',
                    0, 1, 33, 62, 0, 38, 0, 29, 42, 20, 14
                    ], 
                   ['2016-05',
                    0, 3, 35, 82, 0, 52, 0, 39, 38, 31, 28
                    ], 
                   ['2016-06',
                    0, 12, 26, 56, 0, 43, 0, 39, 35, 35, 16
                    ], 
                   ['2016-07',
                    0, 7, 35, 56, 0, 33, 0, 33, 22, 17, 20
                    ], 
                   ['2016-08',
                    0, 11, 33, 57, 0, 41, 0, 39, 37, 22, 27
                    ], 
                   ['2016-09',
                    0, 9, 30, 57, 0, 41, 0, 44, 26, 15, 12
                    ], 
                   ['2016-10',
                    0, 6, 42, 62, 0, 40, 0, 32, 38, 26, 25
                    ], 
                   ['2016-11',
                    0, 8, 41, 102, 0, 79, 0, 57, 55, 51, 30
                    ], 
                   ['2016-12',
                    0, 7, 43, 98, 0, 85, 0, 61, 69, 60, 32
                    ], 
                   ['2017-01',
                    0, 8, 58, 85, 0, 66, 0, 64, 42, 46, 27
                    ], 
                   ['2017-02',
                    0, 13, 53, 111, 0, 68, 0, 52, 35, 27, 21
                    ], 
                   ['2017-03',
                    0, 14, 57, 102, 0, 53, 0, 46, 48, 46, 30
                    ], 
                   ['2017-04',
                    0, 23, 62, 86, 0, 85, 0, 59, 35, 23, 19
                    ], 
                   ['2017-05',
                    0, 58, 112, 225, 0, 136, 0, 104, 77, 64, 23
                    ], 
                   ['2017-06',
                    0, 77, 127, 279, 0, 174, 0, 151, 88, 62, 34
                    ], 
                   ['2017-07',
                    0, 65, 149, 279, 0, 174, 0, 140, 74, 53, 31
                    ], 
                   ['2017-08',
                    0, 73, 161, 337, 0, 198, 0, 175, 110, 67, 30
                    ], 
                   ['2017-09',
                    0, 68, 174, 355, 0, 225, 0, 166, 118, 87, 37
                    ], 
                   ['2017-10',
                    0, 97, 189, 379, 0, 295, 0, 216, 140, 110, 30
                    ], 
                   ['2017-11',
                    0, 142, 265, 474, 0, 315, 0, 250, 167, 105, 60
                    ], 
                   ['2017-12',
                    0, 102, 179, 341, 0, 239, 0, 215, 145, 87, 38
                    ], 
                   ['2018-01',
                    0, 93, 178, 356, 0, 244, 0, 216, 136, 75, 47
                    ], 
                   ['2018-02',
                    0, 88, 192, 353, 0, 263, 0, 217, 144, 85, 46
                    ], 
                   ['2018-03',
                    0, 145, 224, 440, 0, 339, 0, 268, 220, 139, 74
                    ], 
                   ['2018-04',
                    0, 132, 229, 418, 0, 309, 0, 260, 199, 101, 71
                    ], 
                   ['2018-05',
                    0, 135, 246, 464, 0, 310, 0, 281, 202, 133, 60
                    ], 
                   ['2018-06',
                    0, 149, 313, 478, 0, 350, 0, 314, 204, 122, 61
                    ], 
                   ['2018-07',
                    0, 263, 357, 475, 0, 302, 0, 232, 130, 109, 63
                    ], 
                   ['2018-08',
                    0, 183, 345, 440, 0, 304, 0, 232, 170, 133, 99
                    ], 
                   ['2018-09',
                    0, 173, 296, 407, 0, 265, 0, 184, 144, 96, 88
                    ], 
                   ['2018-10',
                    0, 189, 424, 573, 0, 388, 0, 307, 175, 135, 87
                    ], 
                   ['2018-11',
                    0, 153, 462, 618, 0, 556, 0, 510, 255, 159, 128
                    ], 
                   ['2018-12',
                    0, 82, 215, 345, 0, 387, 0, 337, 177, 117, 61
                    ], 
                   ['2019-01',
                    0, 92, 294, 398, 0, 440, 0, 389, 194, 128, 104
                    ], 
                   ['2019-02',
                    0, 89, 288, 448, 0, 429, 0, 411, 214, 147, 120
                    ], 
                   ['2019-03',
                    0, 114, 341, 501, 30, 507, 44, 438, 257, 182, 138
                    ], 
                   ['2019-04',
                    45, 150, 410, 439, 346, 370, 305, 298, 176, 106, 72
                    ], 
                   ['2019-05',
                    53, 173, 411, 389, 405, 403, 345, 345, 156, 106, 68
                    ], 
                   ['2019-06',
                    28, 158, 332, 377, 371, 364, 315, 323, 148, 95, 49
                    ], 
                   ['2019-07',
                    38, 122, 419, 476, 451, 480, 385, 380, 191, 109, 63
                    ], 
                   ['2019-08',
                    48, 199, 405, 449, 415, 432, 354, 397, 189, 135, 69
                    ], 
                   ['2019-09',
                    33, 125, 379, 376, 388, 396, 361, 375, 202, 118, 70
                    ], 
                   ['2019-10',
                    46, 93, 448, 382, 438, 410, 309, 322, 188, 132, 58
                    ], 
                   ['2019-11',
                    63, 92, 702, 389, 428, 412, 328, 334, 142, 82, 50
                    ], 
                   ['2019-12',
                    32, 80, 411, 262, 287, 333, 275, 245, 112, 62, 44
                    ], 
                   ['2020-01',
                    36, 108, 389, 358, 376, 374, 324, 299, 124, 112, 75
                    ], 
                   ['2020-02',
                    51, 96, 431, 336, 379, 373, 356, 332, 135, 123, 80
                    ], 
                   ['2020-03',
                    41, 91, 414, 298, 396, 379, 290, 285, 157, 120, 83
                    ]
        ]);
        var options = {
            chart: {
                title: 'Počet půjček v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Počet [ks]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-16-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart16);
    function drawCOLUMN3Chart17() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '2.99 % p.a.', '3.99 % p.a.', '4.99 % p.a.', '5.99 % p.a.', '6.99 % p.a.', '8.49 % p.a.', '9.49 % p.a.', '10.99 % p.a.', '13.49 % p.a.', '15.49 % p.a.', '19.99 % p.a.'],
                   ['2016-02',
                    0, 0, 0, 14.362999999999998, 0, 8.607000000000001, 0, 5.160000000000002, 4.072000000000002, 5.755000000000001, 0
                    ], 
                   ['2016-03',
                    0, 0.52, 2.7749999999999995, 10.094999999999997, 0, 8.319999999999999, 0, 8.456, 2.857, 3.905, 1.44
                    ], 
                   ['2016-04',
                    0, 0.21, 4.84, 10.290000000000001, 0, 5.680000000000001, 0, 3.46, 5.575, 2.2870000000000004, 1.187
                    ], 
                   ['2016-05',
                    0, 0.445, 6.424999999999998, 12.72, 0, 7.469999999999999, 0, 5.1850000000000005, 3.4409999999999994, 2.9599999999999995, 2.595
                    ], 
                   ['2016-06',
                    0, 2.8849999999999993, 4.0600000000000005, 10.155, 0, 6.099999999999998, 0, 4.825, 3.420000000000001, 3.870000000000001, 1.1950000000000003
                    ], 
                   ['2016-07',
                    0, 1.455, 6.3050000000000015, 8.462000000000002, 0, 4.567000000000001, 0, 4.015000000000001, 2.8859999999999997, 1.461, 1.91
                    ], 
                   ['2016-08',
                    0, 1.675, 5.859999999999999, 8.165000000000001, 0, 5.737, 0, 4.856000000000001, 3.8949999999999996, 1.6350000000000002, 1.9200000000000002
                    ], 
                   ['2016-09',
                    0, 1.56, 5.010000000000001, 8.361000000000002, 0, 5.5, 0, 5.168999999999998, 2.6300000000000003, 1.1500000000000004, 0.9200000000000002
                    ], 
                   ['2016-10',
                    0, 1.08, 6.749999999999999, 10.03, 0, 5.197999999999999, 0, 4.029999999999999, 3.5850000000000004, 2.6900000000000004, 1.9990000000000006
                    ], 
                   ['2016-11',
                    0, 1.3499999999999999, 7.975, 17.544999999999995, 0, 11.614999999999998, 0, 6.946, 6.214999999999999, 5.294999999999997, 1.7100000000000004
                    ], 
                   ['2016-12',
                    0, 2.1350000000000002, 8.110000000000001, 17.139999999999997, 0, 14.170000000000002, 0, 8.275, 7.039999999999999, 4.83, 2.3949999999999996
                    ], 
                   ['2017-01',
                    0, 1.9200000000000002, 11.269999999999998, 15.130000000000003, 0, 9.605, 0, 7.654999999999999, 4.17, 3.765, 1.7300000000000004
                    ], 
                   ['2017-02',
                    0, 2.615, 9.290000000000001, 18.844999999999985, 0, 10.879999999999997, 0, 5.530000000000001, 3.185, 1.9799999999999998, 1.165
                    ], 
                   ['2017-03',
                    0, 3.1400000000000006, 9.929999999999994, 14.964999999999993, 0, 6.88, 0, 5.089999999999999, 5.425000000000001, 3.17, 1.8600000000000003
                    ], 
                   ['2017-04',
                    0, 6.43, 10.99, 13.045, 0, 11.785000000000007, 0, 6.559999999999998, 3.6950000000000007, 1.84, 0.965
                    ], 
                   ['2017-05',
                    0, 13.979999999999997, 23.984999999999996, 40.209999999999994, 0, 18.580000000000002, 0, 11.364999999999998, 7.879999999999997, 5.214999999999997, 1.0350000000000001
                    ], 
                   ['2017-06',
                    0, 16.869999999999994, 22.685, 49.18, 0, 24.409999999999997, 0, 16.900000000000002, 8.814999999999994, 4.804999999999998, 1.8150000000000006
                    ], 
                   ['2017-07',
                    0, 12.584999999999999, 29.365000000000002, 46.29, 0, 23.13499999999998, 0, 16.309999999999985, 7.009999999999998, 4.099999999999999, 1.085
                    ], 
                   ['2017-08',
                    0, 16.109999999999996, 29.480000000000015, 57.43999999999998, 0, 26.509999999999973, 0, 22.360000000000014, 10.245000000000001, 5.469999999999999, 1.3900000000000003
                    ], 
                   ['2017-09',
                    0, 15.95, 36.519999999999996, 64.545, 0, 32.79999999999999, 0, 18.799999999999986, 10.434999999999995, 6.5249999999999995, 1.3900000000000008
                    ], 
                   ['2017-10',
                    0, 25.12, 40.420000000000016, 67.41000000000001, 0, 45.559999999999995, 0, 25.59999999999998, 15.039999999999997, 8.459999999999994, 1.4350000000000005
                    ], 
                   ['2017-11',
                    0, 33.125000000000014, 53.86500000000005, 85.265, 0, 42.59999999999999, 0, 30.27999999999998, 15.604999999999988, 7.7149999999999945, 3.1050000000000004
                    ], 
                   ['2017-12',
                    0, 23.380000000000003, 37.21, 59.11500000000001, 0, 33.37000000000001, 0, 22.805000000000003, 14.214999999999995, 6.689999999999997, 1.8650000000000007
                    ], 
                   ['2018-01',
                    0, 22.34, 33.98499999999998, 62.665000000000006, 0, 37.69500000000004, 0, 29.830000000000016, 15.874999999999988, 6.304999999999996, 3.279999999999999
                    ], 
                   ['2018-02',
                    0, 22.719999999999995, 41.38, 66.32000000000001, 0, 40.84000000000001, 0, 28.18, 18.624999999999996, 8.264999999999999, 2.969999999999999
                    ], 
                   ['2018-03',
                    0, 33.09499999999999, 42.175, 82.065, 0, 50.074999999999996, 0, 34.31499999999999, 23.299999999999994, 13.054999999999998, 4.7299999999999995
                    ], 
                   ['2018-04',
                    0, 31.994999999999987, 44.88000000000001, 72.11, 0, 45.125000000000014, 0, 29.769999999999982, 22.334999999999965, 8.225, 4.049999999999999
                    ], 
                   ['2018-05',
                    0, 29.484999999999992, 48.209999999999965, 73.64, 0, 40.19500000000001, 0, 31.319999999999983, 20.509999999999984, 11.674999999999999, 3.1749999999999994
                    ], 
                   ['2018-06',
                    0, 32.19999999999999, 58.85500000000004, 78.86500000000002, 0, 48.794999999999995, 0, 35, 18.60999999999999, 9.744999999999992, 2.885
                    ], 
                   ['2018-07',
                    0, 58.675, 66.25500000000001, 76.76499999999989, 0, 40.43500000000001, 0, 26.439999999999994, 10.339999999999993, 7.624999999999996, 3.689999999999999
                    ], 
                   ['2018-08',
                    0, 41.82499999999999, 67.36000000000004, 74.94000000000007, 0, 41.63499999999997, 0, 27.040000000000006, 14.119999999999989, 8.944999999999988, 5.6699999999999955
                    ], 
                   ['2018-09',
                    0, 44.004999999999974, 62.14499999999997, 66.55500000000004, 0, 35.28500000000002, 0, 21.939999999999998, 13.159999999999988, 7.439999999999995, 4.925
                    ], 
                   ['2018-10',
                    0, 52.855000000000004, 84.62, 99.68999999999994, 0, 51.855000000000054, 0, 29.884999999999998, 16.80999999999998, 8.619999999999985, 5.3249999999999975
                    ], 
                   ['2018-11',
                    0, 38.13999999999999, 93.95999999999991, 110.40500000000003, 0, 71.35000000000008, 0, 50.16500000000005, 22.924999999999986, 10.364999999999988, 6.419999999999993
                    ], 
                   ['2018-12',
                    0, 19.305000000000003, 41.660000000000025, 56.980000000000025, 0, 48.12000000000001, 0, 33.76999999999996, 13.699999999999982, 6.419999999999991, 3.1950000000000007
                    ], 
                   ['2019-01',
                    0, 22.474999999999998, 57.67500000000001, 69.08500000000004, 0, 58.23000000000002, 0, 39.65000000000002, 16.31999999999999, 8.944999999999988, 4.6149999999999975
                    ], 
                   ['2019-02',
                    0, 22.790000000000006, 61.74000000000004, 76.47000000000003, 0, 54.584999999999965, 0, 47.320000000000086, 22.05, 11.429999999999993, 6.484999999999992
                    ], 
                   ['2019-03',
                    0, 28.259999999999998, 71.55000000000001, 86.74500000000006, 5.389999999999999, 68.61500000000001, 5.805000000000001, 48.84000000000004, 23.384999999999973, 11.894999999999989, 8.269999999999992
                    ], 
                   ['2019-04',
                    13.014999999999999, 44.67999999999999, 81.65499999999996, 78.03, 52.73499999999999, 52.90000000000001, 37.35500000000001, 31.984999999999992, 15.584999999999992, 7.459999999999991, 3.5099999999999985
                    ], 
                   ['2019-05',
                    15.309999999999997, 48.845000000000034, 86.51000000000009, 68.46, 63.73500000000007, 56.5500000000001, 43.90000000000001, 36.20999999999999, 11.709999999999994, 6.869999999999995, 3.795
                    ], 
                   ['2019-06',
                    7.565000000000001, 38.71499999999999, 69.81500000000003, 63.340000000000025, 56.12500000000002, 46.57, 34.485000000000014, 33.504999999999995, 10.73999999999999, 6.449999999999995, 2.2900000000000005
                    ], 
                   ['2019-07',
                    9.385000000000002, 29.94499999999999, 87.73999999999997, 84.92499999999998, 67.30000000000005, 62.80500000000006, 42.550000000000004, 36.419999999999995, 15.22999999999999, 6.154999999999996, 3.7499999999999996
                    ], 
                   ['2019-08',
                    13.635000000000002, 47.48000000000003, 85.55499999999996, 76.68500000000002, 64.49000000000001, 57.21500000000006, 44.48000000000007, 39.08500000000002, 13.769999999999985, 9.184999999999995, 3.075
                    ], 
                   ['2019-09',
                    6.825, 29.430000000000003, 83.7, 67.915, 63.45, 47.26499999999999, 40.515000000000036, 35.07499999999999, 16.294999999999977, 7.274999999999992, 4.140000000000001
                    ], 
                   ['2019-10',
                    12.829999999999997, 21.999999999999993, 88.43000000000009, 62.255, 68.055, 52.085000000000065, 36.32999999999999, 28.639999999999997, 14.02999999999999, 8.17999999999999, 3.044999999999999
                    ], 
                   ['2019-11',
                    14.295, 19.785000000000004, 191.84000000000023, 58.63500000000005, 53.245000000000054, 47.905000000000086, 31.69999999999999, 24.78499999999998, 9.514999999999992, 4.804999999999998, 2.425
                    ], 
                   ['2019-12',
                    8.045, 18.914999999999992, 103.74500000000006, 39.68000000000003, 42.58, 39.90499999999999, 26.044999999999984, 20.844999999999995, 8.28, 3.285, 1.8950000000000005
                    ], 
                   ['2020-01',
                    8.525, 33.779999999999994, 91.35000000000004, 64.09500000000001, 61.22500000000006, 53.41500000000005, 39.26999999999997, 24.794999999999966, 9.129999999999995, 7.579999999999996, 2.9749999999999996
                    ], 
                   ['2020-02',
                    15.799999999999997, 31.439999999999998, 106.30000000000003, 66.45499999999998, 65.69000000000003, 52.42000000000002, 47.33500000000001, 36.67500000000003, 11.244999999999992, 8.149999999999995, 3.794999999999999
                    ], 
                   ['2020-03',
                    11.405, 22.664999999999992, 98.3800000000001, 54.075000000000024, 66.50499999999998, 55.17000000000006, 36.109999999999985, 29.365000000000002, 12.079999999999998, 8.059999999999993, 4.039999999999998
                    ]
        ]);
        var options = {
            chart: {
                title: 'Objem půjček v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Objem [mio. Kč]'}
                },
            },
                        series: {
                0: { color: '#c0498b'},
                1: { color: '#8b59be'},
                2: { color: '#596abe'},
                3: { color: '#599ebe'},
                4: { color: '#5abfa0'},
                5: { color: '#67cd75'},
                6: { color: '#91c95a'},
                7: { color: '#cebe5a'},
                8: { color: '#d7954b'},
                9: { color: '#e75637'},
                10: { color: '#d12f2f'}
            }
,
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-17-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart17);
    function drawCOLUMN3Chart18() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Auto-moto', 'Cestování', 'Domácnost', 'Elektronika', 'Jiné', 'Refinancování půjček', 'Vlastní projekt', 'Vzdělání', 'Zdraví'],
                   ['2016-02',
                    13.08, 0.93, 7.48, 4.67, 9.03, 46.42, 13.08, 2.18, 3.12
                    ], 
                   ['2016-03',
                    18.6, 0.35, 14.39, 2.11, 14.39, 38.6, 10.18, 0.7, 0.7
                    ], 
                   ['2016-04',
                    22.59, 0.42, 10.04, 2.51, 9.21, 46.44, 5.86, 1.67, 1.26
                    ], 
                   ['2016-05',
                    21.43, 0.97, 12.66, 1.62, 11.69, 41.56, 7.79, 0.97, 1.3
                    ], 
                   ['2016-06',
                    22.14, 1.53, 17.18, 0.76, 11.83, 35.5, 8.78, 1.15, 1.15
                    ], 
                   ['2016-07',
                    24.66, 0, 16.59, 2.24, 8.07, 37.67, 8.52, 0.9, 1.35
                    ], 
                   ['2016-08',
                    18.35, 0.37, 16.1, 1.5, 11.61, 44.19, 7.12, 0.37, 0.37
                    ], 
                   ['2016-09',
                    23.08, 0.85, 13.68, 1.71, 11.54, 36.32, 8.55, 1.28, 2.99
                    ], 
                   ['2016-10',
                    23.25, 1.11, 17.71, 4.06, 8.49, 37.64, 4.8, 1.48, 1.48
                    ], 
                   ['2016-11',
                    17.26, 0.24, 14.42, 3.31, 9.46, 46.1, 8.04, 0.47, 0.71
                    ], 
                   ['2016-12',
                    15.6, 0.44, 16.04, 1.1, 12.09, 46.15, 6.59, 1.1, 0.88
                    ], 
                   ['2017-01',
                    19.95, 0.51, 19.7, 2.02, 14.39, 34.85, 6.57, 0.76, 1.26
                    ], 
                   ['2017-02',
                    20.26, 1.05, 17.37, 1.84, 8.16, 41.32, 7.37, 1.58, 1.05
                    ], 
                   ['2017-03',
                    24.24, 0.76, 21.72, 2.02, 11.11, 35.1, 3.54, 0.51, 1.01
                    ], 
                   ['2017-04',
                    21.17, 1.02, 19.13, 3.32, 10.46, 40.05, 3.32, 0.77, 0.77
                    ], 
                   ['2017-05',
                    24.66, 1, 17.4, 1.5, 10.39, 38.05, 5.13, 0.38, 1.5
                    ], 
                   ['2017-06',
                    22.38, 1.71, 20.16, 1.92, 10.38, 34.98, 4.94, 2.12, 1.41
                    ], 
                   ['2017-07',
                    21.87, 2.59, 24.66, 1.14, 13.99, 26.01, 6.63, 1.35, 1.76
                    ], 
                   ['2017-08',
                    22.76, 1.48, 21.55, 2.17, 14.25, 27.63, 7.21, 1.39, 1.56
                    ], 
                   ['2017-09',
                    22.76, 1.06, 26.02, 0.73, 14.39, 25.61, 7.15, 1.38, 0.89
                    ], 
                   ['2017-10',
                    21.98, 0.62, 25.69, 1.72, 13.39, 28.43, 5.98, 0.69, 1.51
                    ], 
                   ['2017-11',
                    20.87, 0.51, 22.38, 1.63, 19.52, 27.62, 5.01, 1.12, 1.35
                    ], 
                   ['2017-12',
                    4.09, 0.15, 4.83, 0.22, 63.67, 25.19, 1.26, 0.07, 0.52
                    ], 
                   ['2018-01',
                    14.42, 0.59, 15.09, 0.89, 38.07, 24.91, 3.94, 1.04, 1.04
                    ], 
                   ['2018-02',
                    24.35, 0.94, 24.78, 1.44, 13.4, 26.95, 6.41, 0.72, 1.01
                    ], 
                   ['2018-03',
                    25.47, 0.81, 26.07, 1.41, 13.52, 24.55, 5.52, 1.14, 1.51
                    ], 
                   ['2018-04',
                    26.35, 1.45, 25.19, 1.63, 13.21, 21.99, 7.68, 0.99, 1.51
                    ], 
                   ['2018-05',
                    25.56, 2.24, 26.6, 1.37, 13.44, 21.85, 6.83, 0.82, 1.31
                    ], 
                   ['2018-06',
                    24.06, 2.06, 26.07, 1.05, 16.17, 21.45, 5.88, 1.31, 1.96
                    ], 
                   ['2018-07',
                    25.95, 2.59, 26.83, 0.88, 14.45, 20.97, 5.49, 1.14, 1.71
                    ], 
                   ['2018-08',
                    23.71, 2.31, 25.76, 1.26, 14.85, 23.61, 5.4, 1.52, 1.57
                    ], 
                   ['2018-09',
                    21.66, 1.09, 26.56, 1.57, 16.27, 25.35, 4.48, 1.51, 1.51
                    ], 
                   ['2018-10',
                    21.73, 1.27, 24.76, 2.15, 17.43, 24.32, 5.4, 1.4, 1.54
                    ], 
                   ['2018-11',
                    20.94, 0.53, 27.63, 1.58, 19.08, 22.63, 5.28, 1.02, 1.3
                    ], 
                   ['2018-12',
                    20.16, 1.1, 27.54, 2.44, 21.73, 18.54, 6.1, 1.1, 1.28
                    ], 
                   ['2019-01',
                    22.41, 2.26, 26.48, 1.62, 18.24, 20.11, 6.03, 1.47, 1.37
                    ], 
                   ['2019-02',
                    23.67, 1.58, 26.05, 1.3, 19.06, 19.66, 5.87, 1.4, 1.4
                    ], 
                   ['2019-03',
                    25.86, 0.71, 26.1, 1.53, 19.24, 18.5, 5.8, 1.02, 1.25
                    ], 
                   ['2019-04',
                    24.29, 1.66, 24.11, 1.18, 20.65, 18.84, 6.29, 1.21, 1.77
                    ], 
                   ['2019-05',
                    22.46, 1.79, 25.79, 1.82, 19.59, 19.13, 6.34, 1.19, 1.89
                    ], 
                   ['2019-06',
                    22.66, 3.55, 27.34, 1.25, 19.88, 16.41, 5.7, 1.48, 1.72
                    ], 
                   ['2019-07',
                    24.05, 3.85, 28.07, 1.48, 15.74, 18.21, 5.36, 1.32, 1.93
                    ], 
                   ['2019-08',
                    23.97, 2.52, 28.14, 1.36, 17.08, 18.86, 4.98, 1.52, 1.58
                    ], 
                   ['2019-09',
                    24.8, 1.38, 28.69, 2.16, 15.23, 18.63, 5.6, 1.74, 1.77
                    ], 
                   ['2019-10',
                    22.26, 1.34, 31, 1.98, 14.83, 21.09, 4.6, 1.34, 1.56
                    ], 
                   ['2019-11',
                    20.58, 0.89, 29.12, 2.55, 16.15, 22.67, 4.5, 1.72, 1.82
                    ], 
                   ['2019-12',
                    21.37, 1.07, 28.04, 2.61, 16.99, 21.7, 4.76, 1.4, 2.05
                    ], 
                   ['2020-01',
                    22.72, 1.79, 26.6, 1.67, 14.33, 24.35, 5.36, 1.59, 1.59
                    ], 
                   ['2020-02',
                    21.84, 1, 25.15, 1.45, 13.26, 29.53, 4.9, 1.19, 1.67
                    ], 
                   ['2020-03',
                    20.44, 0.63, 27.49, 1.68, 15.58, 25.45, 5.95, 0.74, 2.04
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba účelu ǘvěrů v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-18-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart18);
    function drawCOLUMN3Chart19() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Hlavní město Praha', 'Jihomoravský kraj', 'Jihočeský kraj', 'Karlovarský kraj', 'Kraj Vysočina', 'Královéhradecký kraj', 'Liberecký kraj', 'Moravskoslezský kraj', 'Olomoucký kraj', 'Pardubický kraj', 'Plzeňský kraj', 'Středočeský kraj', 'Zlínský kraj', 'Ústecký kraj'],
                   ['2016-02',
                    29.28, 9.66, 5.3, 2.18, 2.8, 2.18, 4.36, 10.9, 3.74, 2.8, 3.12, 12.46, 4.67, 6.54
                    ], 
                   ['2016-03',
                    21.05, 10.18, 5.96, 2.46, 3.16, 5.61, 4.91, 7.37, 4.21, 4.21, 4.21, 17.54, 3.86, 5.26
                    ], 
                   ['2016-04',
                    21.34, 8.79, 5.44, 1.26, 3.35, 4.6, 6.69, 11.3, 4.18, 4.18, 7.95, 11.72, 4.18, 5.02
                    ], 
                   ['2016-05',
                    18.18, 13.31, 4.87, 0.97, 1.3, 5.52, 3.9, 13.31, 6.17, 4.55, 5.52, 11.04, 6.49, 4.87
                    ], 
                   ['2016-06',
                    15.65, 13.74, 4.58, 1.91, 2.67, 1.91, 4.96, 12.98, 4.2, 5.73, 4.96, 14.12, 4.2, 8.4
                    ], 
                   ['2016-07',
                    18.39, 5.38, 4.04, 2.69, 2.24, 4.04, 3.59, 13.9, 6.73, 2.69, 4.04, 13.9, 5.38, 13
                    ], 
                   ['2016-08',
                    16.85, 8.61, 5.62, 2.62, 4.49, 6.37, 5.99, 6.74, 6.37, 4.12, 3.37, 16.48, 3, 9.36
                    ], 
                   ['2016-09',
                    15.38, 11.11, 8.12, 1.71, 2.99, 3.85, 5.13, 9.83, 5.98, 5.13, 2.99, 17.09, 5.13, 5.56
                    ], 
                   ['2016-10',
                    15.13, 11.81, 3.69, 2.58, 2.95, 2.58, 6.64, 12.92, 6.64, 7.01, 4.06, 14.39, 4.06, 5.54
                    ], 
                   ['2016-11',
                    14.89, 8.75, 4.73, 2.84, 3.31, 4.02, 4.73, 16.08, 4.49, 6.15, 4.96, 11.58, 4.73, 8.75
                    ], 
                   ['2016-12',
                    13.85, 12.09, 4.4, 3.08, 2.64, 4.4, 4.62, 12.53, 5.93, 4.18, 4.62, 13.19, 4.18, 10.33
                    ], 
                   ['2017-01',
                    15.91, 12.63, 3.03, 2.78, 2.78, 5.81, 4.55, 12.12, 5.3, 3.79, 4.8, 13.64, 3.79, 9.09
                    ], 
                   ['2017-02',
                    13.16, 11.84, 3.95, 3.16, 4.21, 3.16, 6.32, 11.84, 3.42, 4.47, 5, 14.47, 5, 10
                    ], 
                   ['2017-03',
                    12.63, 12.63, 5.05, 2.02, 5.81, 4.55, 4.8, 11.87, 4.8, 4.8, 4.29, 13.89, 4.29, 8.59
                    ], 
                   ['2017-04',
                    19.13, 7.91, 5.1, 3.83, 3.83, 5.36, 4.85, 9.95, 5.1, 4.59, 5.87, 11.48, 3.57, 9.44
                    ], 
                   ['2017-05',
                    15.02, 10.76, 5.13, 3.25, 3, 5.01, 5.38, 12.52, 4.38, 4.38, 5.26, 12.89, 4.51, 8.51
                    ], 
                   ['2017-06',
                    16.23, 9.68, 3.83, 3.43, 3.43, 4.44, 3.93, 12.9, 5.75, 4.84, 4.33, 13.61, 4.64, 8.97
                    ], 
                   ['2017-07',
                    11.61, 10.05, 6.22, 2.9, 4.15, 4.87, 5.28, 14.2, 5.7, 4.77, 4.25, 11.71, 5.39, 8.91
                    ], 
                   ['2017-08',
                    14.07, 10.51, 4, 3.56, 3.13, 4.26, 5.04, 14.51, 5.47, 4.17, 4.78, 13.99, 4.69, 7.82
                    ], 
                   ['2017-09',
                    12.44, 9.84, 4.47, 2.93, 3.82, 4.8, 3.82, 13.25, 6.42, 5.04, 4.47, 15.04, 4.63, 9.02
                    ], 
                   ['2017-10',
                    11.68, 11.26, 5.15, 3.09, 3.91, 4.6, 3.71, 12.29, 5.01, 4.12, 5.56, 15.38, 4.95, 9.27
                    ], 
                   ['2017-11',
                    11.81, 10.01, 5.06, 2.92, 3.26, 5.91, 4.89, 13.67, 5.74, 4.84, 4.61, 13.67, 4.33, 9.28
                    ], 
                   ['2017-12',
                    11.44, 10.1, 4.16, 3.19, 4.01, 4.61, 4.01, 13.97, 5.57, 4.61, 5.5, 14.93, 5.42, 8.47
                    ], 
                   ['2018-01',
                    13.75, 10.86, 4.54, 2.01, 3.27, 4.98, 4.46, 11.08, 6.62, 4.61, 5.13, 14.57, 4.68, 9.44
                    ], 
                   ['2018-02',
                    11.38, 10.3, 4.83, 2.67, 3.6, 4.47, 5.55, 14.41, 5.62, 3.96, 5.55, 13.76, 4.68, 9.22
                    ], 
                   ['2018-03',
                    12.6, 10.44, 4.43, 2.49, 4, 3.84, 4.87, 13.52, 5.79, 5.41, 5.19, 13.79, 4.6, 9.03
                    ], 
                   ['2018-04',
                    12.33, 11.58, 4.65, 3.32, 2.79, 3.61, 5.06, 12.74, 6.34, 5.24, 4.48, 15.13, 4.13, 8.61
                    ], 
                   ['2018-05',
                    12.18, 10.81, 4.42, 3.22, 3.5, 4.7, 4.7, 13.44, 5.73, 4.86, 4.42, 14.15, 4.97, 8.9
                    ], 
                   ['2018-06',
                    12.1, 9.74, 4.52, 3.62, 3.16, 4.42, 4.32, 13.16, 5.42, 4.32, 5.52, 16.32, 3.52, 9.84
                    ], 
                   ['2018-07',
                    10.51, 8.34, 4.3, 2.43, 4.04, 4.45, 4.97, 13.15, 6.58, 3.99, 5.39, 14.91, 6.11, 10.82
                    ], 
                   ['2018-08',
                    12.49, 9.34, 4.41, 3.2, 3.83, 4.88, 5.51, 13.17, 5.14, 5.3, 4.51, 13.9, 4.2, 10.13
                    ], 
                   ['2018-09',
                    11.07, 10.28, 4.6, 2.72, 3.09, 4.66, 5.57, 13.19, 6.84, 4.72, 4.78, 15.06, 5.2, 8.23
                    ], 
                   ['2018-10',
                    12.25, 10.23, 4.3, 2.5, 3.42, 4.96, 5.53, 11.76, 6.23, 4.3, 4.52, 15.72, 5.22, 9.04
                    ], 
                   ['2018-11',
                    10.42, 10.88, 4.54, 3.38, 4.22, 4.61, 4.29, 13.2, 5.03, 4.29, 5.21, 16.05, 5.39, 8.48
                    ], 
                   ['2018-12',
                    12.26, 10.34, 6.16, 2.73, 4.94, 5.87, 4.82, 12.14, 5.69, 4.07, 5.29, 13.65, 4.42, 7.61
                    ], 
                   ['2019-01',
                    11.18, 10.54, 5.79, 2.4, 3.43, 4.61, 4.76, 11.38, 6.57, 4.81, 4.76, 15.6, 4.76, 9.42
                    ], 
                   ['2019-02',
                    11.98, 10.25, 4.43, 2.94, 3.36, 3.87, 4.15, 12.4, 6.01, 4.52, 5.64, 16.12, 4.85, 9.51
                    ], 
                   ['2019-03',
                    11.56, 10.93, 5.37, 3.33, 3.88, 4.66, 4.74, 12.3, 5.53, 4.19, 4.23, 15.13, 4.78, 9.37
                    ], 
                   ['2019-04',
                    11.74, 9.39, 4.97, 3.42, 4.34, 4.49, 5.37, 12.59, 4.64, 4.45, 5.15, 14.91, 4.86, 9.68
                    ], 
                   ['2019-05',
                    11.42, 9.6, 5.26, 3.08, 4.06, 4.31, 5.4, 11.49, 6.24, 4.38, 5.96, 14.65, 4.56, 9.6
                    ], 
                   ['2019-06',
                    10.78, 10.27, 4.18, 3.4, 3.71, 4.8, 5.39, 13.2, 5.47, 4.73, 4.92, 14.57, 4.84, 9.73
                    ], 
                   ['2019-07',
                    9.41, 9.96, 5.14, 3.6, 3.69, 5.07, 5.2, 12.17, 6.65, 4.56, 5.62, 14.55, 5.39, 8.99
                    ], 
                   ['2019-08',
                    9.64, 9.18, 5.4, 3.14, 4.27, 4.27, 5.14, 12.42, 6.05, 4.3, 5.79, 16.14, 4.33, 9.93
                    ], 
                   ['2019-09',
                    10.95, 10.02, 4.39, 3.4, 3.9, 3.75, 4.5, 12.26, 6.23, 4.61, 5.6, 15.37, 4.75, 10.27
                    ], 
                   ['2019-10',
                    9.09, 9.52, 4.99, 3.43, 4.03, 4.78, 4.78, 12.99, 6.65, 4.81, 4.95, 15.39, 5.7, 8.88
                    ], 
                   ['2019-11',
                    10.92, 10.19, 5.2, 3.08, 4.2, 5.03, 4.67, 12.87, 5.82, 4.04, 5.39, 14.92, 4.86, 8.8
                    ], 
                   ['2019-12',
                    10.97, 9.33, 4.57, 2.61, 4.85, 5.23, 5.32, 11.71, 5.69, 4.06, 5.27, 16.29, 4.43, 9.66
                    ], 
                   ['2020-01',
                    9.9, 10.91, 5.55, 3.03, 5.05, 5.59, 3.53, 12.62, 5.83, 4.43, 4.78, 14.37, 5.13, 9.28
                    ], 
                   ['2020-02',
                    9.84, 9.92, 5.91, 2.97, 3.86, 4.83, 4.94, 11.52, 6.24, 4.79, 5.24, 15.16, 5.2, 9.58
                    ], 
                   ['2020-03',
                    9.67, 10.73, 4.89, 3.17, 4.35, 5.09, 3.99, 11.63, 6.5, 5.29, 5.52, 15.15, 4.58, 9.44
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba krajů v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-19-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart19);
    function drawCOLUMN3Chart20() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'Důchod', 'Jiné', 'Nezaměstnaný', 'OSVČ', 'Podnikatel', 'Rodičovská dovolená', 'Student', 'Svobodné povolání', 'Zaměstnanec'],
                   ['2016-02',
                    1.56, 1.87, 0, 33.96, 7.79, 0.31, 0.62, 0.62, 53.27
                    ], 
                   ['2016-03',
                    0.7, 2.11, 0, 25.26, 5.26, 2.11, 0, 1.05, 63.51
                    ], 
                   ['2016-04',
                    2.51, 1.26, 0, 13.39, 4.6, 0.42, 0.84, 0.42, 76.57
                    ], 
                   ['2016-05',
                    3.25, 0.97, 0, 17.21, 3.9, 1.62, 0.32, 1.62, 71.1
                    ], 
                   ['2016-06',
                    1.91, 0.38, 0, 17.94, 5.73, 2.29, 0.76, 1.15, 69.85
                    ], 
                   ['2016-07',
                    3.14, 1.35, 0, 17.04, 6.73, 0.9, 0.45, 0.45, 69.96
                    ], 
                   ['2016-08',
                    3.75, 0.37, 0, 15.73, 4.49, 0.75, 0, 0.75, 74.16
                    ], 
                   ['2016-09',
                    2.14, 0.85, 0, 15.81, 3.42, 1.28, 0, 0.43, 76.07
                    ], 
                   ['2016-10',
                    3.32, 1.11, 0, 14.76, 3.32, 2.21, 1.48, 0.37, 73.43
                    ], 
                   ['2016-11',
                    4.26, 1.18, 0, 18.68, 3.55, 2.13, 0.24, 0.24, 69.74
                    ], 
                   ['2016-12',
                    5.05, 1.1, 0, 17.14, 4.4, 1.32, 0.22, 0, 70.77
                    ], 
                   ['2017-01',
                    3.28, 2.02, 0, 16.92, 2.02, 1.77, 0.25, 0.25, 73.48
                    ], 
                   ['2017-02',
                    5, 0.26, 0, 12.63, 2.37, 2.63, 0.53, 0.79, 75.79
                    ], 
                   ['2017-03',
                    3.79, 1.01, 0, 11.62, 1.52, 2.02, 0, 0, 80.05
                    ], 
                   ['2017-04',
                    5.36, 1.02, 0, 12.5, 2.81, 0.51, 0.26, 0, 77.55
                    ], 
                   ['2017-05',
                    3.75, 0.63, 0, 11.76, 2.13, 1.5, 0.38, 0.25, 79.6
                    ], 
                   ['2017-06',
                    3.83, 0.91, 0, 12.6, 2.22, 1.81, 0.5, 0.2, 77.92
                    ], 
                   ['2017-07',
                    4.35, 0.52, 0, 10.67, 2.69, 1.45, 0.1, 0.62, 79.59
                    ], 
                   ['2017-08',
                    4, 1.22, 0, 12.86, 2.35, 1.48, 0.26, 0.43, 77.41
                    ], 
                   ['2017-09',
                    3.5, 0.73, 0, 12.2, 2.2, 0.89, 0.33, 0.33, 79.84
                    ], 
                   ['2017-10',
                    6.11, 0.82, 0, 12.71, 1.79, 1.1, 0.48, 0.48, 76.51
                    ], 
                   ['2017-11',
                    5.79, 1.24, 0, 10.74, 1.91, 1.41, 0.28, 0.39, 78.23
                    ], 
                   ['2017-12',
                    7.8, 1.26, 0, 11.66, 1.56, 2.08, 0.22, 0.59, 74.81
                    ], 
                   ['2018-01',
                    5.43, 0.37, 0.22, 13.68, 1.86, 2.68, 0.3, 0.3, 75.17
                    ], 
                   ['2018-02',
                    5.26, 0.86, 0, 13.18, 1.37, 3.24, 0.29, 0.22, 75.58
                    ], 
                   ['2018-03',
                    4.38, 0.65, 0.05, 12.6, 1.78, 3.79, 0.49, 0.22, 76.04
                    ], 
                   ['2018-04',
                    4.71, 1.75, 0, 12.86, 2.27, 2.91, 0.52, 0.41, 74.58
                    ], 
                   ['2018-05',
                    4.53, 0.49, 0, 10.6, 1.26, 2.84, 0.38, 0.44, 79.46
                    ], 
                   ['2018-06',
                    4.12, 0.3, 0, 10.85, 1.56, 4.72, 0.05, 0.5, 77.9
                    ], 
                   ['2018-07',
                    4.97, 0.73, 0, 10.46, 1.66, 2.64, 0.16, 0.36, 79.03
                    ], 
                   ['2018-08',
                    5.61, 0.42, 0.05, 11.44, 1.36, 3.78, 0.31, 0.16, 76.86
                    ], 
                   ['2018-09',
                    5.32, 0.85, 0, 10.53, 1.21, 2.36, 0.24, 0.06, 79.43
                    ], 
                   ['2018-10',
                    5.88, 0.7, 0, 11.24, 1.05, 2.63, 0.35, 0.22, 77.92
                    ], 
                   ['2018-11',
                    5.98, 0.67, 0, 10.91, 1.27, 3.59, 0.28, 0.11, 77.19
                    ], 
                   ['2018-12',
                    4.76, 0.41, 0.06, 12.09, 1.92, 2.85, 0.17, 0.17, 77.57
                    ], 
                   ['2019-01',
                    4.07, 0.69, 0, 10.69, 1.37, 2.65, 0.1, 0.25, 80.19
                    ], 
                   ['2019-02',
                    5.55, 0.65, 0, 11.32, 1.35, 3.12, 0.42, 0.19, 77.4
                    ], 
                   ['2019-03',
                    5.53, 0.74, 0.04, 10.54, 1.1, 3.53, 0.12, 0.24, 78.17
                    ], 
                   ['2019-04',
                    5.67, 0.55, 0, 11.12, 1.18, 2.69, 0.18, 0.33, 78.28
                    ], 
                   ['2019-05',
                    5.33, 0.46, 0, 9.64, 1.26, 3.19, 0.04, 0.28, 79.82
                    ], 
                   ['2019-06',
                    5.35, 0.74, 0, 8.79, 1.05, 3.01, 0.16, 0.12, 80.78
                    ], 
                   ['2019-07',
                    4.88, 0.64, 0, 9.18, 1.38, 2.28, 0.13, 0.26, 81.25
                    ], 
                   ['2019-08',
                    5.56, 0.55, 0, 8.93, 0.94, 3.1, 0.1, 0.03, 80.79
                    ], 
                   ['2019-09',
                    5.35, 0.6, 0.07, 9.07, 1.13, 2.73, 0.35, 0.25, 80.45
                    ], 
                   ['2019-10',
                    5.66, 0.35, 0, 8.39, 0.81, 2.87, 0.39, 0.11, 81.42
                    ], 
                   ['2019-11',
                    5.56, 0.83, 0.07, 9.73, 1.26, 2.51, 0.1, 0.3, 79.65
                    ], 
                   ['2019-12',
                    5.74, 0.47, 0.05, 10.31, 0.93, 2.24, 0.23, 0.14, 79.89
                    ], 
                   ['2020-01',
                    3.92, 0.89, 0, 10.49, 1.28, 3.18, 0.23, 0.19, 79.81
                    ], 
                   ['2020-02',
                    4.12, 0.82, 0, 11.33, 0.85, 3.53, 0.26, 0.19, 78.9
                    ], 
                   ['2020-03',
                    5.79, 0.78, 0, 10.34, 1.41, 3.64, 0.12, 0.2, 77.72
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba zdrojů příjmu v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-20-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart20);
    function drawCOLUMN3Chart21() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', 'do 50 000,- Kč', '50 001,- až 100 000,- Kč', '100 001,- až 150 000,- Kč', '150 001,- až 200 000,- Kč', '200 001,- až 250 000,- Kč', '250 001,- až 300 000,- Kč', '300 001,- až 350 000,- Kč', '350 001,- až 400 000,- Kč', '400 001,- až 450 000,- Kč', '450 001,- až 500 000,- Kč', '500 001,- až 550 000,- Kč', '550 001,- až 600 000,- Kč', '600 001,- až 650 000,- Kč', '650 001,- až 700 000,- Kč', 'od 700 001,- Kč'],
                   ['2016-02',
                    26.79, 23.36, 15.26, 26.79, 5.3, 2.49, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-03',
                    21.75, 23.86, 20, 15.44, 7.72, 11.23, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-04',
                    17.57, 25.94, 20.5, 14.23, 9.62, 12.13, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-05',
                    22.73, 24.35, 17.53, 16.23, 7.79, 11.36, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-06',
                    22.9, 19.85, 18.32, 15.27, 10.69, 12.98, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-07',
                    18.39, 24.66, 17.49, 20.63, 8.07, 10.76, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-08',
                    25.09, 26.59, 15.36, 15.73, 8.61, 8.61, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-09',
                    24.79, 26.5, 14.53, 16.67, 7.69, 9.83, 0, 0, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-10',
                    25.46, 20.3, 20.66, 17.34, 6.27, 9.23, 0, 0.74, 0, 0, 0, 0, 0, 0, 0
                    ], 
                   ['2016-11',
                    19.15, 29.31, 15.84, 15.84, 7.57, 8.51, 1.42, 1.18, 0.24, 0.95, 0, 0, 0, 0, 0
                    ], 
                   ['2016-12',
                    24.4, 24.18, 14.51, 15.38, 6.81, 10.11, 1.54, 1.32, 0.44, 1.32, 0, 0, 0, 0, 0
                    ], 
                   ['2017-01',
                    20.96, 26.01, 15.91, 15.91, 7.83, 10.1, 1.01, 0.51, 0.76, 1.01, 0, 0, 0, 0, 0
                    ], 
                   ['2017-02',
                    20.79, 25.53, 16.32, 16.58, 8.42, 8.42, 1.32, 1.05, 0.53, 1.05, 0, 0, 0, 0, 0
                    ], 
                   ['2017-03',
                    23.99, 27.53, 17.93, 15.66, 4.8, 7.07, 1.52, 1.01, 0, 0.51, 0, 0, 0, 0, 0
                    ], 
                   ['2017-04',
                    24.23, 21.17, 19.13, 13.01, 8.42, 9.18, 1.28, 1.28, 1.02, 1.28, 0, 0, 0, 0, 0
                    ], 
                   ['2017-05',
                    22.78, 22.9, 14.77, 14.27, 7.51, 9.39, 2.63, 1.75, 1, 3, 0, 0, 0, 0, 0
                    ], 
                   ['2017-06',
                    23.89, 24.29, 14.62, 15.12, 6.65, 7.06, 2.62, 2.02, 1.01, 2.72, 0, 0, 0, 0, 0
                    ], 
                   ['2017-07',
                    26.11, 22.49, 15.03, 13.37, 7.25, 7.15, 2.28, 2.9, 1.14, 2.28, 0, 0, 0, 0, 0
                    ], 
                   ['2017-08',
                    25.37, 23.37, 15.38, 12.86, 7.12, 6.52, 3.13, 2.17, 1.04, 3.04, 0, 0, 0, 0, 0
                    ], 
                   ['2017-09',
                    26.34, 22.68, 13.33, 13.25, 6.91, 6.26, 2.76, 2.93, 2.03, 3.5, 0, 0, 0, 0, 0
                    ], 
                   ['2017-10',
                    26.03, 20.47, 13.12, 14.15, 8.04, 6.18, 3.23, 2.61, 1.44, 4.74, 0, 0, 0, 0, 0
                    ], 
                   ['2017-11',
                    27.39, 21.26, 13.95, 12.15, 7.03, 6.13, 3.71, 2.81, 1.35, 4.22, 0, 0, 0, 0, 0
                    ], 
                   ['2017-12',
                    26.82, 24.59, 12.63, 12.11, 6.09, 7.13, 3.27, 2.23, 1.93, 3.19, 0, 0, 0, 0, 0
                    ], 
                   ['2018-01',
                    25.5, 21.19, 14.42, 12.34, 6.47, 6.99, 4.39, 2.6, 1.78, 4.31, 0, 0, 0, 0, 0
                    ], 
                   ['2018-02',
                    22.98, 22.55, 13.9, 11.74, 6.7, 7.56, 3.39, 3.53, 2.31, 5.33, 0, 0, 0, 0, 0
                    ], 
                   ['2018-03',
                    24.82, 22.55, 14.76, 14.12, 6.33, 5.68, 2.97, 3.3, 1.73, 3.73, 0, 0, 0, 0, 0
                    ], 
                   ['2018-04',
                    26.47, 20.94, 15.13, 13.15, 7.1, 6.17, 2.97, 2.97, 1.4, 3.72, 0, 0, 0, 0, 0
                    ], 
                   ['2018-05',
                    27.36, 24.69, 14.15, 12.45, 5.9, 6.12, 2.84, 3, 0.98, 2.51, 0, 0, 0, 0, 0
                    ], 
                   ['2018-06',
                    28.33, 22.8, 14.47, 11.3, 7.13, 6.58, 3.01, 2.91, 1.05, 2.41, 0, 0, 0, 0, 0
                    ], 
                   ['2018-07',
                    25.38, 24.24, 13.15, 13.36, 6.89, 6.11, 3, 3.26, 0.93, 3.68, 0, 0, 0, 0, 0
                    ], 
                   ['2018-08',
                    28.38, 22.67, 13.12, 12.01, 6.77, 6.35, 3.04, 3.25, 1.1, 2.41, 0.26, 0.37, 0, 0.1, 0.16
                    ], 
                   ['2018-09',
                    27.59, 22.5, 13.07, 11.74, 6.05, 7.2, 3.02, 3.09, 1.27, 3.02, 0.42, 0.6, 0.12, 0.06, 0.24
                    ], 
                   ['2018-10',
                    29.5, 22.7, 11.81, 10.54, 6.89, 5.79, 3.29, 3.56, 1.49, 2.41, 0.53, 0.57, 0.18, 0.18, 0.57
                    ], 
                   ['2018-11',
                    33.02, 21.54, 12.71, 10.77, 5.39, 5.32, 3.31, 3.45, 1.23, 1.76, 0.18, 0.32, 0.46, 0.07, 0.49
                    ], 
                   ['2018-12',
                    36.9, 22.08, 11.85, 9.59, 5.64, 5.17, 2.38, 2.21, 1.05, 1.98, 0.17, 0.41, 0.23, 0.12, 0.23
                    ], 
                   ['2019-01',
                    32.07, 24.42, 12.51, 11.53, 5.1, 5.39, 2.89, 2.16, 0.98, 1.72, 0.15, 0.39, 0.05, 0.2, 0.44
                    ], 
                   ['2019-02',
                    30.71, 24.74, 12.26, 11.7, 5.68, 5.17, 2.14, 2.98, 0.93, 1.96, 0.47, 0.51, 0.19, 0.28, 0.28
                    ], 
                   ['2019-03',
                    31.19, 23.35, 12.23, 12.23, 5.76, 5.05, 2.98, 2.78, 1.49, 1.57, 0.2, 0.39, 0.16, 0.31, 0.31
                    ], 
                   ['2019-04',
                    29.78, 20.79, 13.69, 11.26, 6.4, 5.93, 2.8, 2.91, 1.47, 2.17, 0.66, 0.74, 0.37, 0.37, 0.66
                    ], 
                   ['2019-05',
                    29.99, 21.51, 12.47, 11.81, 5.68, 5.22, 3.43, 3.05, 1.23, 2.45, 0.74, 0.88, 0.42, 0.46, 0.67
                    ], 
                   ['2019-06',
                    33.24, 22.7, 11.17, 10.35, 5.78, 5.55, 2.93, 2.58, 1.25, 1.68, 0.82, 0.51, 0.47, 0.51, 0.47
                    ], 
                   ['2019-07',
                    32.85, 21.58, 13.26, 10.34, 5.72, 5.68, 2.95, 2.06, 1.22, 1.7, 0.45, 1, 0.42, 0.39, 0.39
                    ], 
                   ['2019-08',
                    31.89, 21.41, 12.39, 11.64, 5.5, 5.66, 3.14, 2.78, 1.42, 1.62, 0.81, 0.78, 0.13, 0.45, 0.39
                    ], 
                   ['2019-09',
                    32.48, 23.38, 12.86, 10.02, 4.99, 5.42, 2.69, 2.76, 1.03, 1.81, 0.35, 0.78, 0.28, 0.46, 0.67
                    ], 
                   ['2019-10',
                    32.27, 23.18, 12.21, 11.22, 6.55, 4.95, 2.41, 2.58, 0.92, 1.7, 0.46, 0.35, 0.28, 0.25, 0.67
                    ], 
                   ['2019-11',
                    33.12, 20.28, 11.45, 10.23, 4.9, 7.15, 3.54, 3.01, 1.65, 1.72, 0.53, 0.93, 0.4, 0.3, 0.79
                    ], 
                   ['2019-12',
                    35.18, 21.37, 10.55, 10.13, 5.41, 4.81, 3.03, 2.57, 1.35, 2.05, 0.98, 0.89, 0.79, 0.28, 0.61
                    ], 
                   ['2020-01',
                    28.78, 22.72, 12.97, 11.69, 5.63, 5.48, 2.8, 3.34, 1.67, 1.86, 0.7, 1.13, 0.31, 0.27, 0.66
                    ], 
                   ['2020-02',
                    27.53, 20.88, 12.78, 11.07, 6.72, 6.35, 3.05, 3.6, 2.23, 2.01, 0.97, 1, 0.33, 0.37, 1.11
                    ], 
                   ['2020-03',
                    29.56, 21.34, 12.22, 11.9, 6.58, 5.25, 3.37, 3.41, 1.72, 1.57, 1.06, 0.63, 0.31, 0.35, 0.74
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba výší úvěru v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-21-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart21);
    function drawCOLUMN3Chart22() {
        var data = google.visualization.arrayToDataTable([
                ['Datum originace', '6 až 12 měs.', '13 až 18 měs.', '19 až 24 měs.', '25 až 30 měs.', '31 až 36 měs.', '37 až 42 měs.', '43 až 48 měs.', '49 až 54 měs.', '55 až 60 měs.', '61 až 66 měs.', '67 až 72 měs.', '73 až 78 měs.', 'od 79 měs.'],
                   ['2016-02',
                    9.3458, 8.4112, 11.5265, 9.6573, 9.9688, 5.6075, 11.215, 3.7383, 6.2305, 5.919, 4.6729, 2.1807, 11.5265
                    ], 
                   ['2016-03',
                    3.1579, 2.807, 8.0702, 7.0175, 12.9825, 7.7193, 11.2281, 5.614, 6.6667, 4.5614, 5.9649, 3.1579, 21.0526
                    ], 
                   ['2016-04',
                    2.5105, 2.5105, 10.4603, 5.4393, 9.205, 8.7866, 10.4603, 7.9498, 8.3682, 10.0418, 6.6946, 2.0921, 15.4812
                    ], 
                   ['2016-05',
                    3.5714, 3.2468, 9.7403, 7.7922, 10.0649, 7.4675, 10.7143, 3.8961, 9.7403, 4.2208, 4.8701, 3.8961, 20.7792
                    ], 
                   ['2016-06',
                    1.145, 6.1069, 8.7786, 6.1069, 6.8702, 4.9618, 10.3053, 8.3969, 6.8702, 4.5802, 9.9237, 4.9618, 20.9924
                    ], 
                   ['2016-07',
                    3.139, 3.5874, 5.3812, 7.6233, 8.0717, 6.278, 10.3139, 7.6233, 12.5561, 6.278, 8.9686, 4.0359, 16.1435
                    ], 
                   ['2016-08',
                    2.2472, 2.9963, 7.1161, 7.4906, 8.6142, 8.6142, 9.3633, 7.4906, 10.1124, 2.9963, 6.367, 3.7453, 22.8464
                    ], 
                   ['2016-09',
                    2.5641, 4.7009, 8.9744, 5.5556, 4.2735, 4.2735, 11.1111, 8.1197, 8.1197, 4.2735, 11.9658, 3.4188, 22.6496
                    ], 
                   ['2016-10',
                    2.952, 3.69, 7.7491, 4.428, 7.0111, 6.2731, 11.8081, 7.7491, 10.7011, 5.1661, 8.1181, 5.9041, 18.4502
                    ], 
                   ['2016-11',
                    1.182, 3.3097, 6.8558, 5.4374, 7.3286, 6.383, 11.3475, 4.7281, 8.5106, 3.7825, 6.8558, 7.3286, 26.9504
                    ], 
                   ['2016-12',
                    2.1978, 3.0769, 6.8132, 4.3956, 7.033, 5.2747, 9.8901, 7.4725, 7.4725, 4.3956, 4.1758, 6.3736, 31.4286
                    ], 
                   ['2017-01',
                    3.2828, 3.5354, 5.303, 5.5556, 9.3434, 3.7879, 10.3535, 8.5859, 7.5758, 4.5455, 8.3333, 6.5657, 23.2323
                    ], 
                   ['2017-02',
                    1.3158, 3.9474, 5.2632, 5.2632, 6.5789, 6.0526, 12.8947, 7.3684, 8.9474, 7.6316, 6.8421, 5.5263, 22.3684
                    ], 
                   ['2017-03',
                    4.0404, 4.798, 6.8182, 4.798, 5.303, 5.8081, 11.8687, 7.0707, 10.8586, 4.798, 6.5657, 3.7879, 23.4848
                    ], 
                   ['2017-04',
                    2.551, 3.0612, 6.3776, 7.1429, 7.9082, 6.1224, 7.9082, 6.6327, 7.9082, 8.6735, 5.3571, 4.5918, 25.7653
                    ], 
                   ['2017-05',
                    2.5031, 2.8786, 6.1327, 5.0063, 5.8824, 4.7559, 9.5119, 5.5069, 7.5094, 5.8824, 6.8836, 5.1314, 32.4155
                    ], 
                   ['2017-06',
                    2.3185, 2.4194, 7.0565, 5.3427, 5.746, 6.0484, 9.0726, 6.3508, 8.4677, 4.9395, 6.8548, 3.8306, 31.5524
                    ], 
                   ['2017-07',
                    1.9689, 4.2487, 6.5285, 6.2176, 4.9741, 4.8705, 10.8808, 6.4249, 8.1865, 4.9741, 5.8031, 4.9741, 29.9482
                    ], 
                   ['2017-08',
                    2.2589, 3.649, 7.5586, 5.7341, 5.6473, 6.603, 9.5569, 4.344, 7.1242, 4.2572, 6.8636, 3.3884, 33.0148
                    ], 
                   ['2017-09',
                    3.5772, 3.4959, 6.0163, 4.3902, 6.1789, 6.3415, 10.0813, 5.935, 6.748, 5.7724, 6.6667, 3.9024, 30.8943
                    ], 
                   ['2017-10',
                    2.3352, 3.0907, 6.9368, 5.3571, 6.3874, 4.6016, 9.1346, 5.7005, 6.7308, 5.5632, 5.1511, 5.2885, 33.7225
                    ], 
                   ['2017-11',
                    2.9809, 3.4308, 6.2992, 5.793, 5.0056, 5.1744, 11.3048, 4.8931, 6.8616, 5.5681, 6.3555, 4.4432, 31.8898
                    ], 
                   ['2017-12',
                    3.8633, 3.4918, 7.1322, 5.052, 5.2749, 6.5379, 10.847, 6.5379, 5.3492, 5.1263, 6.0178, 4.4577, 30.312
                    ], 
                   ['2018-01',
                    3.5688, 3.9405, 5.0558, 5.7993, 5.8736, 5.2045, 9.145, 5.1301, 6.9888, 6.0967, 6.0223, 3.7918, 33.3829
                    ], 
                   ['2018-02',
                    3.3141, 3.6023, 5.7637, 4.9712, 4.611, 4.683, 10.6628, 5.5476, 6.7003, 5.5476, 5.4755, 4.8991, 34.2219
                    ], 
                   ['2018-03',
                    2.8664, 4.0022, 5.4624, 5.192, 5.4083, 5.3002, 8.6533, 4.8134, 7.8421, 5.2461, 5.7328, 4.7052, 34.7756
                    ], 
                   ['2018-04',
                    3.1414, 3.6067, 6.1082, 3.8394, 4.7702, 6.05, 10.0058, 5.8755, 7.2717, 5.2356, 5.4101, 5.0611, 33.6242
                    ], 
                   ['2018-05',
                    2.3484, 3.823, 6.6084, 4.97, 6.0076, 5.3523, 10.1038, 5.7892, 6.9907, 4.5877, 5.953, 4.0961, 33.3697
                    ], 
                   ['2018-06',
                    2.5615, 3.3149, 6.6298, 4.7715, 6.6298, 5.3742, 10.3466, 4.3697, 6.2783, 4.7715, 5.8764, 4.5203, 34.5555
                    ], 
                   ['2018-07',
                    3.1072, 3.0554, 6.4733, 4.8679, 5.2305, 4.9715, 9.7359, 4.609, 8.2341, 4.8162, 5.1787, 4.0911, 35.6292
                    ], 
                   ['2018-08',
                    3.3578, 4.1448, 6.6107, 4.6695, 5.2466, 5.9286, 9.6013, 5.1941, 6.978, 5.0367, 5.5089, 4.5645, 33.1584
                    ], 
                   ['2018-09',
                    3.2668, 3.9927, 6.2916, 5.1422, 5.3842, 4.5372, 9.3769, 4.9607, 6.8966, 6.1101, 5.4446, 3.9927, 34.6038
                    ], 
                   ['2018-10',
                    4.2581, 3.2046, 6.5408, 6.0579, 4.5654, 5.3117, 10.1844, 4.5215, 7.0676, 4.4776, 6.453, 4.0825, 33.2748
                    ], 
                   ['2018-11',
                    3.2735, 4.9982, 7.8493, 4.9278, 6.0542, 5.8782, 9.7149, 4.1535, 6.019, 4.8926, 4.8222, 4.2591, 33.1573
                    ], 
                   ['2018-12',
                    5.7525, 4.5322, 8.0186, 5.2876, 5.8106, 5.0552, 10.6334, 4.7066, 5.8687, 3.835, 3.9512, 3.6607, 32.8879
                    ], 
                   ['2019-01',
                    5.64, 3.4821, 7.5037, 5.6891, 5.4929, 4.9534, 8.9259, 5.591, 6.3266, 4.9044, 4.8553, 3.7764, 32.8592
                    ], 
                   ['2019-02',
                    3.9609, 3.6813, 7.4091, 4.4734, 5.7316, 5.3122, 9.0401, 5.918, 6.384, 4.5666, 5.1724, 3.9609, 34.3896
                    ], 
                   ['2019-03',
                    3.605, 4.4671, 7.6411, 3.8793, 5.6034, 5.721, 8.8166, 6.4655, 7.2492, 4.0752, 5.094, 4.232, 33.1505
                    ], 
                   ['2019-04',
                    3.8646, 3.975, 7.2874, 4.8583, 5.5208, 5.2632, 9.3485, 5.3736, 6.1097, 5.8152, 4.1958, 4.0486, 34.3393
                    ], 
                   ['2019-05',
                    4.2747, 4.1696, 6.9376, 4.4149, 5.7463, 5.2558, 9.7407, 4.7652, 6.7975, 5.431, 4.3798, 3.4688, 34.6181
                    ], 
                   ['2019-06',
                    3.7891, 4.8438, 7.5391, 4.0625, 5.5078, 5.2734, 10, 4.5312, 5.4297, 4.1797, 4.7656, 3.6328, 36.4453
                    ], 
                   ['2019-07',
                    4.5922, 4.2068, 7.9961, 4.7206, 6.0051, 4.817, 9.7624, 4.817, 6.1978, 4.1105, 4.5279, 4.1105, 34.1362
                    ], 
                   ['2019-08',
                    3.7516, 4.3338, 7.4386, 4.4955, 5.6598, 4.5925, 9.282, 4.3014, 6.3066, 4.9806, 5.0129, 4.5278, 35.3169
                    ], 
                   ['2019-09',
                    3.7549, 4.853, 7.1201, 5.3135, 6.022, 4.853, 9.5643, 4.9593, 5.8448, 4.7821, 4.5342, 3.9674, 34.4315
                    ], 
                   ['2019-10',
                    3.6093, 3.8924, 7.3248, 5.2017, 5.5202, 5.2725, 9.3064, 4.3878, 5.4494, 5.3432, 4.3878, 4.6355, 35.6688
                    ], 
                   ['2019-11',
                    4.2687, 3.9378, 7.2138, 4.5334, 4.6658, 4.9636, 9.4639, 3.7723, 6.949, 4.5996, 5.4269, 4.368, 35.8372
                    ], 
                   ['2019-12',
                    4.293, 3.9664, 8.4461, 4.3397, 5.9729, 4.1531, 9.0527, 4.3397, 5.9263, 4.293, 4.8063, 4.573, 35.8376
                    ], 
                   ['2020-01',
                    4.0388, 4.2718, 7.4175, 4.1553, 4.6602, 5.1262, 8.0388, 4.3495, 6.4466, 5.4369, 4.6214, 3.4175, 38.0194
                    ], 
                   ['2020-02',
                    3.6776, 3.8633, 5.7578, 3.9004, 5.6835, 4.4205, 8.2467, 5.052, 6.7979, 4.4577, 5.2377, 3.9376, 38.9673
                    ], 
                   ['2020-03',
                    3.4064, 4.0329, 7.361, 5.4424, 6.2647, 4.2287, 8.1049, 4.6985, 5.834, 4.3853, 4.581, 4.581, 37.0791
                    ]
        ]);
        var options = {
            chart: {
                title: 'Skladba délek úvěru v čase',
                subtitle: 'Vygeneroval Lukáš Petrovický dne 6. 4. 2020 ze Zonky loanbooku k 4/2020.'
            },
            
            axes: {
                y: {
                  0: {label: 'Podíl počtu na celku [%]'}
                },
            },
            
            isStacked: true
        };
        var chart_div = document.getElementById('chart-COLUMN-22-interactive');
        var chart = new google.charts.Bar(chart_div);

        chart.draw(data, google.charts.Bar.convertOptions(options));
    }
  google.charts.setOnLoadCallback(drawCOLUMN3Chart22);
